[
    {
        "text": " From the Doris Duke Foundation, which aims to support the well-being of people and the planet for a more creative, equitable, and sustainable future. And from the William T. Grant Foundation, supporting research to improve the lives of young people, at wtgrantfdn.org.",
        "start": 0.009,
        "end": 29.019
    },
    {
        "text": " For KAWC News, I am Chris McDaniel. Arizona State Election Director Lisa Mara, along with a delegation from the Office of the Secretary of State, were at the Yuma County Recorder's office Thursday morning to test the voting machines in advance of upcoming elections. Their testing showed the machines are 100% accurate. I spoke to Mara after the testing had concluded.",
        "start": 31.749,
        "end": 53.439
    },
    {
        "text": " So today we conducted what's called the logic and accuracy test, the LNA test for counties. Anytime there is a federal or state election, the Secretary of State's office is responsible for going to each county and taking a random selection of precincts, a random number of ballots.",
        "start": 54.224,
        "end": 69.753
    },
    {
        "text": " We have to make sure every candidate gets votes, gets overvotes, undervotes, blank ballots. Every congressional district is tested. Every legislative district is tested. And the county has no idea how many ballots we bring or what those results are. You observed us randomly picking machines, testing all the accessible voting devices, and then comparing the results. And the results were spot on, 100% match, 528 ballots. So Yuma County passed with a perfect score.",
        "start": 69.753,
        "end": 95.828
    },
    {
        "text": " Yuma County passed with a perfect score. Yuma County has amazing election officials, and we're very lucky that we have them. They're good partners. So you guys are all over the state today. How many of you are going to go to each county and do the same thing? So we can't go to each county every day, the same day, but we do three counties a day. So today, after we leave here, this was our first test today. We go to La Paz, and then we go to Mojave.",
        "start": 95.828,
        "end": 115.657
    },
    {
        "text": " And then we have two counties tomorrow and one county next week, and then we're done. So we started out Monday morning testing the counties three a day. And counties can't start early voting using machines until they have a successful LNA. So Yuma County is good to go. Why is it important to ensure accuracy and security in advance of the upcoming elections?",
        "start": 115.657,
        "end": 135.145
    },
    {
        "text": " It's critical. It's paramount. We've got to have confidence in our elections. We've got to have confidence in our election officials. And when you consider that our team at the Secretary of State's office marks, hand marks, mind you, they're not machine printed, hand marks ballots with a random generated script so we know what those results are. And they hand mark 12,000 to 15,000 ballots, take them across the state to counties, and they're 100 percent match in every county. And if they're not 100 percent match, we have to go back and figure why not.",
        "start": 135.145,
        "end": 161.766
    },
    {
        "text": " And usually it's human error on our staff's part from mismarking a ballot. So we can identify that quickly, fix that, and then make sure we've got a count. Because every vote matters. If you're one off, you're one off and you've got to find out why. So it's incredibly important to the security and accuracy of elections.",
        "start": 161.766,
        "end": 178.387
    },
    {
        "text": " And you said earlier, a lot of times it's just human error. So you guys are looking for human error and the machines are working today. So how does that work? You know, before we came here, they've tested thousands of ballots when they got their program. So they've checked the audio because it's not just the printed ballot, right? It's the audio. It's making sure that the accessible voting devices work.",
        "start": 178.387,
        "end": 196.544
    },
    {
        "text": " and that if I have a vision impairment or a physical disability, I'm still able to vote in person on election day if that's how I choose to vote. So all those things have been tested, and I can't be prouder of all the counties, especially Yuma. The Fontes office, you guys are ready for this busy season coming up?",
        "start": 196.544,
        "end": 213.524
    },
    {
        "text": " We are. We're busy all the time. But right now, the counties are really the busy ones. So we've got the LNA testing under the belt almost. So for us, our part is done. Because the Secretary of State's office, we don't conduct elections. Counties do. We don't register voters. Counties do that. But the next thing that's facing our office is ballot measure filing.",
        "start": 213.524,
        "end": 232.671
    },
    {
        "text": " because the deadline for ballot measure filing is July 3rd, same day as early voting starting, so it's going to be very busy. And we've anticipated four filings, and if all four of those come through with estimated signatures that we're thinking about, that's roughly 2.1 million lines of signatures.",
        "start": 232.671,
        "end": 248.592
    },
    {
        "text": " that our office reviews, and then sends a 5% sampling to counties. So keep in mind how busy counties are going to be because they're during early voting most of the month of July, and then they'll be doing those random checks of samples of those voters for the ballot measure. So it's going to be very busy times in elections. And the government's at work. Government's at work. I'm Chris McDaniel.",
        "start": 248.592,
        "end": 269.258
    },
    {
        "text": " A service of Arizona Western College for 50 years, this is 88.9 FM KAWC. You can also hear us with the KAWC app and at kawc.org. You can follow us or leave us your comments at facebook.com slash kawc radio.",
        "start": 270.947,
        "end": 285.435
    },
    {
        "text": " KAWC and Border Radio are supported by Solari Crisis and Human Services, providing text-initiated support for any situation, which is available 24 hours a day and confidential. Specialists can help with crisis situations and stressful events. Help is available by texting HOPE to 4HOPE, H-O-P-E to 44673.",
        "start": 285.913,
        "end": 305.776
    },
    {
        "text": " I'm Maria Hinojosa. This week on Latino USA, episode one of our two-part investigation into the strange death around the death of a man in a U.S. immigrant detention center. We look into why and how Jose de Jesus died, who runs immigration detention centers, and who's accountable for taking care of the people there. That's this week on Latino USA.",
        "start": 306.544,
        "end": 329.872
    },
    {
        "text": " We hope you can join us for Latino USA with Maria Hinojosa. That airs every Friday at 7 p.m. here on KAWC 88.9 FM. Another hot, sunny, and breezy day here in southwest Arizona. Yuma can expect a high near 110 with 20 mph wind gusts. The low tonight for Yuma around 84. Parker can expect a high near 111 with some 25 mph wind gusts. The low tonight for Parker should be around 81.",
        "start": 337.022,
        "end": 364.497
    },
    {
        "text": " The City of Yuma presents Orienteering 101, an introduction to the sport of navigation using a map and compass. Orienteering exercises the body and mind, and this introduction activity happens from 9 to 11 a.m. on July 6th at the Riverside Outdoor Education Center on Prison Hill Road. More under Parks and Recreation at yumaaz.gov.",
        "start": 365.572,
        "end": 385.742
    },
    {
        "text": " It's Morning Edition from NPR News. I'm Michelle Martin. And I'm Layla Faudel. Four black women at Harvard University, including Harvard's first black president, Claudine Gay, have been accused of plagiarism by right-wing activists in recent months. Gay resigned as president in January under pressure that was compounded by her congressional testimony about confronting anti-Semitism on campus.",
        "start": 385.742,
        "end": 408.183
    },
    {
        "text": " Critics have also used plagiarism allegations to raise doubts about campus policies on diversity, equity, and inclusion. Philip Martin of member station GBH in Boston reports. Karen Mapp, a professor at Harvard's Graduate School of Education, has never been targeted.",
        "start": 408.183,
        "end": 423.797
    },
    {
        "text": " But she wonders aloud when they might come for her. Professor Mapp's reference to they is to right-wing activists who have leveled what she terms selective accusations of plagiarism against four black women at Harvard. Why is it only black women? It seems like, at least in the case of Harvard and some of the institutions I know...",
        "start": 424.002,
        "end": 444.462
    },
    {
        "text": " That seems to be who's being targeted. On March 20th, activist Christopher Ruffo posted on X, formerly Twitter, quote, Let's not ignore the pattern. This is the fourth black female CRT DEI scholar to be accused of plagiarism at Harvard, unquote. Critical race theory, or CRT, is a body of legal scholarship that delves into structural racism.",
        "start": 444.462,
        "end": 469.241
    },
    {
        "text": " Ruffo's accusations come after Claudine Gay testified before a Republican-led congressional committee looking into anti-Semitism. We reached out to Ruffo for the story. He's a senior fellow with the right-leaning Manhattan Institute. We received no response. His colleague, Ilya Shapiro, spoke with NPR. Claudine Gay is the apotheosis of the anti-intellectual movement.",
        "start": 469.241,
        "end": 493.524
    },
    {
        "text": " that values DEI identity and activism over truth-seeking merit and education. She is sort of the epitome of the crisis in higher education.",
        "start": 493.831,
        "end": 502.073
    },
    {
        "text": " A university investigation concluded Gay did not violate Harvard's research standards. In January, she resigned as Harvard president, but returned to faculty as professor of government and African-American studies. Ruffo then directed charges of plagiarism against Sherry Charleston, chief diversity officer, Shirley Green, Title IX coordinator, and Christina Cross, a sociology professor. Three more black women at Harvard. All declined comment.",
        "start": 502.278,
        "end": 528.968
    },
    {
        "text": " Writer Jonathan Bailey runs the online publication Plagiarism Today. Bailey says that while some citations in the published work of these four women may warrant a review, most do not amount to research misconduct. Conservatives obviously are not particularly fond of DEI programs, and they see this as a way to attack it.",
        "start": 529.667,
        "end": 551.34
    },
    {
        "text": " Bailey has exposed plagiarism in higher education for 18 years, and he laments that plagiarism, from his perspective, is being, quote, weaponized. This isn't a case where they're checking everyone and happen to be finding, you know, plagiarism in these DEI cases. They are literally focusing all of their effort on those cases and totally ignoring pretty much everyone else.",
        "start": 551.425,
        "end": 574.292
    },
    {
        "text": " I don't even know what to say. I don't. Professor Karen Mapp says she is stunned by attempts by right-wing activists to discredit black scholarship. I think if people want to come for you, they're going to come for you. I think the question is why. The answer is clear, says Barbara Ransby, professor of history at the University of Illinois, Chicago. There's certain people, certain ideas, certain bodies of scholarship.",
        "start": 574.531,
        "end": 598.473
    },
    {
        "text": " that are just undeserving, that don't fit into the sort of longstanding white supremacist patriarchal notion of the academy of brilliance, of intelligence. Khalil Gibran Muhammad, who teaches history at Harvard, says a broader conservative campaign is in motion.",
        "start": 598.729,
        "end": 616.852
    },
    {
        "text": " If these people have their way, they will criminalize even the ability to talk about race in America, let alone to track it or to study it or to look at the racial disparities that continue to be a fundamental threat to a functioning, healthy democracy. Professor Muhammad says we've already seen the banning of certain books and some black history courses in Florida and Texas. This followed Ruffo's success in redefining critical race theory.",
        "start": 616.852,
        "end": 644.138
    },
    {
        "text": " Ilya Shapiro of the Manhattan Institute scoffs at the suggestion that there is systemic racism. In terms of racial discrimination, I just, I don't see evidence of it. Shapiro notes two exceptions, especially in higher education.",
        "start": 644.77,
        "end": 658.114
    },
    {
        "text": " I do see great evidence of discrimination against Asian American applicants and white applicants. Sociologist Joan Donovan, an assistant professor of journalism and an expert on disinformation at Boston University, says opposition to DEI and race studies is all about white grievance.",
        "start": 658.268,
        "end": 675.247
    },
    {
        "text": " They believe having to go through the process as a white person, particularly as a white man, disadvantages them. And I think people who are white have this vision of whiteness as being more advantaged and therefore are owed these positions. Activists like Shapiro and Ruffo say they are seeking a return to, quote, the traditional core mission of higher education, unquote, which they characterize as colorblind.",
        "start": 675.247,
        "end": 704.991
    },
    {
        "text": " An undercurrent of white supremacy has also been the false assumption of black incompetence. Barbara Ransby says those declaring themselves to be colorblind while making selective plagiarism accusations should be viewed skeptically. We saw that during Reconstruction when black politicians finally assumed positions of leadership and there was a mockery made of their ability to speak, lead, legislate, etc.,",
        "start": 705.247,
        "end": 731.084
    },
    {
        "text": " Some of the kinds of character assassinations that we've seen on black women academics is a part of that larger context.",
        "start": 731.408,
        "end": 737.824
    },
    {
        "text": " Harvard University officials did not respond to NPR's request for comment, but in a statement, Frank Dobbin, Harvard's sociology department chair, says the claims are, quote, bogus against the black women. Meanwhile, Christopher Ruffo, anonymous complainants, and the online publication Free Beacon are calling for more investigations, not only at Harvard, but also at MIT, UCLA, and Columbia University.",
        "start": 738.148,
        "end": 765.913
    },
    {
        "text": " Ransby says as an historian on race and gender, she would not be surprised if they came after her too. Because that's the strategy is to bully and intimidate and make people silent and fearful. I think we have to name this moment of growing racism, repression and authoritarianism, which means we have to organize, not something academics are known for doing.",
        "start": 765.913,
        "end": 787.329
    },
    {
        "text": " Barbara Ransby says those academics may have little choice but to defend themselves as plagiarism and anti-DEI campaigns focused against black scholars escalate. For NPR News, I'm Philip Martin in Boston.",
        "start": 787.329,
        "end": 803.234
    },
    {
        "text": " This is Morning Edition from NPR News. Our theme music was inspired by BJ Lederman. I'm Lilo Faldin. And I'm Michelle Martin.",
        "start": 812.329,
        "end": 819.411
    },
    {
        "text": " A service of Arizona Western College for more than 50 years, this is KAWC Yuma, KAWP Parker, 88.9 FM. On the KAWC app and at kawc.org, trusted news for Yuma and La Paz counties.",
        "start": 836.715,
        "end": 852.176
    },
    {
        "text": " The City of Yuma will host its Independence Day celebration on July 4th at Desert Sun Stadium. The family-friendly, non-alcoholic event starts at 6 in the evening and will feature food vendors, a DJ, and a foam party. Attendees are encouraged to bring their own chairs. Only clear bags will be allowed. And the celebration will conclude with fireworks at 9.",
        "start": 853.439,
        "end": 873.029
    },
    {
        "text": " Another breezy day here in southwest Arizona in Parker. Winds gusting up to 25 miles per hour today and tonight. The high this afternoon for Parker 111. The low tonight in Parker 81. In Yuma, the high today should be 110 with 20 mile per hour wind gusts today and tonight. The low tonight for Yuma around 84.",
        "start": 874.189,
        "end": 891.698
    },
    {
        "text": " Coming up on Marketplace. In the American Southwest, water has always been precious. Whiskies for drinking. Water, it's for fighting. It has been a constant battle against Mother Nature. But climate change and growth have raised the stakes. A mega drought has plagued the region for more than 20 years. And the West is still grappling with how to equitably share access to water.",
        "start": 895.708,
        "end": 923.422
    },
    {
        "text": " The earlier you use it and the more you take, the greater your right is. It treats the water like property. We're finding out what it will take to survive in the hotter, drier West. This direct potable reuse water is so clean and fresh. And this is wastewater, right? This is coming from the sewer? Originally, yes. I'm Amy Scott. Join me for the Marketplace special, How We Survive the Worth of Water.",
        "start": 923.422,
        "end": 952.534
    },
    {
        "text": " Live from NPR News in Washington, I'm Lakshmi Singh. Sleeping in public remains banned in Grants Pass, Oregon. Today, the U.S. Supreme Court sided with the city in its defense of its restriction. Grants Pass challenged lower court rulings. NPR's Jennifer Ludden reports on a decision that has implications for an estimated quarter of a million people in the United States who are unhoused.",
        "start": 956.408,
        "end": 979.326
    },
    {
        "text": " Lower courts had ruled it is cruel and unusual to punish people for sleeping outside if they have nowhere else to go. And that has meant that if a city wanted to clear out a tent encampment, it had to first offer people a shelter bed. And a lot of places don't have nearly enough of those.",
        "start": 979.326,
        "end": 994.616
    },
    {
        "text": " Local officials had argued this hamstrung their efforts to keep public spaces safe and open for everyone. And now the Supreme Court has agreed. NPR's Jennifer Ludden, that ruling and others from the Supreme Court coming a day after the first general election debate between former President Donald Trump and President Biden. Campaign stops scheduled today in North Carolina and New York. The head of the Federal Emergency Management Agency is in northwest Iowa. That's where catastrophic flooding occurred.",
        "start": 994.616,
        "end": 1023.831
    },
    {
        "text": " Destroy property and force communities to evacuate away from rivers swollen with rain. Iowa Public Radio's Sheila Brummer reports flooding victims are seeking help. Mark Casey, who lives near the Little Sioux River in Cherokee, says he's been flooded out a half dozen times, but not like this. The river crested two times over flood stage with his home right in its path. So we're hoping FEMA will buy us out.",
        "start": 1023.831,
        "end": 1047.261
    },
    {
        "text": " They're going to come in here and declare a national disaster area. FEMA Administrator Deanne Criswell toured his town and two others impacted by record-breaking flooding. And we'll decide how to respond to Iowa Governor Kim Reynolds' request to expand a federal disaster declaration. On Tuesday, President Biden granted the disaster declaration for five Iowa counties. For NPR News, I'm Sheila Brummer, Cherokee, Iowa.",
        "start": 1047.722,
        "end": 1071.135
    },
    {
        "text": " Israel allowed the first medical evacuation of people from Gaza yesterday. First time. This has happened in nearly two months. Nineteen sick or wounded children and their parents or guardians were allowed to leave. But as NPR's Kat Lonsdorff reports, there are thousands more patients still waiting. It was the first medical evacuation since early May when Israel took over the Rafah crossing in the south on the border between Israel and Egypt.",
        "start": 1071.544,
        "end": 1093.37
    },
    {
        "text": " Before that time, around 50 sick or injured Palestinian patients were allowed to leave into Egypt every day. But Egypt has refused to reopen its side of the crossing until Palestinians are back in control. So patients have been waiting for Israel to allow them out through Israeli territory. Medical officials in Gaza say many have died while waiting and some 25,000 more need treatment abroad.",
        "start": 1093.37,
        "end": 1115.862
    },
    {
        "text": " Two Israeli human rights organizations have petitioned Israel's Supreme Court to create a, quote, permanent mechanism to allow people to leave Gaza for medical treatment. That hearing is expected on Monday. Kat Lonsdorf, NPR News, Tel Aviv. The Dow is up 58 points. You're listening to NPR News.",
        "start": 1115.862,
        "end": 1133.831
    },
    {
        "text": " The top court in Iowa says a state can enforce a ban on most abortions after six weeks of pregnancy. The Iowa ruling was 4-3. The Department of Homeland Security says it's extending protections for more than 300,000 Haitians in the U.S. who are at risk of being deported back to a country where violent gangs are getting stronger. Secretary Alejandro Mallorca says anyone who established residence in the U.S. on or before June 3rd is eligible for temporary protected status through February 3rd, 2026.",
        "start": 1136.852,
        "end": 1166.374
    },
    {
        "text": " A new study is looking at the nation's most temperamental waterways known as ephemeral streams. These fill with water only after it rains. They're hugely important to the country's water quality. But as NPR's Nathan Roth tells us, those waterways in the U.S. no longer have federal protection. Ephemeral streams lost their federal protections last year after a ruling by the U.S. Supreme Court which also removed protections for more than half of the nation's wetlands.",
        "start": 1166.374,
        "end": 1193.353
    },
    {
        "text": " The new study published in the journal Science found that more than half of the water flowing out of American river basins like the Mississippi, the Hudson, or the Columbia comes from temporary streams, which means those bigger waterways are also vulnerable to pollution in their smaller temporary sources. Since the Supreme Court's decision, some states have strengthened state laws to increase water protections. Others have weakened them. Nathan Rott, NPR News.",
        "start": 1193.353,
        "end": 1220.93
    },
    {
        "text": " U.S. stocks are trading higher this hour. The Dow Jones Industrial Average is up 52 points. The S&P has gained 11. The Nasdaq is up 36 points. I'm Lakshmi Singh, NPR News in Washington. Support for NPR comes from NPR stations. Other contributors include Indeed.",
        "start": 1221.169,
        "end": 1240.52
    },
    {
        "text": " Designed to be an end-to-end hiring solution for businesses of all sizes to attract, interview, and hire candidates, all from one platform. Learn more at Indeed.com slash NPR. A service of Arizona Western College for 50 years, this is 88.9 FM KAWC, available on the KAWC app and KAWC.org.",
        "start": 1240.828,
        "end": 1265.503
    },
    {
        "text": " The first sign that something is amiss at Lee Harris's house is the plastic bottles. Some bottles of water outside. Lots of them. Dozens of clear one-gallon bottles lined up outside the front door. Nice shirt. I love Arcade Fire.",
        "start": 1266.067,
        "end": 1283.473
    },
    {
        "text": " A fit blonde woman wearing an arcade fire T-shirt and a wide scarf holding her hair back comes out to greet me and my producer, Caitlin. I'm Caitlin. Nice to meet you. As you can see, we have a price to pay for living in paradise.",
        "start": 1283.524,
        "end": 1298.524
    },
    {
        "text": " I have to promise me to not think untoward of us because we've been literally camping in this house for six months now with no real running water. Inside, more bottles on the kitchen counter and all over the tile floor, which Lee admits hasn't been cleaned in a while.",
        "start": 1298.524,
        "end": 1320.162
    },
    {
        "text": " We do our best. We can't wash the floors or do things that normal water. You don't really think about how you use water on an everyday basis when it's just flowing from taps.",
        "start": 1320.162,
        "end": 1332.534
    },
    {
        "text": " She could turn on the taps and clean water would come out, but at a price Lee can no longer afford. Because here in Rio Verde foothills, in the scrub outside Scottsdale, Arizona, Lee and her husband Frank are among hundreds of people scrambling for water after the city cut them off.",
        "start": 1332.739,
        "end": 1352.705
    },
    {
        "text": " It's June 2023, and for more than six months at this point, Lee and Franck have been doing everything they can to avoid turning on their taps. And I literally took a pack of rubber bands, I mean really strong ones, and I banded all of the handles. You need to break yourself of that muscle memory of turning on and off a faucet.",
        "start": 1355.196,
        "end": 1378.882
    },
    {
        "text": " To get by, they've been living on water borrowed from work or friends' houses and collecting rainwater to flush their toilets and water their plants. But out here, during one of the hottest and driest summers on record, there hasn't been much rain, nearly none at all. And they're doing whatever they can to save every last drop that they have.",
        "start": 1379.206,
        "end": 1402.585
    },
    {
        "text": " I'm standing in my master bathroom shower. I've got several buckets of rainwater. It takes about two gallons to flush a toilet. And we go ahead and put it into the tank behind the toilet. So here we go. Anything to stay in our house, right? You've got to do what you got to do.",
        "start": 1402.858,
        "end": 1429.65
    },
    {
        "text": " I'm Amy Scott, and this is the Marketplace special, How We Survive the Worth of Water. More than 20 years into a mega-drought made worse by climate change, a lot of scientists think the word drought doesn't really cut it anymore. That what we're looking at in the American Southwest is aridification, a long-term drying out of the region.",
        "start": 1432.449,
        "end": 1456.852
    },
    {
        "text": " The go-to source of water, the Colorado River, can no longer accommodate everyone. And some of the fastest growing cities in the country, Denver, Phoenix, Las Vegas, depend on a dwindling resource. Scientists tell us by 2050, more than 5 billion people around the world will face water shortages.",
        "start": 1457.142,
        "end": 1479.138
    },
    {
        "text": " So over the next hour, we will explore solutions from the technology that's creating drinking water from some surprising sources to a growing movement to rethink our relationship with nature. We're going to start with the story of Lee Harris and Frank Avril and how they adapted to a crisis that could be in store for more of us in the future. Music",
        "start": 1479.462,
        "end": 1506.015
    },
    {
        "text": " It all started about five years ago when Lee and Franck started looking for a house near Scottsdale and discovered Rio Verde Foothills, an unincorporated community in Maricopa County. Franck and I are big outdoors people. We love hiking. And we'd be looking down over this very large expanse of desert and we'd see houses kind of placed in and around this gorgeous place.",
        "start": 1508.029,
        "end": 1534.394
    },
    {
        "text": " Sonoran Desert type of landscape, and we'd go, you know, that's a really pretty area. They found what seemed like the perfect place, a large stucco house with high ceilings and 35 windows to take in the mountain views. Plus, it had this other special quality. Its acoustics are superb. Franck, an accomplished classical oboist, fell in love, and I'm not kidding here, with the walls.",
        "start": 1534.394,
        "end": 1564.07
    },
    {
        "text": " Because the walls are circular, it's resonant but without being bouncy. Anytime, day or night, I can practice the oboe. You had a very specific wish list for a house. Absolutely. There was just one catch. Yeah, it's a beautiful home, but it is completely, you know, dependent on hauled water.",
        "start": 1564.411,
        "end": 1587.21
    },
    {
        "text": " Like many houses in rural communities, this one didn't come with a built-in supply of water, no pipes connected to a city water utility, but also no well to draw from. Instead, it had a 5,000-gallon underground water tank, which they'd have to pay someone in a huge truck to come and fill. Scottsdale is the nearest city. Guys in big trucks would buy water from the city and bring it out to Lee. It made her pause.",
        "start": 1587.415,
        "end": 1617.415
    },
    {
        "text": " It brought to mind the fact that we are on our own little island in this house, and it is a beautiful little island of paradise, but we have finite resources, and that tank was our finite resource.",
        "start": 1617.415,
        "end": 1635.077
    },
    {
        "text": " Still, for its size and beauty, the house was affordable, by Scottsdale standards, about a half a million dollars. It would be a stretch. Frank's mom has Alzheimer's disease, and he pays for her expensive care. You know, he blew most of his retirement just being able to get her into a care that would allow her to be, you know, clean and happy and taken care of by nurses.",
        "start": 1635.828,
        "end": 1663.797
    },
    {
        "text": " Lee and Frank are both semi-retired. She works at an assisted living facility, Frank at a grocery store. But between the sale of a condo they owned and their income from Social Security and their hourly jobs, they decided they could make it work. Then, six months after moving in, Lee was out driving when she noticed something.",
        "start": 1664.428,
        "end": 1686.817
    },
    {
        "text": " I started seeing signs on the rural metro fire department property that said, got water? She was intrigued. What could that be about? I immediately thought, this is not a good sign. I mean, the banner was a good banner, but this is not a good sign for us as a community if there is a question about water supply.",
        "start": 1687.227,
        "end": 1716.374
    },
    {
        "text": " When she got home, Lee pulled up the website she'd seen on the banner, and she would learn something disturbing. Years earlier, the city of Scottsdale had warned the two main water hauling companies in the community that it might have to cut off water to Rio Verde foothills. If the drought got severe enough, Scottsdale announced that it would prioritize its own residents.",
        "start": 1716.374,
        "end": 1739.906
    },
    {
        "text": " They tried to let us know that there was an oncoming train way in the distance, but that it would arrive if that drought continued. As that train approached, the community was divided over what to do. Some residents wanted to form a quasi-government entity to buy water from somewhere else. Others who had wells worried that such an entity could threaten their private property rights. They couldn't work anything out.",
        "start": 1740.35,
        "end": 1768.217
    },
    {
        "text": " Lake Mead, the reservoir that supplies Colorado River to people across the West, dropped to an all-time low. And on January 1, 2023, Scottsdale officially turned off the water to Rio Verde foothills.",
        "start": 1768.882,
        "end": 1783.968
    },
    {
        "text": " The city of Scottsdale stopped the transportation of water, making good on a year's worth of warnings that the municipal water supply was running dry. A community desperately searching for a source of water. Water tanks and reservoirs here at homes in the Rio Verde Foothills community are running low with no guarantee that they're going to be refilled.",
        "start": 1784.104,
        "end": 1803.404
    },
    {
        "text": " Lee and Franck, along with anyone living on hauled water, would have to buy it somewhere else. The price jumped from about $130 for a full tank to more than $500. Because of not the water, but the diesel, the cost of diesel to truck in that water from more distant points.",
        "start": 1805.299,
        "end": 1827.125
    },
    {
        "text": " At that rate, Lee and Frank would have to pay about $380 a month. They couldn't afford it. For context, the average water bill for a single-family house in Scottsdale is $84. So Lee and Frank started to do everything they could",
        "start": 1827.415,
        "end": 1845.077
    }
]