[
    {
        "text": " From NPR News in Washington, D.C., this is Week in Edition. I'm Ayesha Roscoe. Good morning. President Biden is trying to reassure Democrats and the public that he's up for the rigors of a second term. We have the latest and a highlight from our college podcast challenge. Can you go a whole day without your cell phone? One Northwestern student gave it a try.",
        "start": 12.807,
        "end": 42.619
    },
    {
        "text": " I was sitting in the library this afternoon working on my homework, and I was just like, oh my gosh, this is so boring. I should check my phone. Ah, nobody can. Plus, updates on France's election, new leadership for NATO, and some great book recommendations for your summer reads. It's Sunday, July 7th. News is next.",
        "start": 42.79,
        "end": 61.715
    },
    {
        "text": " Live from NPR News in Washington, I'm Windsor Johnston. President Biden is back on the campaign trail today with a pair of stops in the crucial swing state of Pennsylvania. Biden visited a church in Philadelphia amid growing calls from his own party to withdraw his re-election bid. But as NPR's Tamara Keith reports, Biden says he isn't going anywhere.",
        "start": 64.36,
        "end": 90.23
    },
    {
        "text": " The head pastor at Mount Airy Church of God and Christ, J. Lewis Felton, asked worshipers to repeat after him, and they did. We love you, President Biden. The service was exuberant and on message as Biden pushes back on calls for him to step aside. He's a comeback kid. He's a fighter. Biden kept his remarks less overtly political. You know, I've been doing this a long time.",
        "start": 90.401,
        "end": 112.159
    },
    {
        "text": " And I, honest to God, have never been more optimistic about America's future if we stick together. After the service, Biden lingered to shake hands and take selfies. Tamara Keith, NPR News, Philadelphia. Israel and the Palestinian militant group Hamas are set to resume ceasefire talks this week. NPR's Greg Myrie reports there are encouraging signs that an agreement can be reached.",
        "start": 112.961,
        "end": 138.114
    },
    {
        "text": " Hamas now appears willing to accept a more gradual approach to its core demands, a permanent end to the fighting and a full withdrawal of Israeli forces from Gaza. This is according to multiple officials close to the talks who requested anonymity. This has raised hopes of a ceasefire, which the two sides have not been able to reach since a week-long truce last November.",
        "start": 138.37,
        "end": 160.469
    },
    {
        "text": " Israel and Hamas are expected to discuss a proposal outlined by President Biden which would begin with a six-week ceasefire. However, Israeli leader Benjamin Netanyahu has given no indication he's budging from Israel's main demand, the destruction of Hamas as a political and military force. Greg Myrie, NPR News, Tel Aviv.",
        "start": 160.469,
        "end": 181.954
    },
    {
        "text": " Voters in France went to the polls in the second round of a parliamentary election today. NPR's Eleanor Beardsley reports two main parties are hoping to stop the far right from getting an absolute majority in the lower house.",
        "start": 181.954,
        "end": 196.766
    },
    {
        "text": " Marine Le Pen's National Rally Party is leading after last week's first round. They're hoping for 289 seats, an absolute majority, so they can enact their anti-immigration program. Macron's centrist party and a leftist coalition are trying to stop them. 62-year-old Didier Gilles says he came out to block the far right.",
        "start": 196.886,
        "end": 215.776
    },
    {
        "text": " For us it's a very important vote and we must do what we can to prevent France to become a far-right country. Polls suggest Le Pen's party will come in first but be far from an absolute majority. The next French parliament is likely to be mired in chaos and gridlock by three mutually detesting ideological blocs. Eleanor Beardsley, NPR News, Paris. This is NPR News.",
        "start": 215.776,
        "end": 242.261
    },
    {
        "text": " Support for NPR comes from NPR stations. Other contributors include Easy Cater. Committed to helping companies, from nonprofits to the Fortune 500, find restaurants that cater meetings and events. With online ordering and 24-7 live support, learn more at easycater.com.",
        "start": 242.688,
        "end": 260.742
    },
    {
        "text": " And the time is 8.04. You're listening to member-supported Hawaii Public Radio. Good Sunday morning to you. I'm Jackie Young with a look at the latest local news. In politics, three former Hawaii Democratic governors are calling for President Biden to withdraw his bid for a second term after his poor debate performance last week.",
        "start": 260.964,
        "end": 280.947
    },
    {
        "text": " John Wahee, Ben Cayetano, and Neil Abercrombie sent out statements on Saturday calling the president frail and muddled as he debated with former President Donald Trump and unfit to run a successful campaign. The former governors wrote that the call for Biden to step down is not one of age, but of aging and its implications for defeating Donald Trump. Wahee is 78, Cayetano is 84, Abercrombie is 86.",
        "start": 280.947,
        "end": 307.637
    },
    {
        "text": " The Democratic National Convention will be held in Chicago from August 19th to the 22nd, where delegates from all 50 states will rally around nominations for president and vice president. And Hawaii's primary election is a little more than a month away. In advance of that, local elections officials, along with volunteer observers, went through the process of ensuring the integrity and security of the system.",
        "start": 307.637,
        "end": 331.51
    },
    {
        "text": " Last week, officials and volunteers from various political parties conducted what is called a logic and accuracy test of the voting equipment. Scott Nago, Chief Election Officer to KHUN, official observers will mark a test ballot and run it through the system to make sure it's counting accurately. That test will be repeated in each county in the coming week. That same equipment will be used at voter service centers across the state on Election Day.",
        "start": 331.51,
        "end": 359.394
    },
    {
        "text": " Voters should be receiving their primary election mail ballots at the end of July. If you don't, please contact the elections office. New for this year, voters can track their ballots by signing up through the elections website and to receive a text, email, or phone call to track their ballot.",
        "start": 359.394,
        "end": 376.544
    },
    {
        "text": " In weather, today and tonight will be mostly clear with some windward and mauka showers. Highs in the upper 80s, lows in the mid-70s. We'll have trade winds 15 to 20 miles per hour. And that's been a look at local news and weather. I'm Jackie Young. Now back to Weekend Edition on member-supported Hawaii Public Radio.",
        "start": 376.544,
        "end": 395.299
    },
    {
        "text": " This is Week in Edition from NPR News. I'm Aisha Roscoe. Good morning and thank you for joining us today. President Biden gave an exclusive interview to ABC News' George Stephanopoulos on Friday. The president defended his record and said he was fit to hold office again. He didn't seem to accept that he was lagging behind former President Donald Trump in many polls. Do you really believe you're not behind right now? I think it's all pollsters I talk to tell me it's a toss-up.",
        "start": 400.64,
        "end": 429.735
    },
    {
        "text": " So we're joined now by NPR senior national political correspondent Mara Eliason. Good morning, Mara. Good morning, Aisha. So this interview was intended to reassure not only American voters, but his fellow Democrats in Congress and other key members of the party. Did it work?",
        "start": 430.759,
        "end": 448.933
    },
    {
        "text": " I haven't seen any signs that it has. Democrats are still just as worried about Biden's ability to beat Trump. And I think the premise was always faulty that one interview with a tough but empathetic host or a couple of rallies where he was vigorous but still reading from a teleprompter was going to wipe away the damage from that dismal debate performance. And plus, as you just heard, he was on the defensive.",
        "start": 449.548,
        "end": 472.637
    },
    {
        "text": " He denied that he was down in the polls. He insisted he wouldn't leave the race. It was almost as if he was retreating to the origin story of his entire political career, which is that he's always counted out and he always proves his critics wrong. So this was never going to be a one and done situation. But that means that Biden is going to have to keep hammering those points on the campaign trail, right? That's right. And he was at a rally in Wisconsin on Friday. And here's a little bit of what he said.",
        "start": 472.637,
        "end": 502.5
    },
    {
        "text": " By the way, if you wonder whether Trump has it all together, did you ever hear how he explained the Fourth of July when he was president? No, I'm serious. This is true. His explanation how America won the Revolutionary War. I'm not making this up. He said in his Fourth of July speech five years ago, he said, George Washington's army won the revolution by taking control of the airports from the British. And talk about me misspeaking.",
        "start": 502.637,
        "end": 532.363
    },
    {
        "text": " Airports in the British in 1776. So there is a lot of evidence that Trump is slipping too. He's 78. He mixes up names. He rambles. But voters don't see his age and mental fitness as the kind of problem that they do for Biden. Character is more of an issue for Trump. And it's very hard for voters to unsee that debate because it's going to be everywhere on social media and in every Republican attack ad between now and November.",
        "start": 533.404,
        "end": 560.538
    },
    {
        "text": " A few names are being floated out there to replace President Biden. And we should be very clear that he's giving no indication that he'll be stepping down. But where do things stand?",
        "start": 561.015,
        "end": 573.712
    },
    {
        "text": " Thank you. Thank you. Thank you.",
        "start": 573.814,
        "end": 597.654
    },
    {
        "text": " What would plan B look like if Biden agrees to step aside? Most people tell me that they don't think there's time for a mini primary, a kind of debate a week until the convention in Chicago with five or seven candidates. And even if that did happen, how would a candidate stand up a $1 billion campaign in just a couple of weeks? The easiest plan B scenario to imagine for Democrats is that Kamala Harris becomes the candidate immediately.",
        "start": 597.654,
        "end": 621.374
    },
    {
        "text": " She can inherit the money and infrastructure. After all, it's called the Biden-Harris campaign. She's been vetted. She's the vice president. Hard to deny the first African-American, Asian-American woman. But there's no guarantee that Harris would do better than Biden. She's less popular than he is. She ran a pretty unimpressive campaign in 2020. Also, Democrats are worried about the $1 billion of Republican attack ads against her that are probably on the shelf right now ready to go.",
        "start": 621.374,
        "end": 647.773
    },
    {
        "text": " So what are you expecting to hear from the Trump and Biden campaigns this week?",
        "start": 648.012,
        "end": 651.681
    },
    {
        "text": " Well, both of them are holding rallies. Biden has two rallies in Pennsylvania today. He's going to do a solo press conference during that NATO meeting at the White House this week. That will be a real test. There won't be a teleprompter there. But Trump has been keeping a relatively low profile. He just is happy to let Biden struggle. But he has a big decision coming up. He has to decide who his vice president will be before the end of the Republican convention. And he's waiting to see what Biden does first because that will inform his choice.",
        "start": 652.312,
        "end": 679.189
    },
    {
        "text": " That's NPR senior national political correspondent Mara Eliasson. Thank you, Mara. Thank you, Ayesha. We now turn to Europe, where the North Atlantic Treaty Organization, or NATO, is getting a new secretary general. That job is going to mark Rolte, the outgoing Dutch prime minister. Rolte is taking the job at a fraught time. The ongoing war between Russia and Ukraine, increasing alignment between Russia, China, and North Korea, and so much more.",
        "start": 679.65,
        "end": 708.285
    },
    {
        "text": " Caroline de Gruyte is a contributing writer at Foreign Policy covering European affairs. And she joins us now from Brussels. Welcome to the program. Thank you. So first, tell us a bit about Rutte. When he was the Dutch prime minister, what were his marquee policies? Oof, very difficult to say because Mark Rutte is basically a manager. He is not so much a man of content.",
        "start": 708.285,
        "end": 735.23
    },
    {
        "text": " He is much more a consensus seeker. He basically managed four different coalition governments and is known in The Hague and beyond, actually, to value agreement over content. The Dutch political landscape is very fragmented. And so when his governments were in trouble, as they were from time to time,",
        "start": 735.367,
        "end": 761.271
    },
    {
        "text": " then he would not be very principled and would try to bend over backwards to keep the coalition going. And, you know, as you've reported, he'd been asked twice to head NATO by President Biden. He declined twice. Why was that and what changed? Because he felt that in the Netherlands, I mean, his time was up.",
        "start": 761.271,
        "end": 786.305
    },
    {
        "text": " People have been looking at the same prime minister for 14 years. There's a time to go. He simply felt it. So he started demining the field.",
        "start": 786.459,
        "end": 798.831
    },
    {
        "text": " And so first he had to let the government fall. And he did this last summer over a very small immigration issue. And everybody was surprised. Then came new elections, which were won in November by far-right leader Geert Wilders. And then it took four parties again, eight months, to form a new government. He didn't have the time to succeed Stoltenberg last year in October.",
        "start": 799.292,
        "end": 828.985
    },
    {
        "text": " And he apparently actively helped him to get his mandate extended with another year. So this has been his planning all along. You know, when then President Donald Trump was in office, he leaned on European members to pay more.",
        "start": 828.985,
        "end": 846.749
    },
    {
        "text": " And since then, he has said if they don't continue to pay more, that the U.S. would not protect them from Russia and that he'd encourage Russian forces to, quote, do whatever the hell they want, unquote. You know, so how will Ruta handle a potential second Trump presidency?",
        "start": 846.749,
        "end": 866.305
    },
    {
        "text": " In a very hands-on way, Rutte is very transatlantic. Moreover, he has dealt with Donald Trump before. And he was one of the few, actually, European leaders during Trump's presidency who actually somehow got along with him by making jokes, by also praising him.",
        "start": 866.391,
        "end": 889.565
    },
    {
        "text": " And, you know, he went into the Oval Office and says, oh, you have such a tiny desk, you know, sort of breaking all the tension that could possibly be there. And they started laughing. And then he left the Oval Office and Trump said, oh, I like this guy.",
        "start": 889.735,
        "end": 904.821
    },
    {
        "text": " And what about, you know, Russian President Vladimir Putin, who obviously has been building his own sort of coalition with China and North Korea? And what does that mean for NATO under Ruta?",
        "start": 904.923,
        "end": 921.067
    },
    {
        "text": " Rutte has experience with Putin because in 2014, the year also that Putin annexed the Crimea, he actually, or his cronies in Ukraine, shot a Malaysian airline plane out of the air above Ukraine with almost 300 people on board.",
        "start": 921.067,
        "end": 942.824
    },
    {
        "text": " and two-thirds of them were Dutch. Rutte actually dealt with this whole crisis. He had to talk to Putin a lot. Putin was lying to him. Putin didn't lift a finger to make sure that the bodies could go back to the Netherlands. He blocked and sabotaged every step on the way to an independent investigation into what had happened and who had shot that plane out of the air. So Rutte knows, I think,",
        "start": 943.473,
        "end": 972.159
    },
    {
        "text": " more perhaps than other Western leaders exactly what kind of a man Putin is. Well, do you think that he will be able to influence NATO members? Because while NATO members have remained resolute in their support of Ukraine, support in the U.S. seems to be fraying, especially among Trump supporters. How would Ruta address that issue?",
        "start": 972.159,
        "end": 1000.247
    },
    {
        "text": " Difficult to say, but I have from some distance seen him convincing European leaders over a migration deal with Turkey on behalf of Angela Merkel, who was then the chancellor of Germany. And Rutte was not such a fan of the deal, but, you know, he did what Merkel asked him. And, you know, he just this was the time when he really started enjoying the political European ballgame.",
        "start": 1000.247,
        "end": 1028.473
    },
    {
        "text": " That's Caroline de Gruyter, contributing writer at Foreign Policy. Thank you so much for speaking with us today. Thank you for having me.",
        "start": 1028.831,
        "end": 1036.118
    },
    {
        "text": " Weekend Edition is a production of NPR News, which is solely responsible for its content. Like a story you heard on this or another NPR program? Share it with a friend at NPR.org. While there, you can also hear stories you missed, enjoy expanded content, or connect to your favorite member station.",
        "start": 1045.981,
        "end": 1066.493
    },
    {
        "text": " You're listening to NPR News. Support for HPR comes from the Scheidler College of Business at UH Manoa, celebrating 75 years, offering the distance learning executive MBA and Master of HR Management.",
        "start": 1078.848,
        "end": 1096.374
    },
    {
        "text": " When you support HPR, you support community reporting about community issues. It's been more than eight years since a group of families from Ha'ena Kauai established the Ha'ena Community-Based Subsistence Fishing Area. The community creates rules regulating catch limits, size limits, species limits, and more. With your support, HPR brings you voices from our island communities. It's a tool that makes sure that we can keep on",
        "start": 1099.548,
        "end": 1127.995
    },
    {
        "text": " practicing and fishing the way we did and not excluding folks but saying like, hey, if you like come fish in this area, this is how we fish, this is how we take, this is how much we take. It's got to be community driven, got to be from the people of the place. They know their place better than anybody. Support local reporting on HPR. Donate at hawaiipublicradio.org.",
        "start": 1128.114,
        "end": 1150.486
    },
    {
        "text": " Next time on the New Yorker Radio Hour, how Robert Caro decided to write his landmark book, The Power Broker. I remember driving home from Albany that night thinking, everything you've been doing is basically baloney. Reporter and biographer Robert Caro, next time on the New Yorker Radio Hour. Beginning this morning at 9.",
        "start": 1158.114,
        "end": 1183.643
    },
    {
        "text": " Support for HPR comes from the University of Hawaii Foundation. Its For UH, For Hawaii campaign is connecting donors with UH to support student scholarships at all ten campuses.",
        "start": 1186.578,
        "end": 1200.964
    },
    {
        "text": " Support for NPR comes from the station and from the John D. and Catherine T. MacArthur Foundation, supporting creative people and effective institutions committed to building a more just, verdant, and peaceful world. More information is at macfound.org. From the Joyce Foundation, committed to advancing racial equity and economic mobility for the next generation in the Great Lakes region, learn more at joycefdn.org. And from ECMC Foundation,",
        "start": 1202.381,
        "end": 1231.254
    },
    {
        "text": " at ecmcfoundation.org.",
        "start": 1231.544,
        "end": 1234.855
    },
    {
        "text": " This is Week in Edition from NPR News. I'm Aisha Roscoe. Voting is underway in France in one of the most divisive, high-stakes elections in recent history. Marine Le Pen's far-right party is on the cusp of power for the first time after leading in last week's first-round voting. Today, President Emmanuel Macron's centrists and a far-left coalition will try to keep the hard right from getting a majority in Parliament.",
        "start": 1237.824,
        "end": 1263.729
    },
    {
        "text": " And enacting their agenda since the far right party's founding in the early 70s, French voters from across the political spectrum have come together to block them. So what's different this time? Let's go to NPR's Eleanor Beardsley, who's been out at polling places this morning. Hi, Eleanor. Hello. So what have people been telling you?",
        "start": 1263.729,
        "end": 1285.486
    },
    {
        "text": " Well, Paris does not vote for the far right generally, and everyone I spoke to said they're extremely nervous. They say France is in unknown territory with the far right poised to get power. I spoke to 62-year-old voter Didier Gilles. He told me he was shocked that it's come to this. Let's have a listen.",
        "start": 1285.486,
        "end": 1300.862
    },
    {
        "text": " At the moment, I'm ashamed to be a Frenchman. It's at this point. And if those guys come to power, it's incredible. I cannot find the words. It would be a catastrophe for the country and not only for the country, for Europe, for Ukraine. We must try to prevent that.",
        "start": 1300.862,
        "end": 1318.114
    },
    {
        "text": " You know, he says the far right doesn't have any real ideas to solve problems. They just want to blame everything on immigration. And he said, fundamentally, it's a racist party that has not changed. Why is the right-wing party in France so close to power for the first time since World War II?",
        "start": 1318.677,
        "end": 1334.411
    },
    {
        "text": " Well, a lot of voters disagree. They say it has changed. This party was founded in 1972, and they used to be a taboo French party, and they say it's not the same party. And you do see a wider, more mainstream electorate now. And Marine Le Pen has broken, she says, with some of the old taboos of her father's generation, like the anti-Semitism. And the party does actually have the support of some in the Jewish community, because they're seen as a bulwark against radical Islam. And Marine Le Pen has been a strong supporter of Israel.",
        "start": 1334.411,
        "end": 1360.794
    },
    {
        "text": " You know, France has also had crises over the last years, economic, social, and Macron has disappointed a lot of people. The national rally has gained strength outside the big connected cities in rural areas. And I went this week to a town about an hour and a half north of Paris, surrounded by wheat fields called Crépy-en-Vellois, where voters heavily supported the hard right party. And I spoke to 62-year-old Bruno Bourdin, who was in a florist shop, and he said the town is changing and not in a good way. Let's listen to him.",
        "start": 1360.794,
        "end": 1388.814
    },
    {
        "text": " You know, he said all the previous politicians have messed things up and it's time to try something new. He said we've never given this party a try. Why not? He told me Macron had been a catastrophe. He cited his raising of the retirement age despite huge protests.",
        "start": 1388.814,
        "end": 1405.52
    },
    {
        "text": " You know, Ayesha, ironically, the populists far left and far right have similar anti-global capitalism platforms. They support the working class, and they were both against this retirement reform. Bourdin actually used to vote socialist. Now he's voting for the national rally. He also cited immigration and crime and security as a big problem, and he said the national rally is tough on these issues.",
        "start": 1405.52,
        "end": 1426.92
    },
    {
        "text": " Other people in the town I talked to who were not voting for the national rally said when things aren't going well, people look for a scapegoat. And the far right saying that too much money is being spent on immigration and foreigners is a winning platform. So what's the latest polling say about the election and when should we get the results?",
        "start": 1426.92,
        "end": 1443.183
    },
    {
        "text": " The polls say that actually the far right will be blocked from getting an absolute majority. So we're probably going to see three competing, mutually detesting parties in a parliament with a weakened president who will no longer have a majority, President Macron. And we will get the results about 8 p.m. tonight, local time. That's 2 p.m. Eastern. That's NPR's Eleanor Beardsley talking to us from Paris. Thanks so much. Thank you, Aisha.",
        "start": 1443.626,
        "end": 1467.79
    },
    {
        "text": " Oakland, California, has had a few tough years, high crime rates, a budget deficit, and 10 police chiefs in as many years. And residents are frustrated. Oakland's mayor and the county's district attorney are facing a recall election this fall. Now, an FBI raid on the mayor's home has given her critics even more reason to want her gone. KQED's Annalise Finney reports.",
        "start": 1468.797,
        "end": 1495.418
    },
    {
        "text": " In late June, more than a dozen FBI agents streamed out of Oakland Mayor Sheng Tao's home. They confirmed they were conducting court-authorized law enforcement activity, but provided no more details. The house was one of at least two locations the FBI said they raided that day. The other was connected to the Duong family, which runs California Waste Solutions, the city's recycling service. In a statement, a spokesperson for the company said the family's homes had also been raided.",
        "start": 1495.776,
        "end": 1525.776
    },
    {
        "text": " Members of the Duong family are currently being investigated by state and local officials for campaign finance violations. Mayor Tao didn't make a public comment for four days after the raid. I can tell you with confidence that this investigation is not about me. I have not been charged with a crime and I am confident that I will not be charged with a crime because I am innocent.",
        "start": 1525.776,
        "end": 1550.213
    },
    {
        "text": " Still, no charges have been filed against Tao or the Duongs, and the FBI has declined to provide any more information. A spokesperson for California Waste Solutions says they don't believe they've committed any illegal activities and were cooperating with law enforcement.",
        "start": 1550.213,
        "end": 1566.63
    },
    {
        "text": " Critics of Tao say the raid validates their push for her recall, which started long before the FBI raid. Their launch was back in February. Recall supporters blame Tao for a laundry list of the city's challenges. Oakland has higher per capita rates of homelessness than both San Francisco and Los Angeles. Crime has been declining so far this year, after a significant uptick last year, according to the Oakland police. But some residents say it's still too high.",
        "start": 1567.056,
        "end": 1597.056
    },
    {
        "text": " Tao says she's focused on improving public safety, but one frustration among her critics is that last summer, city staffers missed a deadline for a huge state grant to curb retail theft. Recall supporter Tuan Ngo spoke outside of the mayor's house after the FBI raid, and a local reporter uploaded a video to social media. Enough is enough. We demand a change.",
        "start": 1597.056,
        "end": 1620.06
    },
    {
        "text": " and we want them to listen to us because nobody should live in Oakland under these horrible circumstances. Tao's defenders don't dispute Oakland has struggles, but they say it's unfair to hold the mayor accountable only a year and a half into her first four-year term. Here's Tao supporter, community organizer Sabir Lockett. Come on now, where's the grace for elected officials to rewrite the wrongs of previous administrations?",
        "start": 1620.06,
        "end": 1647.756
    },
    {
        "text": " Others say issues like homelessness and crime are complex and impacted by national, state, and county policy, the economy, and public health. Dan Linheim, a professor at the University of California, Berkeley, and a former Oakland City manager, says even within Oakland City Hall, Tao's power is limited.",
        "start": 1647.756,
        "end": 1666.869
    },
    {
        "text": " It's really using the bully pulpit and bringing people together that is within her realm of authority. To the extent that that's not happening, then that's where she holds some culpability. Some of Tao's biggest supporters, like the city's unions, have largely declined to comment on the FBI raid. Bay Area political consultant P.J. Johnston says without more information about why the raid happened, the shadow it's cast over Tao may last for weeks or months.",
        "start": 1666.869,
        "end": 1695.247
    },
    {
        "text": " all of which helps the recall advocates and all of which hurts her ability to lead. Oakland residents will vote on the recall in November. For NPR News, I'm Annalise Finney in Oakland.",
        "start": 1695.247,
        "end": 1707.91
    },
    {
        "text": " Have you ever thought about what it would be like to take a break from the whole technology-driven world? Brandon Condritz did. He's a journalism student at Northwestern University, and he spent an entire day unplugged. No scrolling, no swiping or typing. His podcast about this is one of the standouts in our NPR College Podcast Challenge.",
        "start": 1714.224,
        "end": 1735.879
    },
    {
        "text": " Every day, I can't even tell you how many hours I spend responding to emails and texts, building that perfect Spotify queue. So in a world where you have to use technology for everything, I wondered what would happen if I just stopped. So that's exactly what I did. Hi, this is me the night before my grand unplugging. In preparation, I submitted everything I could. Throughout the day, I recorded short voice memo check-ins journaling how things were going. A disclaimer, I did use my phone to record these, but that's all it was used for.",
        "start": 1737.756,
        "end": 1766.903
    },
    {
        "text": " The war between Russia and Ukraine is the most visible in history. When my alarm clock went off, I instinctively reached for my phone on the nightstand next to me. Don't worry, I stopped myself. But it turns out I'm not alone in keeping my phone right next to me throughout the night. We find with young adults, phones are usually within an arm reach. That's Elizabeth Dowdell.",
        "start": 1766.903,
        "end": 1787.824
    },
    {
        "text": " She's a nursing professor at Villanova University, just outside of Philadelphia, where she researches digital behavior in teens and young adults. Her area of expertise, sleep texting. The phone has buzzed, and the instinctual move is to get it. Although I'm not a sleep texter, signs show that my phone could still negatively impact my sleep. If there's a conscious awareness that that buzz has come through...",
        "start": 1787.824,
        "end": 1809.394
    }
]