[
    {
        "text": " Become a member today. Wash every day at one low price. Alton Auto Butler, where every vehicle gets the royal treatment. Partly cloudy skies, a slight chance of showers. After an overnight low in the mid-60s, your Thursday should be partly sunny, with a slight chance of showers and thunderstorms and a high in the mid-80s.",
        "start": 0.009,
        "end": 18.695
    },
    {
        "text": " Thursday night, slight chance of showers, otherwise mostly clear, a low in the upper 60s. On Friday, partly sunny, chance of showers and thunderstorms, a high near 90 degrees. And Saturday, mostly sunny, a slight chance of showers, a high in the low 90s. The forecast is available around the clock at 465-2272. A service of King Air Conditioning and Heating, your local Bryant dealer.",
        "start": 19.189,
        "end": 44.121
    },
    {
        "text": " Heating and cooling account for more than half of your home's energy use. Make sure your system is running properly. With a Clayton check from King Air Conditioning and Heating, call 466-7574 for an appointment.",
        "start": 44.411,
        "end": 56.817
    },
    {
        "text": " The Big Z Community Calendar is a service of AdvantageNews.com, where you can find local news, sports, weather, and podcasts anytime at AdvantageNews.com. An American Red Cross blood drive will be held at Alton Memorial Hospital July 19th from 10 a.m. to 4 p.m. To make an appointment, go to RedCrossBlood.org or use the Red Cross Blood Donor app.",
        "start": 58.302,
        "end": 80.333
    },
    {
        "text": " The Alton Farmers and Artisans Market is held every Saturday from 8 till noon at the corner of Henry Street and Landmarks Boulevard. To become a vendor, go to downtownalton.com to fill out an application. Do you know someone who's gone above and beyond to serve others in the village of Godfrey? Nominate them for the Godfrey Good Neighbor Award. Go to godfreyil.org and fill out a nomination form.",
        "start": 80.333,
        "end": 104.36
    },
    {
        "text": " Share your community calendar item with the world. Nonprofit groups should go to AdvantageNews.com and click the events section to add your event today. The impact of a meal goes well beyond feeding our bodies. Because when people don't have to worry about where their next meal is coming from, they can truly thrive. Like Marta.",
        "start": 104.36,
        "end": 127.056
    },
    {
        "text": " And now we'll hear from our class valedictorian, who with our hard work never ceases to amaze us. Please welcome Marta Moreno. And Alex. Hey Alex, how did the interview go? I did it! I got the job! I can't believe it! I knew it! Let's meet up later to celebrate. And Diego.",
        "start": 127.449,
        "end": 152.176
    },
    {
        "text": " Mom, I got first place at the science fair with my volcano project. That's amazing, sweetie. Congratulations. Because when people are fed, futures are nourished, and everyone deserves to live a full life. Join the movement to end hunger at feedingamerica.org slash act now.",
        "start": 152.619,
        "end": 169.957
    },
    {
        "text": " feedingamerica.org slash act now a public service announcement brought to you by feeding america and the ad council so how are the kids well emily made the honor roll oh good for her yeah we're really proud of her tyler on the other hand though what's going on he's been moody lately just feeling down and not like himself oh we've been there nick was struggling last spring he was so anxious and stressed really",
        "start": 169.957,
        "end": 197.329
    },
    {
        "text": " what helped well he joined the soccer team and ever since he's been a lot happier he has more energy he's less stressed and he's definitely in a better mood at home it's made a huge difference that's awesome yeah i'm glad he's getting out of the house he's getting some exercise and he's off his phone for once it's been good for his mental health sounds like it's been good for your mental health too",
        "start": 197.329,
        "end": 223.575
    },
    {
        "text": " Participating in Illinois high school sports improves students' physical and mental health. Encourage your son or daughter to get involved. This message presented by the IHSA and the Illinois Athletic Directors Association.",
        "start": 223.575,
        "end": 235.35
    },
    {
        "text": " Rich is just a really, really, really good guy. The term good egg isn't enough to describe him. He's also certified organic and free range. Rich puts the cap back on everything. The toothpaste, the olive oil, the shampoo, everything. He lets his 10-year-old nephew beat him at virtual tennis, even though he can straight up slay his 10-year-old nephew in virtual tennis.",
        "start": 237.585,
        "end": 265.418
    },
    {
        "text": " When the toilet paper is running low, Rich replaces the roll on the actual holder, not just on the back of the toilet. Rich is texting and driving. Rich, no. What are you doing, Rich? I was just telling everyone how great you are.",
        "start": 265.418,
        "end": 284.053
    },
    {
        "text": " Texting and driving makes good people look bad. Visit StopTextStopRex.org. A public service announcement brought to you by the National Highway Traffic Safety Administration and the Ad Council.",
        "start": 284.053,
        "end": 297.432
    },
    {
        "text": " Great to have you along for the ride. Thanks a lot for stopping by. Glad to have this young lady on. Her name is Caroline Sunshine, who I think we probably have appeared on a television show or two together, but we've never met. Caroline, how are you? Good to see you.",
        "start": 307.278,
        "end": 317.568
    },
    {
        "text": " I am great, thank you. Like I said, better than Joe Biden outside the hours of 7 and 4 p.m. Great to be on your show. Well, I agree with you that you are better than Joe Biden, and you are great. She's the Deputy Communications Director for Trump 2024, which is awfully exciting. Now, I think that when we were probably on the same air at the same time, you weren't with the Trump campaign yet. How does something like that happen? Do they notice how excellent you are on these hits and how you communicate very well? How does that even come to fruition?",
        "start": 318.029,
        "end": 344.326
    },
    {
        "text": " I'd love to take that much credit. I've been an enthusiastic supporter of President Trump for a long time. I actually had the honor of serving in his White House. I was an intern in his White House press office, then had the honor of serving in his press office. And they always kind of say all roads can lead back to President Trump. And I'm so grateful to be on this team. I just think the stakes couldn't be higher for this country. And I've always thought ever since President Trump came down that escalator in 2015, that he was just a singular force in American politics. And it's truly my honor to get to play some role in",
        "start": 345.35,
        "end": 374.753
    },
    {
        "text": " in this movement that he leads so, so beautifully. I don't want to go to memory lane too much, but were you an intern in 2017? I was, yes. So I think we met at the White House because I was one of five shows that was invited there. And my daughter, Sam, is my executive producer. We went to the White House and interviewed the president about the tax cuts that were coming up. We felt very, very honored. I know that I've seen you somewhere. I'll bet you might have been there when we were there.",
        "start": 375.043,
        "end": 399.172
    },
    {
        "text": " You are taking me back. Oh, my gosh. I have such fond memories of our time in the White House. You know, just everything that President Trump was able to accomplish and the great American patriot. Just such a, what an honor. What an honor. That is so great. You're taking me down memory lane. Well, good. I'm glad that we went there for a second. Now let's talk about the future.",
        "start": 399.633,
        "end": 417.381
    },
    {
        "text": " I think Trump was going to do great anyway. I think he was going to win by a landslide anyway. And then all of a sudden, holy mackerel, not only is Joe Biden gone like you and I and like Donald Trump knew already, now the media and the Democrat Party is forced to face it. Do you shift gears at all in the campaign for Trump, knowing that everybody now knows that Joe Biden is no longer there? Or do you just keep on doing what you were doing?",
        "start": 417.381,
        "end": 442.858
    },
    {
        "text": " Yeah, well, like you said, I mean, President Trump didn't just win that debate. He absolutely dominated it. I mean, it's like watching a UFC fighter take down just three opponents in one. You know, it's like the takedown of a party concealing the truth from the American people.",
        "start": 444.121,
        "end": 459.326
    },
    {
        "text": " That truth saying, you know, Joe's fine. He's sharp as a tack. He's doing cartwheels. Those same people now do not get to wake up and say, let's go, Brandon, if you know what I mean. No, we have known the truth of Joe Biden for the last four years, as has President Trump. We couldn't be prouder to have President Trump as the leader of our party and movement. And we are full steam ahead because long before the debate to end all debates, as I call it, President Trump was already winning.",
        "start": 469.275,
        "end": 495.964
    },
    {
        "text": " and winning big and that's because he's always been on the right side of the issues most important to the american people and the american people have known about yes joe biden's declined for years but they've also come to trust president trump's strength and command and his knowledge of the issues and and you know when you get the debate was just simply another point to highlight that highlight that contrast but we've been winning big long before the debate to end all debates",
        "start": 495.964,
        "end": 520.896
    },
    {
        "text": " Caroline Sunshine, she is the Deputy Communications Director for President Trump, Trump 2024. I guess what I meant by that was, was there a definitive shift from the President when he said, holy crap, you saw what just happened last night. I knocked it out of the park. He's gone. Instead of this, let's do this. Or...",
        "start": 520.947,
        "end": 542.927
    },
    {
        "text": " Is he full steam ahead, as you said, rally after rally after rally, 20, 30, 40,000 people showing up, standing room only. What's working was working. Why change it, I guess. So was there any definitive change after that night? Or no, let's just keep going.",
        "start": 542.927,
        "end": 555.93
    },
    {
        "text": " Absolutely. Let's keep going. Let's keep the Trump train going. You just saw President Trump last night in Miami. I thought that was a particularly excellent rally. President Trump always brings his best, but a lot of his family members were there last night, and I think President Trump is such a family man. That's something that never gets highlighted in the liberal mainstream media, but exactly. President Trump was winning big long before what ended up really being the death of Joe Biden's presidency and candidacy. And by the way, as we've seen, it doesn't matter who the Democrats put up. It doesn't matter if they end up with",
        "start": 557.312,
        "end": 587.244
    },
    {
        "text": " sleeping joe or with somebody more active outside of the hours of ten and four p m nobody that they can put up can beat president trump so at this point i just say to the democrat party save yourself millions of dollars you know do the right thing for the country maybe just sit this presidential election cycle out because it's very clear who people want and that's president donald j trump",
        "start": 587.466,
        "end": 605.111
    },
    {
        "text": " Exactly right. Caroline Sunshine, Trump 2024 deputy communications director. Are you guys trolling us? And let me tell you what I mean. I'm on the air yesterday and all the news comes out. He's going to announce his VP tonight. And I know that Donald Trump didn't say he was going to announce the VP. I know that you didn't say it. I know Liz Harrington didn't say it. I know that others didn't say it. So I know that Caroline Leavitt didn't say it.",
        "start": 605.247,
        "end": 625.657
    },
    {
        "text": " Are you guys leaking that out? Are you trolling us? Because everybody who's watching, when I tuned in during my show, he's talking about a million dollars to play golf against Joe Biden. So how do you think that happens? Is somebody in the media planting that seed? Is there anything to the fact that we might find out who the VP choice is before the convention or no? The liberal mainstream media planting seeds and being responsible? Joe, they would never. I'm shocked. Never.",
        "start": 625.657,
        "end": 654.087
    },
    {
        "text": " Well, since we're just among friends, I would tell you. No, I'm just kidding. Of course, the only person who knows who President Trump is going to pick as his vice president is President Trump. He's also the only one, by the way, who knows when he will announce it. But as you and I both know, he has a talent for making news. He does. Everybody will most certainly know. But you know what? I'll say this about his VP pick. Again, it couldn't be a further point of contrast. We're fielding endless questions and speculation of",
        "start": 654.531,
        "end": 682.534
    },
    {
        "text": " Who is President Trump going to select as his vice president? Just, you know, endless media speculation over it. You can trust that with the Democrat Party, you know, where their questions are, is their VP nominee going to have to replace their nominee? And no matter who President Trump picks, he's certainly not going to select a DEI hire. He's going to select somebody who is going to be an excellent partner in helping him make America great, safe, strong, wealthy again, because he knows how high the stakes are for our country.",
        "start": 682.773,
        "end": 707.961
    },
    {
        "text": " You know, George Clooney called the White House today. I don't know if you heard about this. George Clooney, of course, this leftist actor from Hollywood, I guess he was mad that the Biden administration said something about some organization that his wife is involved in. But allegedly, he's calling for Biden to drop out of the race. Carolyn, are you surprised, as I am, that some of these staunch, boots-dug-into-the-dirt liberals are backing away from this guy? Because, again, they all knew it.",
        "start": 709.206,
        "end": 734.394
    },
    {
        "text": " But now that the debate is out there and people that are soccer moms are working all day or doing whatever, got to pay attention for an hour and a half. They're all jumping ship. Are you surprised by some of the names that are backing their support away from Joe Biden?",
        "start": 736.425,
        "end": 748.183
    },
    {
        "text": " I'm not shocked because these people love power more than they love the country, and they always have. But certainly when you see, I mean, just about everybody jumping ship, everybody from George Stephanopoulos to George Clooney, these people a month ago were some of the most ardent supporters of Joe Biden, right? I mean, I think George Clooney should have to explain that.",
        "start": 749.889,
        "end": 770.265
    },
    {
        "text": " well if you knew back then that Joe Biden was the man in decline that we all saw on the debate stage why did you give him 14 million dollars and by the way the fundraiser that George since we're on the topic of that fundraiser the fundraiser that George Clooney mentioned",
        "start": 770.265,
        "end": 785.265
    },
    {
        "text": " There's another person who was in attendance at that fundraiser who's had a front row seat to Joe Biden's decline and who has been silent. But that's President Barack Obama, who was the one who babysat Joe Biden on that stage. So like I said, they've all known. There's nothing shocking about this. I think the only thing that is shocking is that these people have been willing to let this country go to hell in a handbasket before they have ever lifted a finger to tell the truth. And the only time they've told the truth is when it was about power, not about love of country.",
        "start": 786.015,
        "end": 811.578
    },
    {
        "text": " Yeah, we were supposed to watch that video of Biden frozen and Obama grabbing him by the wrist and taking him out and patting him on the back. Come on, Joe, let's go as he sashays or shuffles off the stage. We were supposed to believe that was a cheap fake. And it was a cheap fake when Biden froze at the Juneteenth celebration amidst all these people dancing and he just was lost.",
        "start": 811.578,
        "end": 829.838
    },
    {
        "text": " I mean, we were supposed to believe none of that was true. You and I made fake videos about it. And then they, for some reason, they put them on a stage for an hour and a half. Was President Trump, were you, was the campaign surprised that Joe Biden said he would debate? I was stunned.",
        "start": 829.838,
        "end": 844.036
    },
    {
        "text": " Well, President Trump said he would debate him anytime, anyplace, anywhere, and he certainly made good on that promise. I guess also, you know, you saw President Trump invite him to, maybe if Joe doesn't want to debate, he'll join him in a round of golf. And I would say this, President Trump very much proved that he'll debate anytime, anyplace, anywhere. He also proved he can win anytime, anyplace, anywhere, and that includes the golf course.",
        "start": 846.493,
        "end": 868.797
    },
    {
        "text": " according to the latest polls caroline you know this is caroline sunshine from the trump campaign according to the latest polls president from leading in every every battleground state everyone rather easily in some and in fact some historically blue states i think new yorkers in play maybe it's my heart speaking may be in being biased but when he was able to because they were done they left in new york city for six weeks he was a little harlem everyday take selfies use of the local you know sandwich shop local pizza place local ice cream shop and really get to know people",
        "start": 868.899,
        "end": 898.268
    },
    {
        "text": " You had people show up when you were allowed 3,500, I think, at the rally in the Bronx or whatever it was, and then they had to turn away 20,000 or something. You would go to New Jersey and get a million or not a million, 100,000 people show up to a rally. He might flip some blue states that we haven't seen go red since Reagan. Is that the feeling inside the campaign that you can do that?",
        "start": 898.268,
        "end": 917.398
    },
    {
        "text": " Absolutely. I mean, you know, you look at, President Trump actually said this really eloquently when he was in Philadelphia. He was asked, he said, you know, sir, why are you coming here? This isn't a place where traditional Republicans go. This was long before the debate to end all debates. And he said, you know what? It's because I've realized there is",
        "start": 919.514,
        "end": 935.367
    },
    {
        "text": " so much love out here and people really need hope. And that's what I'm here to do. And so you've seen President Trump go to the deep blue Bronx. You've seen him go to Detroit. You've seen him go to parts of Philadelphia that traditional Republicans don't go to. Where has Joe Biden been? Has Joe Biden been to any of those places? No, he was having to be babysat on stage at a fundraiser by Barack Obama and sequestered away at Camp David, none of which made a difference, I might add. So everybody who is abandoning Joe Biden is flocking",
        "start": 935.367,
        "end": 961.323
    },
    {
        "text": " to President Trump. And we are seeing states that are in play, blue states that are in play for the first time in decades. And that's really a credit to President Trump and his message. He's on the right side of the issues that are most important to the American people. He was just intricately involved in putting together our party's platform.",
        "start": 961.323,
        "end": 978.626
    },
    {
        "text": " I love that that platform at the top of it says, this platform is dedicated to the forgotten men and women of America. And President Trump has always said, he hasn't said, I'm going to make the Republican Party great again. He has always said, I'm going to make America great again. He's going to be president for all Americans. And when you look at the things that he stands for, like securing our border, stopping the invasion that is occurring at our southern border, helping to protect our women and children from being killed by violent, illegal immigrants, restoring our manufacturing base, restoring our standing on the world stage,",
        "start": 978.626,
        "end": 1008.626
    },
    {
        "text": " respected and feared. Those are things that resonate with all Americans. I also might add, you look at Joe Biden, what he's been able to do to the U.S. economy. My goodness, he makes Jimmy Carter look like a lightweight. Whether you're black, white, or brown in this country, everybody's money's green, and nobody has enough under Joe Biden. So that's why we're seeing all these groups who are traditionally part of Joe Biden's voter base, African Americans, union workers, independents, young people, women, flock to President Trump.",
        "start": 1008.626,
        "end": 1032.773
    },
    {
        "text": " You know what the weirdest thing is about the economic debate, Caroline, is that the left really is looking at the camera and saying something like this. They just don't realize how good they have it. They don't realize the economic improvement they've had. And people in America are going, it doesn't matter what my race is, like you said, or what my orientation is or what my gender is or my ancestry. What matters is I can't pay my bills. What matters is my bank account has been decimated by this president.",
        "start": 1033.114,
        "end": 1056.493
    },
    {
        "text": " Why do you think, and I don't want you to get into the brains of the other side's campaign because that might hurt your head, but why would they ever look at the camera and say, don't believe what you're actually living through, believe what we're saying?",
        "start": 1057.056,
        "end": 1068.029
    },
    {
        "text": " Well, these people are wildly out of touch with the American people. They always have been. These are limousine liberals. I know we all know that Joe Biden is a few French fries short of a happy meal, but these people couldn't tell you the cost of a happy meal. And by the way, a Big Mac today costs $7.49, which is an 87.7% increase from just five years ago. You go to the grocery store, try to buy a bag of barbecue chips, $6.19. You go to fill up your gas tank,",
        "start": 1069.735,
        "end": 1096.186
    },
    {
        "text": " four or five dollars depending on where you are in the united states but these people are so out of touch it's always rules for thee never for me it's the same reason they're so out of touch on any of the issues that are important to the american people like what's going on at the southern border these people live in gated communities they have no idea that every town has become a border town they are so out of touch with the american people and it's why they really don't have not only do they",
        "start": 1096.425,
        "end": 1118.814
    },
    {
        "text": " that appears not to have a candidate viable who can run they don't have a viable platform to run they cannot offer the american people solutions to their problems chiefly because they are so out of touch with what the problems are to begin with these people think that americans want electric vehicle mandates no no americans don't want that they also don't want free flights and free housing for illegal immigrants they want those illegal immigrants that joe biden has welcomed into our country by the millions and who by the way he wants to give him the right to vote right as we just saw in congress",
        "start": 1118.814,
        "end": 1145.998
    },
    {
        "text": " They want mass deportations for illegal immigrants. 62% of Americans want that. So these people have always been out of touch. They have their heads in the sand. They do not live the reality that the American people live. And it's why not only Joe Biden is unfit to serve, it's why the Democrat Party is unfit to serve.",
        "start": 1145.998,
        "end": 1160.401
    },
    {
        "text": " It's Caroline Sunshine, Deputy Communications Director, Trump 2024. I appreciate the time and the access. You brought up immigration a lot, and you should, because that is the most important stateside, the most important issue, period, for Americans. But the left has done a very good job through big academia, big Hollywood, big music, big sports, big television news media. These people, academia, they all have been saying, it's not that, it's abortion.",
        "start": 1160.691,
        "end": 1185.469
    },
    {
        "text": " It's not that it's some other issue that they think they have an upper hand on Trump. As somebody in the campaign, do you have to see what they're doing and react? Or just, as I said earlier, keep on doing what you're doing? You're right. Immigration is the most – it's the existential threat, if you don't mind. They always say that word. But it's the biggest threat to our democracy, to our representative republic. It's the biggest threat to our future. It's the biggest threat to our way of life, Western culture, all of that stuff. It is the most important issue. They've done a really good job, though, Carolina, of trying to change the topic.",
        "start": 1185.469,
        "end": 1215.384
    },
    {
        "text": " Do you have to adjust to that as a campaign or not? Well, I would say if we don't have a border, we don't have a nation. And if they want to talk about being pro-life or pro-choice, I'm happy to talk about being pro-life all day long. You cannot be pro-open border and be pro-life and be pro-women and be pro-children. As we have seen, millions of illegal immigrants come across our southern border. Look at who the victims of most of those violent crimes have been.",
        "start": 1215.384,
        "end": 1239.462
    },
    {
        "text": " they've been very vulnerable women and children. So if we want to talk about empowering women, protecting women, protecting life, we absolutely have to talk about securing our border. And I think that's what women want. Women don't like weak men. They want a strong leader like President Trump. Women understand that weakness invites chaos and danger. And once again, that's why, like you said, immigration is the number one issue for a reason. And it's an issue that has long been overlooked and intentionally ignored",
        "start": 1239.787,
        "end": 1266.596
    },
    {
        "text": " by the Democrat Party, who once again is so out of touch with where millions of Americans are at on a host of issues, not just that one.",
        "start": 1266.732,
        "end": 1273.643
    },
    {
        "text": " Go follow her on social media. It's Caroline Sunshine with the Trump campaign. Last question, sort of tongue-in-cheek. Again, I saw the president yesterday vamping away from the teleprompter, which I love when he does that. And he offered up a million dollars to Joe Biden's favorite charity should Biden beat him in a golf match. I mean, Trump is not playing. He's a real golfer. He's a very good golfer. And Biden, of course, lied about a sex handicap or a nine handicap or something. Trump said he'd give him 20 strokes. I mean, would it freak you out if somebody from the Biden campaign said, yeah, let's do it?",
        "start": 1273.899,
        "end": 1302.295
    },
    {
        "text": " Look at my face, Joe. Does it look like it would pick me up? Come on. Give me a break. President Trump checked Joe Biden in real time on the database. He said, Joe, you have told so many lies tonight, but the biggest one is that you have a six handicap in golf. Give me a break. I mean, if Joe Biden has a six handicap in golf, I'm a Democrat, okay? So give me a break, Joe. Well, then it's guaranteed that he doesn't have a six handicap then. It's Caroline Sunshine, Deputy Communications Director, Trump 2024. Love having you on. Come back again soon, would you?",
        "start": 1305.179,
        "end": 1334.633
    },
    {
        "text": " Thank you so much. Thank you. I will. You're very welcome. We're back after this at the Joe Pag Show. Stay here. This is the Joe Pag Show.",
        "start": 1335.606,
        "end": 1351.561
    },
    {
        "text": " Oh, no. Stomach issues again? Stomach issues? Who are you? Your pancreas. I could be the real reason for your diarrhea, gas, bloating, stomach pain, or loose oily stools. I thought it was my stomach. People often do. But any of these symptoms could mean having a condition called exocrine pancreatic insufficiency, or EPI. With EPI, the pancreas doesn't release enough enzymes to break down food. But EPI is manageable. Use the symptom checker on identifyepi.com and speak with your doctor. That's identifyepi.com. Sponsored by AbbVie.",
        "start": 1359.258,
        "end": 1388.558
    },
    {
        "text": " Hi, I'm Angie Hicks, co-founder of Angie. When you use Angie for your home projects, you know all your jobs will be done well. Roof repair? Done well. Kitchen sink install? Done well. Deck upgrades? Done well. Electrical upgrade? Done well. Angie's been connecting homeowners with skilled pros for nearly 30 years, so we know the difference between done and done well. Hire high-quality, certified pros at Angie.com.",
        "start": 1389.002,
        "end": 1417.79
    },
    {
        "text": " Getting quality employees to fill positions in your company is essential. But finding those people can be a major hassle. Unless you use ZipRecruiter. ZipRecruiter makes finding quality people a breeze. And right now you can try it for free at ZipRecruiter.com slash free. With ZipRecruiter, one click sends your job to hundreds of top job sites. But more than that, ZipRecruiter's advanced technology identifies the candidates with the skills you need.",
        "start": 1419.309,
        "end": 1444.224
    },
    {
        "text": " sends you a list of great matches to review, then actively invites them to apply for your job. And the results speak for themselves. Four out of five employers who post on ZipRecruiter get a quality candidate within the first day. That's right, the first day. Now you can focus on your business and let ZipRecruiter do the work finding the best people for you. See for yourself.",
        "start": 1444.224,
        "end": 1465.998
    },
    {
        "text": " Experience the ease, efficiency, and power of ZipRecruiter for free. Just go to ZipRecruiter.com slash free. That's ZipRecruiter.com slash free. ZipRecruiter.com slash free.",
        "start": 1465.998,
        "end": 1478.746
    },
    {
        "text": " Through the years, you've really kept up with the times. You're on social media. Like, like, dislike, block. Maintained your health. 10,000 steps. I'm a beast. You even programmed your own smart home. In 10 minutes, remind me that I'm a genius. In 10 minutes, I'll remind you that you're a genius. If you can do all that, you can definitely save for retirement.",
        "start": 1480.265,
        "end": 1500.981
    },
    {
        "text": " Just go to aceyourretirement.org, a free online tool sponsored by AARP that can help you get on track with your retirement savings no matter your age. At aceyourretirement.org, you'll meet Avo, the friendly digital retirement coach. And in just three minutes, get personalized recommendations to help boost your retirement savings. They're easy to understand and work with your lifestyle. It's quick, easy, and free. Plus, it's brought to you by AARP, so you know they got your back.",
        "start": 1500.981,
        "end": 1528.712
    },
    {
        "text": " You are a genius. Take charge of your retirement. Go to aceyourretirement.org now. That's aceyourretirement.org. A message from AARP and the Ad Council. One smile is great, but one smile in a community of smiles is so much better.",
        "start": 1528.712,
        "end": 1547.295
    },
    {
        "text": " A smile has a secret power that most people don't know about. A smile multiplies. It spreads from one person to the next, stretching across entire groups of people. Smile Train knows this and is proud to be creating a wave of smiles across the cleft lip and palate community in over 70 countries.",
        "start": 1548.592,
        "end": 1572.619
    },
    {
        "text": " patients, doctors, advocates, fundraisers. Collectively, our smiles are a celebration of the transformed lives of over 1.5 million children. Learn how Smile Train is helping the cleft lip and palate community at smiletrain.org slash learn. Smile Train, changing the world one smile at a time.",
        "start": 1572.619,
        "end": 1598.66
    },
    {
        "text": " We appreciate Caroline Sunshine coming on from the Trump campaign. I did not realize this. I guess she used to be an actress on Disney or something. My daughter Gabby used to watch. Sam, you were mentioning she used to be on a show. I looked it up, or you sent me a link, and she was on with Zendaya. So I guess she was kind of a big deal. I don't know. I guess so. Did you ever watch it?",
        "start": 1607.363,
        "end": 1627.5
    },
    {
        "text": " I'm a little older than that, but I believe that Gabby probably really enjoyed it. Well, she did. I mean, I texted Gabby during it. She said, oh, yeah, of course I know her. So very nice to talk to her. Very nice to meet Caroline. We'll have her back on again, certainly. Tomorrow, a big show coming your way. Carrie Lake, Rick Grinnell. We've got Matt Gaetz on tomorrow.",
        "start": 1628.404,
        "end": 1644.514
    },
    {
        "text": " There's a lot going on heading into the RNC. I'm not going to go to the RNC, but we're going to have our friend and reporter, Brianna Morello, will be there. She'll be doing reports from there. But we're leading up to that. We're going to have all the big players. Do not miss a second of the Joe Pag Show. That's Sam. That's Polo. That's Carrie. I'm Joe. We'll see you tomorrow. Have a good night. This is the Joe Pag Show.",
        "start": 1644.514,
        "end": 1665.572
    },
    {
        "text": " Do you hear that? Asthma triggers are everywhere, from dust mites, pet dander, and pollen, to smog and smoke. An asthma attack can strike anywhere, anytime. Be prepared with quick-acting primatine mist. Clinically proven to open airways quickly. It's the number one FDA-approved asthma inhaler available over the counter. Primatine mist. Breathe easy again. Use as directed.",
        "start": 1669.787,
        "end": 1697.329
    },
    {
        "text": " Hi, I'm Angie Hicks, co-founder of Angie. And one thing I've learned is that you buy a house, but you make it a home. Because with every fix, update, and renovation, it becomes a little more your own. So you need all your jobs done well.",
        "start": 1697.705,
        "end": 1711.323
    },
    {
        "text": " Listen to all that cash I save shopping at my local Big Deal store. I know what you're thinking. Jenny, tell me more. Well, this is a secret I love sharing. Shop your local Big Deal store from your phone, computer, or tablet for gift certificates at discounted prices. Automotive, pets, retail, groceries, entertainment, outdoor, restaurants, services, travel, health, beauty. It's all there. Shop, and soon you'll be saving, too. Save money with your favorite businesses right now at AltonDailyBargains.com.",
        "start": 1712.602,
        "end": 1741.152
    },
    {
        "text": " Greetings, I'm Jerry McCaskey, the pastor at Evangelical United Church of Christ in Godfrey. You are welcome to join us for our service of worship each week here on the Big Z at 10 a.m. It is our hope that this service will be a source of spiritual support for you and for your loved ones. You are invited to participate on the radio or join us in person for worship or any of our programs. And I personally wish you a blessed week.",
        "start": 1741.783,
        "end": 1771.34
    },
    {
        "text": " A trusted source of information for The Riverbend, 1071 The Big Z, MyMix94.3, and AdvantageNews.com, a Big Z media company. It's the top of the hour and time for the news on WBGZ Alton, where you'll always hear the local news first. Now, from the Hainer Public Library District Newsroom, here's Doug Jenkins.",
        "start": 1771.783,
        "end": 1797.568
    },
    {
        "text": " Our forecast is showing a warm-up back to what should be considered normal for this time of year as we head into the weekend. A couple of stray showers and thunderstorms not out of the question. Weather details are on the way. First, your local news. The service of OSF St. Anthony's Health Center serving the area.",
        "start": 1799.121,
        "end": 1816.084
    }
]