[
    {
        "text": " Trump, those stories when America This Week returns after these messages.",
        "start": 0.009,
        "end": 4.531
    },
    {
        "text": " On the battlefield, there's a saying America's military men and women live by. Never leave a fallen warrior behind. Ever. Off the battlefield, Wounded Warrior Project operates with the same goal. Wounded Warrior Project was created to help our men and women returning home with the scars of war, whether those scars are physical or mental. Wounded Warrior Project. We never leave a fallen warrior behind. Ever. Learn more about what we do at WoundedWarriorProject.org.",
        "start": 11.374,
        "end": 40.384
    },
    {
        "text": " One in four Americans have a disability. I'm one of them. I'm also a working mom who cares deeply about making sure every child with a disability thrives by getting their access needs met. We've got a trusted ally by our side. Easterseals provides children and families the foundation for lifelong success through early learning programs, skills training, and prep for college and career. That's my Easterseals. Make it yours. Join us at Easterseals.com.",
        "start": 40.759,
        "end": 69.497
    },
    {
        "text": " Much for term life insurance? A man age 50 non-tobacco user can obtain $500,000 of coverage for as little as $110 per month. Level rate for 20 years. That's right, guaranteed level rate for 20 years. If you're a smoker, there are great rates available for you as well. Call Term Busters for a quote. 1-800-908-7636. You're probably paying more than you should. Call 1-800-908-7636. Remember, call Term Busters. 1-800-908-7636. Sample rate for preferred non-tobacco rate class exam required to qualify.",
        "start": 70.828,
        "end": 99.462
    },
    {
        "text": " Are you drowning in IRS tax debt? Civic Tax Relief can help protect you from the IRS. Call Civic Tax Relief for free information now. Find out about the Fresh Start program that is now available through Civic Tax Relief. Civic Tax Relief's special tax hotline can help you discover all the relief programs available for free. Just call 800-841-0908. 800-841-0908. 800-841-0908.",
        "start": 100.179,
        "end": 129.599
    },
    {
        "text": " Welcome back to America This Week. I'm John Trout. President Joe Biden was campaigning in Las Vegas when he learned he tested positive for COVID and immediately cut short his trip. Lisa Dwyer reports on the president's condition.",
        "start": 129.804,
        "end": 145.299
    },
    {
        "text": " The White House says that President Joe Biden is experiencing mild symptoms and will self-isolate at home in Delaware. In a written statement, the White House says that Biden will continue to carry out all of his duties fully during that time. The news was first shared by UNIDO's U.S. President and CEO Janet Murgia, who told guests at the group's convention in Las Vegas where Biden was scheduled to speak. Regrettably, I was just on the phone with President Biden.",
        "start": 145.299,
        "end": 174.991
    },
    {
        "text": " And he shared his deep disappointment at not being able to join us this afternoon. The president has been at many events, as we all know, and he just tested positive for COVID. So, of course, we understand that he needs to take the precautions that have been recommended and",
        "start": 175.64,
        "end": 205.282
    },
    {
        "text": " He did not obviously want to put anybody at risk. The president's physician, Dr. Kevin O'Connor, says in a note that Biden presented with upper respiratory symptoms to include a runny nose, a nonproductive cough, with general malaise. After testing positive, Biden was prescribed the antiviral drug Paxlovid and has taken his first dose. I'm Lisa Dwyer.",
        "start": 205.845,
        "end": 228.848
    },
    {
        "text": " As President Joe Biden recovers from COVID at his Delaware home, there's a renewed push from members of his own party to get the president to forego his reelection bid with a growing list that now includes Montana Senator John Tester, California Congressman Adam Schiff, and much of the House and Senate Democrat leadership.",
        "start": 229.309,
        "end": 250.538
    },
    {
        "text": " Washington correspondent Sagar Magani reports the expectation by fellow Democrats that Joe Biden will leave the presidential race seems to be growing by the hour. I had a terrible night on the debate night. I was, I had been exhausted. I had been traveling around the world. I wasn't ready.",
        "start": 250.538,
        "end": 271.22
    },
    {
        "text": " And I performed terribly. Democrats are making a renewed push for President Biden to reconsider his reelection bid. People are now saying, well, that was only one thing. But he's 81 years old. What happened to 84 years old?",
        "start": 271.544,
        "end": 286.51
    },
    {
        "text": " What happened to him when he was 85 years old? The warnings are now coming from top allies like former House Speaker Nancy Pelosi, who AP sources say told the president his candidacy could stop Democrats from winning the House, and former President Obama, whom sources say has privately expressed his concerns to Democrats about his ex-vice president's run. More and more, the center of gravity in the party is Trump.",
        "start": 287.5,
        "end": 314.343
    },
    {
        "text": " around this notion that we do need someone else to run for president. And most likely it would be the vice president, Kamala Harris. Democratic strategist Nathan Daschle says the party simply cannot unite if the president stays in the race. And the longer he waits to pull out, the more political damage he'll do. I think there would be genuine excitement and motivation on behalf of the vice president. You know, politics is...",
        "start": 314.343,
        "end": 342.551
    },
    {
        "text": " As much about momentum as it is about poll numbers. And the Democrats have been in such a dark, deep hole for a while that just getting back to normal, you'll feel like we're flying. The president, though, insists it's not too late to recover politically, telling Univision many people don't even focus on the election until September. Everything so far between Trump and me has been basically even. And argues he remains the best choice to beat Trump again. Sagar Magani, Washington.",
        "start": 342.688,
        "end": 372.688
    },
    {
        "text": " Days after he dodged a bullet during a campaign rally in Pennsylvania, former President Trump is catching a break in the federal classified documents case against him. Correspondent Clayton Neville reports.",
        "start": 372.688,
        "end": 385.094
    },
    {
        "text": " Federal Judge Eileen Cannon dismissing the case against former President Trump. He was facing federal charges for allegedly having classified documents at his Mar-a-Lago residence. Charges were brought by DOJ Special Counsel Jack Smith. Charges Trump denied. Adherence to the rule of law is a bedrock principle of the Department of Justice. And our nation's commitment to the rule of law sets an example for the world.",
        "start": 385.418,
        "end": 411.084
    },
    {
        "text": " We have one set of laws in this country and they apply to everyone. But this week, Judge Cannon issued a 93-page opinion dismissing the case on the grounds that the appointment of Jack Smith was unconstitutional. She specifically said that Congress wasn't involved in the appointment, making it unlawful. Congressman James Comer spoke with Fox News about the case being dismissed.",
        "start": 412.312,
        "end": 433.643
    },
    {
        "text": " All these cases that I considered legal warfare against Donald Trump are falling to the side and the American people can focus now on electing the next leader of the free world. The ruling the latest legal victory for Trump. The Supreme Court recently ruled in his favor in the presidential immunity case. Those rulings, though, after his conviction in the criminal hush money trial against him and before an attempted assassination on his life during a weekend rally. I'm Clayton Neville.",
        "start": 433.643,
        "end": 463.541
    },
    {
        "text": " The armorer for the movie Rust is asking for a new trial on her involuntary manslaughter conviction in light of the fact that actor Alec Baldwin's case on a similar charge was dismissed. Correspondent Margie Zaraleta reports. In this case, this unique case on a movie set, the prop gun was placed in Mr. Baldwin's hands and cold gun was announced, meaning it had been checked and double checked by those responsible to ensure the gun was safe.",
        "start": 463.899,
        "end": 492.159
    },
    {
        "text": " Lawyers for weapons supervisor Hannah Gutierrez-Reed have asked Judge Mary Marlowe Summer to dismiss her conviction or give her a new trial after she was convicted in March of involuntary manslaughter in the death of cinematographer Helena Hutchins. Summer dismissed Alec Baldwin's case on the same charge after she ruled that prosecutors failed to share evidence with Baldwin's defense.",
        "start": 492.159,
        "end": 513.302
    },
    {
        "text": " Gutierrez-Reed's lawyers say the evidence could have been important to her case as well. Carrie Morrissey, the lead prosecutor on both cases, says her written response will be filed in court next week and she declined further comment. I'm Archie Zaraleta. Remembering a comedic icon and trying to forget an anthem when America This Week returns after these messages.",
        "start": 513.302,
        "end": 536.715
    },
    {
        "text": " Are you the parent of a 2-7 year old? Listen closely for an exciting free radio offer. By now you've probably heard of ABC Mouse, the Parents' Choice Award winning online learning program that's actually changing the lives of early learners everywhere. ABC Mouse is like a little one-on-one teacher. It has helped her so much. Right now we're offering a special radio promo to try it free for a month. But you have to go to abcmouse.com slash radio to claim your free month. That's abcmouse.com slash radio. Sponsored by Age of Learning.",
        "start": 546.271,
        "end": 575.759
    },
    {
        "text": " For nearly 2,000 severely injured veterans, everyday life has become filled with barriers. So we build specially adapted homes at Homes for Our Troops. And thanks to our donors and supporters, this life-changing gift of freedom is provided mortgage-free to these veterans. But we need you to join us, too, in completing this important mission. Please visit HFOTUSA.org and help build homes and rebuild lives.",
        "start": 576.22,
        "end": 604.889
    },
    {
        "text": " and businesses with tax problems. Listen carefully. If you owe over $10,000 in back taxes or have unfiled tax returns, U.S. Tax Shield can help you take back control. The IRS can seize your bank accounts, garnish your paycheck, close your business, and file criminal charges. Our team of tax attorneys can stop collections and get you protected. U.S. Tax Shield offers a price protection guaranteed quote to get you protected today. U.S. Tax Shield is A-plus rated with the BBB, so call 800-466-9625. U.S. Tax Shield, 800-466-9625.",
        "start": 605.998,
        "end": 635.026
    },
    {
        "text": " Do you have over $10,000 in credit card debt? If you're feeling the financial impact with unprecedented economic challenges, DebtBlue is here for you. With DebtBlue's success guarantee, you pay nothing unless your debt is reduced or completely resolved. I'm just living sky high right now. I'm very thankful for it, and the team at DebtBlue are phenomenal. They're able to work with you. They're great. Call for your free debt resolution information now. 800-200-6895. 800-200-6895.",
        "start": 635.026,
        "end": 664.565
    },
    {
        "text": " Welcome back to America This Week. I'm John Trout. He became famous for his deadpan comedy and telephone monologues. Correspondent Haya Panjwani reports comedic icon Bob Newhart has died at the age of 94.",
        "start": 665.077,
        "end": 680.06
    },
    {
        "text": " Jerry Digney, Newhart's publicist, says the actor died in Los Angeles after a series of short illnesses. The accountant-turned-comedian gained fame with the Smash album and became one of the most popular TV stars of his time. Newhart was a Chicago psychologist in the Bob Newhart Show in the 70s. The boatload of turkeys you sent us over here last November, they're still here, Walt. Yeah, they're walking all over London. See, that isn't a holiday over here, Walt.",
        "start": 680.196,
        "end": 708.029
    },
    {
        "text": " Just in America. You got another winner for us, Sewell, have you? Tobacco. And a Vermont innkeeper on Newhart in the 80s.",
        "start": 708.763,
        "end": 720.299
    },
    {
        "text": " Both shows featured a low-key Newhart surrounded by eccentric characters. The second show had a twist ending in its final episode. You won't believe the dream I just had. What is it? I was an innkeeper in this crazy little town in Vermont. The whole series was revealed to have been a dream by the psychologist he played in the other show. Newhart continued appearing on television occasionally after his fourth sitcom ended. I'm Haya Panjwani.",
        "start": 724.974,
        "end": 752.688
    },
    {
        "text": " After attempting what many of us call singing a version of the national anthem, Ingrid Andrus is coming clean. Kevin Carr reports the country music singer is canceling some upcoming shows and heading to rehab. Country singer Ingrid Andrus is apologizing and offering an explanation for striking a sour note, or rather quite a few of them. At Major League Baseball's Home Run Derby in Arlington, Texas on Monday, Andrus performed a disastrous version of the national anthem. Ah!",
        "start": 752.807,
        "end": 782.432
    },
    {
        "text": " it's red glare the bombs bursting in air gave proof through the night that our flag was still there",
        "start": 783.609,
        "end": 800.913
    },
    {
        "text": " The televised clip quickly went viral on social media with many fans and viewers criticizing the rough rendition, calling it disrespectful and cringeworthy. Some commentators even compared it to Roseanne Barr's infamous performance of the Star Spangled Banner at a San Diego Padres game in 1990.",
        "start": 802.892,
        "end": 819.48
    },
    {
        "text": " On Tuesday, Anders posted an explanation on X saying, quote, I'm not going to BS, y'all. I was drunk last night. I'm checking myself into a facility today to get the help I need. That was not me last night. She went on to apologize to Major League Baseball, the fans, and the country itself. Her appearance was meant to help promote her new song, Colorado 9, which comes out on July 24th. Now her upcoming shows in both Nashville and Denver have been canceled. I'm Kevin Carr.",
        "start": 823.609,
        "end": 851.937
    },
    {
        "text": " America This Week is produced by Jeff McKay, senior producer Kevin Delaney. I'm John Trout on the Westwood One Radio Network.",
        "start": 853.114,
        "end": 861.578
    },
    {
        "text": " News Radio 930. WFMD, Frederick. A connoisseur media radio station. 9 o'clock. Another rally. I'm Paul Stevens. Fox News. Expect very tight security in Michigan today as former President Trump attends his first rally since surviving an assassination attempt last week.",
        "start": 875.657,
        "end": 894.633
    },
    {
        "text": " We'll be right back.",
        "start": 894.633,
        "end": 924.053
    },
    {
        "text": " with an unwavering commitment to safety. Jeff Manasso, Fox News. Meantime, a hearing by House lawmakers next week on that attempted assassination last week of former President Trump. Lawmakers thought Kimberly Cheadle might give them the slip on Monday, but not now. The hearing before the House Oversight Committee on the attempted assassination of former President Trump could be the most watched hearing on Capitol Hill in years. Lawmakers have questions.",
        "start": 924.053,
        "end": 950.708
    },
    {
        "text": " Now, Cheadle did not do herself any favors in Milwaukee. She alluded four GOP senators who had pointed questions about the shooting. Lawmakers are mystified at the number of security failures which led to the incident. GOP Missouri Senator Josh Hawley says his office is hearing from whistleblowers about the attempted assassination. Hawley wrote to the Department of Homeland Security, citing examples of people gaining access to places at the rally where they were not supposed to go.",
        "start": 950.708,
        "end": 979.36
    },
    {
        "text": " Fox's chat program on Capitol Hill. Federal officials expect transportation systems to be largely back to normal later on today. This after a big IT outage for users of Windows all over the world. Cyber security company Crownstrike pointing to a defect in an update it pushed to clients. America's listening to Fox News.",
        "start": 979.36,
        "end": 998.712
    },
    {
        "text": " I'm Dana Perino, co-host of The Five and co-anchor of America's Newsroom. Join me for my brand new podcast, Perino on Politics. Listeners of Everything Will Be OK will gravitate toward this podcast, too. Every Monday, I'm going to talk to people I trust in politics as they tell me what they're seeing and thinking in the 2024 election cycle. As they prep me to cover the upcoming election, they'll prep you, the voters, too. Make sure you subscribe to this series on FoxNewsPodcast.com or wherever you download podcasts and leave a rating and review.",
        "start": 1003.148,
        "end": 1032.415
    },
    {
        "text": " Well, they say there are certain things that shouldn't be brought up at the kitchen table, but not here at the Duffy's. So pull up a chair and join me, Rachel Campos Duffy. And me, former U.S. Congressman Sean Duffy, as we share our perspective on the discussions happening at kitchen tables across America. And we're going to share some real-life solutions as well to the everyday issues that you all talk about. And we're going to talk about some of those things that we agree on. And some that we don't. Download from the kitchen table. The Duffy's at foxnewspodcast.com or wherever you download podcasts.",
        "start": 1032.415,
        "end": 1062.039
    },
    {
        "text": " There are more Democrats calling for President Biden to quit the current presidential race, but he is still not budging. President Biden is said to feel personally hurt and betrayed as Democrats try to push him out of the race. Vanity Fair with the headline, Joe Biden, allies are furious. They are Julius Caesar-ing this man.",
        "start": 1064.053,
        "end": 1082.363
    },
    {
        "text": " A source close to Biden telling NBC, quote, in 2015, Obama, Pelosi, Schumer pushed Biden aside in favor of Hillary. They were wrong then and they're wrong now. The president maintains his decision is final, saying, I look forward to getting back on the campaign trail next week. But sources tell Fox Democratic leaders are coalescing around plans for a mini primary to replace Biden should he change his mind. And that's Fox's Jackie Heinrich at the White House, a longtime Democratic congresswoman who was an outspoken advocate for black Americans for decades.",
        "start": 1082.363,
        "end": 1112.363
    },
    {
        "text": " has died. Sheila Jackson Lee served Texas's 18th congressional district for nearly three decades and many will remember Jackson Lee for her focus on a progressive agenda including social justice, racial issues, LGBTQ rights and immigration.",
        "start": 1112.363,
        "end": 1127.654
    },
    {
        "text": " The Democrat announcing her pancreatic cancer diagnosis in early June. Her family saying in a statement she'll be dearly missed, but her legacy will continue to inspire all who believe in freedom, justice and democracy. Jackson Lee was 74.",
        "start": 1127.773,
        "end": 1142.824
    },
    {
        "text": " Former New York GOP Congressman George Santos losing a bid to get rid of part of the criminal case against him. A judge on Friday turning down a request from Santos to dismiss charges of aggravated identity theft and theft of public money. Prosecutors accusing Santos on a range of crimes, including lying to Congress about his wealth, collecting unemployment benefits while he was actually working...",
        "start": 1142.824,
        "end": 1167.022
    },
    {
        "text": " And using campaign money to pay for such personal expenses as designer clothing, he pleaded not guilty to a revised indictment in October. I'm Paul Stevens, and this is Fox News.",
        "start": 1167.022,
        "end": 1179.889
    },
    {
        "text": " This is WFMD News. Public comment is being encouraged by Frederick County officials on the proposed Maryland-Piedmont reliability project. The proposed high-voltage transmission line will span Baltimore, Carroll, and Frederick counties. A news release says feedback from county residents is critical at every stage of the process. Public hearings will be held in the areas where the project could be constructed.",
        "start": 1184.548,
        "end": 1208.66
    },
    {
        "text": " The Maryland Public Service Commission has created a dedicated email account to handle comments from residents. An informational website and survey has also been launched by the developer of the project, Public Service Enterprise Group. For more information on accessing the email account, website, and survey, you can go to WFMD.com. And again, for more information on these and other stories you hear on WFMD, you can go to our website, WFMD.com. I'm Kevin McManus, WFMD News.",
        "start": 1208.66,
        "end": 1238.66
    },
    {
        "text": " The 930 WFND sky scan forecast for Frederick and surrounding counties. As we head into the day, we'll have a 40% chance of showers and thunderstorms after 2 p.m., otherwise mostly cloudy with a high near 85 and light south wind. Saturday night, we'll have a 30% chance of showers and thunderstorms before 8 p.m., otherwise mostly cloudy with a low around 68 and light south wind.",
        "start": 1238.66,
        "end": 1261.647
    },
    {
        "text": " Sunday, mostly sunny with a high near 92. PJ's Roofing, when it comes to your roof, they've got you covered. Visit PJsRoofing.com. I'm Dan Sutton. The following program does not necessarily reflect the views of the staff or management of WFMD. Now, the Jen Charlton Show on 930 WFMD and WFMD.com. Telling it like it is with your host, Jen Charlton.",
        "start": 1261.647,
        "end": 1288.848
    },
    {
        "text": " America had strength. Strength respected by our allies, feared by our adversaries. Strength that kept Russia out of Ukraine. The Middle East at peace. Iran's nuclear efforts stalled.",
        "start": 1292.176,
        "end": 1320.589
    },
    {
        "text": " Our borders safe and secure. Terrorists ISIS destroyed. And American soldiers out of war. Because that's what a strong leader does. And our soldiers always knew this commander-in-chief had their backs. He was there with them on graduation day.",
        "start": 1320.589,
        "end": 1341.92
    },
    {
        "text": " Visited with them here and around the world. Gave them their largest pay raise in a decade. And he never forgot them after they served. And made sure every vet finally got the health care they deserved. President Trump, he's making America safe and strong again.",
        "start": 1341.92,
        "end": 1361.834
    },
    {
        "text": " Good morning, everyone, and welcome. It's great to have you here, and it has been an epic week. I mean, really, truly. When you look at all that we've endured, it's been quite a ride. I mean, last Saturday, when we did this show, we had no idea what was coming at us, which was an assassination attempt on President Trump's life. And, you know, life can change in a moment, right?",
        "start": 1364.104,
        "end": 1393.763
    },
    {
        "text": " And it changed. Thank you, Jesus, he didn't lose his life that day. I think we all agree that divine providence stepped in. But it can change in a moment, and it did. I think that was pivotal when he survived that.",
        "start": 1394.889,
        "end": 1415.401
    },
    {
        "text": " i'm sure your life has changed forever when somebody tries to take your life in that moment you're not the same person from then on that you were before and you know i haven't always been glued to the television on these conventions um but i think this year is different for me at least i think for so many americans that are really worried about our country and",
        "start": 1415.401,
        "end": 1439.872
    },
    {
        "text": " Pretty certain that if President Trump doesn't get back in, we're cooked. I mean, this is this great experiment called the United States of America will be in a very, very, very bad place for a long, long time and probably won't ever be the same. We can't pull it back. But this is our last vestige of hope.",
        "start": 1439.872,
        "end": 1462.739
    },
    {
        "text": " And it really is going to be up to you and me and we the people to save our nation because he's one man and he has lots of really smart people around him working with him to save us. But at this point, we know that.",
        "start": 1462.739,
        "end": 1478.2
    },
    {
        "text": " We can't endure much more of, oh, Biden et al. And, you know, I was thinking about this yesterday and the last couple of days and reflecting with people. And I said, you know, back in the summer of 2020, we knew that if he didn't win, it was going to be bad. I mean, we all knew. We knew that if President Trump lost that election, we were in for a world of hurt. We had no idea how bad it was.",
        "start": 1479.121,
        "end": 1508.37
    },
    {
        "text": " It could get, but here we are living it right now. And it's so frustrating to hear the lies and the manipulation and the deceit spewed by the left. And unfortunately, there are a lot of people who still believe all that. They actually are bought into what they've been told, like an okey-doke.",
        "start": 1509.718,
        "end": 1531.101
    },
    {
        "text": " You know, Biden has a great economy. Okie doke. You know, no, he doesn't. And we're feeling it every day. So whatever his words are, are not a match for reality.",
        "start": 1532.5,
        "end": 1543.063
    },
    {
        "text": " So I thought, you know, as we've all been kind of commiserating over the last few years, and certainly this week reflecting on what happened on Saturday and how tragic that was, and our thoughts and prayers go out to the families, including Campatori family, who lost their dear loved one and who are living a very different reality now because he went to a rally. He stood up and stood by.",
        "start": 1544.565,
        "end": 1572.449
    },
    {
        "text": " President Trump and what he believes in. And he lost his life for that.",
        "start": 1573.148,
        "end": 1578.046
    },
    {
        "text": " It's so heartbreaking. And I'm really at the point where I have zero tolerance anymore for people calling me names because I'm MAGA. And I've had that happen. Thinking that I'm a bad person because I believe in America first and the principles and the philosophy and the mandates of Make America Great Again.",
        "start": 1579.36,
        "end": 1606.323
    },
    {
        "text": " You know, it was funny, Kellyanne Conway said last night, get your flags out.",
        "start": 1606.834,
        "end": 1613.865
    },
    {
        "text": " Be proud. Say MAGA. Be MAGA. You know, state it on your on your vehicles and whatever and be loud and proud about it because we can't hide anymore about it. We've been so afraid. I've been afraid somebody key my car. I'm afraid about my car. So, you know, I didn't want to wear a MAGA sticker and have somebody key my car. I mean, that's insane.",
        "start": 1614.343,
        "end": 1638.319
    },
    {
        "text": " But, okay, maybe they'll key the car. Okay, it's an old one now. I'm willing to have it be keyed for the greater good. But, anyway, I have a very exciting show today, but I really felt it was important for us to really reflect back on this journey since before 2020 to now. And the one thing I will say, and I'm going to ask my guests, and we'll leave it a secret until you come back from the break, but I'm going to ask my guests, you know, do we think we can have a free and fair election today?",
        "start": 1640.811,
        "end": 1670.708
    },
    {
        "text": " Because none of this matters. All the cheering and the camaraderie and the love of country and prayer, all of that won't matter if we lose because they cheat again. We're going to take a quick break. We'll be right back.",
        "start": 1670.708,
        "end": 1688.66
    },
    {
        "text": " When was the last time you had freshly made ice cream or candy? Sweeties on the Creek offers a wide selection of fresh, creamy ice cream made with natural flavors. Stop in for a new fun flavor or a classic yummy favorite perched on a freshly made waffle cone. Just in, Sweeties has a huge assortment of candy, including freshly made, in-store delicious chocolates. Your young ones will love all the plush toys and fun gifts, too. Sweeties on the Creek, just up for Market Street. We're scooping now.",
        "start": 1689.394,
        "end": 1715.998
    },
    {
        "text": " Past editions of this program are available in the audio vault at WFMD.com. Because there ain't no doubt I love this land. God bless the USA. USA.",
        "start": 1717.927,
        "end": 1733.865
    },
    {
        "text": " Welcome back. This is Janet. I have with me today several guests and one you know well, Liz Harrington. I reached out to Liz after this happened on Saturday and said, would you be available possibly? And, you know, just help us navigate through this because I think we're in a very important time.",
        "start": 1734.906,
        "end": 1754.326
    },
    {
        "text": " and so i appreciate you being back good morning liz it's great to have you back hey jen great to be with you again yeah it's great and uh we're gonna have a caller this is somebody i i admire and it's just a super guy and he's gonna call in small business owner in a few minutes and make a comment",
        "start": 1754.326,
        "end": 1769.684
    },
    {
        "text": " So when we have a moment, we'll have him share his thoughts as somebody who's living the realities of the Biden economics and policies. So I wanted to start, Liz, with what it was like for you the moment you heard.",
        "start": 1769.684,
        "end": 1786.852
    },
    {
        "text": " that President Trump, who you've worked for directly, you've been his right hand on a lot of things in terms of communications and so forth. And the moment you heard or saw that he had been shot, what was your reaction? Not really pretty. I was really upset. Yeah, it was really, really...",
        "start": 1788.353,
        "end": 1811.067
    }
]