[
    {
        "text": " More on these stories at townhall.com.",
        "start": 0.009,
        "end": 3.746
    },
    {
        "text": " What does it take for organizations to triumph? It takes the trust of people like you. And that's why an estimated 14 million givers look for the ECFA seal. Over 2,700 leading ministries across the U.S. display ECFA's seal, demonstrating that they live up to biblical standards of financial accountability, responsible governance, and trust. So next time you donate, look for the ECFA seal, a widely recognized symbol of trust. Visit ecfa.org slash trust to learn more.",
        "start": 4.684,
        "end": 34.087
    },
    {
        "text": " Progressive knows when you own a boat, life on land is a tough sell. Come on down to land. It's the place where you get to do so much waiting. You can wait in traffic, drive-thrus. You can even wait at the doctor's in a room specifically made for waiting. It's land, baby. Come and sit patiently for a while, then wait even longer. It's land.",
        "start": 34.087,
        "end": 52.927
    },
    {
        "text": " Life on a boat is way more relaxing, and it's even more relaxing when you protect your boat with Progressive, America's number one boat insurer. Progressive Casualty Insurance Company and Affiliates, number one rating based on 2022 boat market share data from ratefilings.com. 803-TALK-RADIO-680-WCBM. The Morning Drive with Casey and Elliot in traffic and weather on the three zone. Morning, Chuck Whitaker.",
        "start": 53.148,
        "end": 71.578
    },
    {
        "text": " All right, if you haven't made the move yet towards 895 northbound, forget about it. If you're coming up from Howard County or coming on in Glen Burnie, you're trying to take the Old Harbor Tunnel northbound. It's been a broken down vehicle for the last 30 minutes, and now it doesn't look like anybody's moving northbound going into the Old Harbor Tunnel. The backup is back to the spur at I-97. So think about your options of the Beltway up to 95 and then through the Fort",
        "start": 71.578,
        "end": 98.592
    },
    {
        "text": " mchenry tunnel because 895 is definitely having a problem and you're going to be sitting if you're getting into the tail end of that backup could be looking at a 40 minute delay right now for the traffic northbound typical ride and all the normal heavy traffic southbound and both the harbor tunnels i'm chuck whittaker with traffic and weather on the threes on talk radio 680 wcbm",
        "start": 98.592,
        "end": 121.357
    },
    {
        "text": " Cofra bringing us some rain and helping to cool things down. Today's only slightly cooler, though. Heat advisory for the afternoon. 96 to high today. Heat index up to 107. A few afternoon storms are possible today. I'm meteorologist Terry Smith from the Weather Channel. For Talk Radio 680, WCBM.",
        "start": 121.357,
        "end": 141.288
    },
    {
        "text": " It is already getting warm outside. It's going to get hotter and hotter and hotter as the day goes on. Right now, Essex has 81 degrees. Downtown Baltimore, it's 82. By the way, Aberdeen, a cool 79. At 8.04 in the morning on Talk Radio 680 WCBM. Good morning. It's 8.04. I'm Bruce Elliott. And now the news continues on The Morning 5 with Casey and Elliott.",
        "start": 141.288,
        "end": 163.319
    },
    {
        "text": " After 22 years, the Chesapeake Bay's annual report card is out and is now approved to a C+. Wow. According to the University of Maryland Center for Environmental Studies, the Bay's overall ecological health scored in the moderate range using data from 2023 up four points from the previous year. The Bay's score was 55%, five points shy of the good range, while the upper eastern shore had a downward trend. Other parts of the Bay improved or held steady.",
        "start": 163.319,
        "end": 192.722
    },
    {
        "text": " Heat advisory again in effect for much of Maryland today. According to the National Weather Service, the advisory covers central, northern, and southern Maryland until 8 p.m. this evening. Combination of high temps and humidity expected to bring the heat index values up to 107 degrees.",
        "start": 192.722,
        "end": 208.285
    },
    {
        "text": " In Baltimore City, Code Red Extreme Heat Alert continues through Thursday. By the way, whether you're in the city, county, or anywhere outlying, make sure you're checking in with your neighbors and any elderly folks you have or folks who have small children to make sure their air conditioning is working because it can be fatal for the folks, particularly in those age groups.",
        "start": 208.285,
        "end": 226.271
    },
    {
        "text": " Proposal to cut Baltimore City's property taxes will not appear as a ballot question in the November elections. Board of Elections Director Armistead Jones says under state law, the power to set a specific property tax rate in the counties and Baltimore City must remain with the county or city council. It's 8.06. WCBM Sports is next. Okay, let's go. Top row, tell me what you see on the eye chart.",
        "start": 226.271,
        "end": 250.077
    },
    {
        "text": " Um, E-Y-E-C-A-R-E? Good. Next row. A-M...",
        "start": 250.384,
        "end": 263.404
    },
    {
        "text": " America? EyeCareAmerica.org? Yes. EyeCare America is a program that helps seniors 65 and older who haven't had a medical eye exam in three or more years. They also help those with an increased risk for glaucoma. And the appointment is often free or at no out-of-pocket cost. There are thousands of volunteer ophthalmologists throughout the United States, which means there's probably a participating doctor right where you live.",
        "start": 263.575,
        "end": 291.749
    },
    {
        "text": " To protect your eyes, early detection is key. So don't wait. It's easy to see if you qualify. Go to eyecareamerica.org today. That's eyecareamerica.org.",
        "start": 291.749,
        "end": 304.65
    },
    {
        "text": " WCVM Sports. Well, the O's had a rough night last night. Dean Kramer had a rough day at the office. O's lost to the Cubbies 9-2 at Oriole Park at Camden Yards. Game two of the three-game set is this evening here in Baltimore. Nationals, they fell 7-5 to the Mets despite a ninth-inning rally. The Nets have lost three games in a row, and they take on the Mets again this evening up in Queens.",
        "start": 306.101,
        "end": 327.961
    },
    {
        "text": " Tampa Bay Rays shortstop Wander Franco has been formally charged in the Dominican Republic with sexual exploitation and abuse against the winner, according to ESPN. And an all-star pitcher now headed to the injured list, Dodgers starter Tyler Glasnow, added to the 15-day I.L. yesterday.",
        "start": 327.961,
        "end": 345.555
    },
    {
        "text": " Moderate today is the word to keep in mind as far as activity level goes. Your lottery numbers from last night, pick 3, 3, 4, 9. Your pick 4, 1, 3, 2, 7. And now you are back in touch with the Morning Drive on Talk Radio 680 WCBM.",
        "start": 345.555,
        "end": 362.619
    },
    {
        "text": " Some radio stations put their talk shows in a talk block. But first, this bombshell. Not here. You can talk around the clock. Stay connected and informed on Talk Radio 680, WCBM, and WCBM.com. You're listening to The Morning Drive with Casey and Elliot on Talk Radio 680, WCBM.",
        "start": 362.619,
        "end": 384.428
    },
    {
        "text": " And we are in hour number three, and love to hear from you. Join the conversation here this morning on any one of the topics we have discussed. And more to come. 410-922-6680, 1-800-WCBM-680. You can email us at TheMorningDrive at WCBM.com. Text into the show using the free WCBM mobile app. Our executive producer this morning is Michelle Drusilla, in for Kristen Higrick. And here are your top stories coming up in this hour. A Tawny Town veteran killed by a road rager.",
        "start": 384.735,
        "end": 413.677
    },
    {
        "text": " Sergeant Christopher Moore brought to the table a calming reassurance presence with his soldiers.",
        "start": 413.677,
        "end": 419.77
    },
    {
        "text": " Yeah. Also coming up during the course of this hour. Well, it turns out that Kamala just may be the president of the United States of America. If things fall the way she wants them to fall. How do people think that she'll do? She has been unqualified to serve as vice president and is not qualified or capable at all. If Biden wins, she will be president United States.",
        "start": 421.578,
        "end": 446.578
    },
    {
        "text": " But the top story here today, a numerous number of Marylanders were furious last night at a meeting at the Hereford Volunteer Fire Department in Baltimore County. It's about this power transmission line that is going to cut through Baltimore County, Carroll County, and Frederick Counties. And a lot of, as you might imagine, property owners and taxpayers are concerned about them being left in the dark, literally, on this project.",
        "start": 447.227,
        "end": 477.125
    },
    {
        "text": " And this is something that is being run by the New Jersey-based Public Service Enterprise Group. They're the one that basically held the event last night. Capacity. It was so packed that they had to come out and announce that there was no more room based on the occupancy requirements of the fire hall.",
        "start": 477.125,
        "end": 497.705
    },
    {
        "text": " And Delegate Nino Maggioni was there. We'll get his perspective here in just a second. But as you might imagine, tensions and temperatures were both hot because of what this proposal is all about. And what we're finding out...",
        "start": 497.705,
        "end": 514.462
    },
    {
        "text": " This is something that may or may not benefit Marylanders. It appears that, and this is being put forward by a lobby group, something called the Maryland Reliability Project, and they need to expand the electrical grid because apparently there's not enough power. There's a demand for power, but you're led to believe that this is going to benefit Marylanders.",
        "start": 514.462,
        "end": 540.486
    },
    {
        "text": " people in Baltimore, Carroll, and Frederick counties. And what we're finding is they're saying it's going to really benefit just this big data center that they're setting up in Urbana. But now we find out that really most of the power may be redirected towards Virginia.",
        "start": 540.486,
        "end": 557.312
    },
    {
        "text": " Or a pass-through, Sean. Or a pass-through. And they say this happens when they expand the grid in order to meet the demands in one place. They've got to put power lines through other places. But Adam Fry is the owner of the Fry Brewery and Family Farm in Frederick. And he said it's going to cost his farm and his business millions. I've worked for 15 years on this farm to make a farm. It's a farm brewery.",
        "start": 557.312,
        "end": 583.131
    },
    {
        "text": " It literally ruins my entire view. Every wedding that we have booked, millions of dollars. I mean millions of dollars thrown out the window right now. And one woman said she's concerned about her property values. It's going to degrade our property values.",
        "start": 583.131,
        "end": 598.148
    },
    {
        "text": " Now, this is being done under the auspices of government allowing this, right? Yes. So there's a takings issue here. This guy who runs a farm brewery and has lots of weddings there and says this is going to cost him millions of dollars. This is a taking, Sean. How are you going to compensate him for this? Well, that's a great question. It was asked of Jason Calwa. He was the spokesperson there from the public service enterprise group.",
        "start": 598.148,
        "end": 620.776
    },
    {
        "text": " I really hope that we don't have to use that at all. Our preferred method is to work directly with the property owner. And not use eminent domain. But they will. Because this is part of the little-known Maryland Piedmont Reliability Project, which is enabling this. And during his on-camera interview with Fox 45 last night, a very angry person came up and gave him who struck Johns.",
        "start": 620.776,
        "end": 647.227
    },
    {
        "text": " And you people are just stealing people's property. That's all you're doing.",
        "start": 647.227,
        "end": 651.118
    },
    {
        "text": " Well, welcome to Maryland. It's happened before. It doesn't matter whether it's Stadia or Member 509 down on the east side of the county. So, again, this is what politicians do. Palms are Greece. They take your land. Coming up, we'll hear from Delegate Nino Mangione and his response as to what's happening. This was in his district, the meeting last night in Hereford. So we'll hear from him as well. But you might imagine there was a line up York Road in Moncton, you know.",
        "start": 651.203,
        "end": 679.377
    },
    {
        "text": " yesterday to get into this place and they had to cut it off. It was so many people were upset about this. So this is the first meeting. I'm sure there's going to be more. We'll be covering that as well. 813 right now. Traffic and weather on the threes all morning long. Chuck Whitaker, good morning. Morning. It took about 45 minutes.",
        "start": 679.377,
        "end": 694.394
    },
    {
        "text": " Let's get this vehicle out of the tunnel northbound on 895. So now we're finally moving traffic again. That's the good news. Traffic is going into the tunnel, but we're still backed up on 895 all the way back to the spur where you come up from I-97 and from the VW Parkway headed north on 895. So again, if you're still back there in Adirondack County or Howard County, 95 at least for the time being. Give it a half an hour or so.",
        "start": 694.394,
        "end": 720.52
    },
    {
        "text": " To clear this out, 95 up through the Fort McHenry Tunnel right now is probably the better bet. I'm Chuck Whitaker with traffic and weather on the threes. On Talk Radio 680, WCVF. Well, the channel says excessive heat advisory in effect. It's going to be hot 96. Heat index over triple digits again with a chance of an afternoon thunderstorm. And right now we are hot. It is 81 in Ellicott City, 83 in Middle River, Scotland.",
        "start": 720.52,
        "end": 749.667
    },
    {
        "text": " Westminster gets the email of the day. He says, dear Casey and Elliot, under the logic of AOC, Johnny Zero should give up his run for Congress and endorse Kim Klesik. Yeah. Absolutely. Absolutely. All right. White liberal guilt. Come on, Johnny Zero. Lead by example. Time now to see which Democrats are going to emerge from Democrat clown E.V.",
        "start": 749.667,
        "end": 772.466
    },
    {
        "text": " Thank you.",
        "start": 774.275,
        "end": 779.838
    },
    {
        "text": " 815 Talk Radio 680 WCVM. Yes, once again. Let's see which lefty is losing it. Which clown is going to show up in the clown car today, folks? Let's head to the big top. Please enter. Grab your seats and focus your attention on the center ring as the Democrat clown car enters. Makes a series of left-hand turns. Comes to a full stop. And here is another piece of pure rational thought from Troy Reed. Oh, wait. I just said those two things in the same sentence? I'm sorry. I'm going to have to re-examine my entire life here. If it's Biden in a coma,",
        "start": 783.66,
        "end": 813.66
    },
    {
        "text": " I'm a vote for Biden in a coma. I don't even really particularly like the guy. A lot of his policy. Don't like him. He's not Donald Trump, right? Yeah. Hitler. White House. We keeping him out. Keeping Project 2025 out. That's all I care about. Up and down the ballot from the rooted to the tutor school board all the way up to White House and everything in between. Governors, members of Congress. I'm just going to vote all the way down to keep these people out.",
        "start": 813.66,
        "end": 835.879
    },
    {
        "text": " Yeah. OK. So no rational thought there. No understanding that individuals run as individuals and not as a piece of paper from the Heritage Foundation. But yeah, OK. Knock yourself out. If you have Biden in a coma, you vote for him. I hope that works out well for you. Living under the dictatorship of Kamala Harris, who, by the way, loves yellow school buses and Venn diagrams. So you might want to stock up on some of them.",
        "start": 836.152,
        "end": 863.78
    },
    {
        "text": " Get back in the clown car, you clown, and get out of here. We're seeing the fruits of the dumbing down of America with people like Joy Reid, Whoopi Goldberg, and others who are passing themselves off as quote-unquote informed analysts or pundits. She looks like she's an intellectual.",
        "start": 863.78,
        "end": 882.534
    },
    {
        "text": " Yeah, no, she's anything but intellectual. I don't think, she's as dumb as a box of rocks. She fits right in the same category as Kamala Harris and Whoopi Goldberg. You know, Whoopi Goldberg might be an incredible actress in some of her movies I've enjoyed over the years, but she is not. I thought Sister Act was great. I don't turn to her for a thinking person's analysis of the modern day, you know, political situation or anything else for that matter. No, I'd go to Sonny Hostin for that. Yeah, you should.",
        "start": 882.534,
        "end": 911.817
    },
    {
        "text": " All right, let's see what Delegate Mangione had to say about this transmission power line running through three Maryland counties, apparently to benefit the people of Virginia. What I see right now is what I believe to be a total lack of transparency. These people should not get off the hook without having to answer questions directly from my constituents. The people that live in these communities, I think they need to do a lot more.",
        "start": 912.568,
        "end": 937.756
    },
    {
        "text": " Yeah, we do need to learn a lot more as to exactly who's going to benefit from this power. That really didn't come out, to my understanding, in the meeting last night. And, of course, they had a nice presentation. I wasn't there. I had talked to somebody that was. They had maps and displays and all sorts of fancy-dancy things. But at the end of the day, I would want to know, how is Maryland going to benefit from this? How are the folks in Baltimore County, Carroll County, and Frederick County going to benefit?",
        "start": 938.217,
        "end": 968.08
    },
    {
        "text": " Now, eminent domain, you know with eminent domain, you never really get what is called a just taking or fair compensation as the Constitution does allow. You never really get that. You get basically maybe 10, 20 cents on the dollar if you're lucky.",
        "start": 968.08,
        "end": 986.34
    },
    {
        "text": " And it happened before. I remember, you know, because we've been on the air a long time here, Bruce. And back when they were building the stadia, the oil park at Camden Yards, when they were condemning all that land down there for private. And again, this is private use. And they could say it was for state stuff. But no, this was just a benefit.",
        "start": 986.34,
        "end": 1004.872
    },
    {
        "text": " A major league baseball club loved the Orioles, but they're not a state agency. They're not part of... But again, it was argued, and look, it turned out to be okay, but how about the people that lost property, that lost their homes, that lost their businesses? Were they made whole? I doubt it, because we heard for years from people that said they got screwed in that deal. Years and years ago, I read a book by Richard Epstein, who's a very, very...",
        "start": 1004.872,
        "end": 1030.418
    },
    {
        "text": " Bright, a legal professor, taught a number of universities, continues to teach, called Takings, Private Property, and the Power of Eminent Domain. Look it up. You can get it on Amazon.com. It's in paperback now. It is worth reading to understand the takings clause of the Fifth Amendment. Because...",
        "start": 1030.418,
        "end": 1046.988
    },
    {
        "text": " In my view, property rights are key to this country. Key to freedom. Yeah. Property rights mean that you do not work as a serf on someone else's land or you'll be holding the lord or lady for your existence. Property rights means from your sweat, from your work, you have a piece of property that is yours and cannot be taken from you without just compensation. Right.",
        "start": 1046.988,
        "end": 1073.524
    },
    {
        "text": " I would agree with you 100 percent. But that Kelo versus New London case. Oh, that's it. Blew that right out of water where they took it for private use, not for public use. That's what Emma Domain used to be for was to benefit the public. Public use. And then secondly, try not paying your property taxes. Oh, yeah. And see what happens to that. They'll take your property, which is communism.",
        "start": 1073.524,
        "end": 1097.978
    },
    {
        "text": " How the hell did we ever agree or allow a situation where, you know, we allow people to tax your property, and if you don't pay the tax, you lose your property? You can own your property completely. You can own your property 100%. Right. Oh, not a dime on your property, but if you don't pay your property taxes, at some point, they're going to say, thanks very much, but it's ours now. That makes you want to assert.",
        "start": 1097.978,
        "end": 1120.572
    },
    {
        "text": " That needs to change. And I imagine if we had somebody that came along and vowed to change that system, I think they would automatically be reelected or elected. All right. Don't forget the best of the morning drive available each and every day, WCBM.com. Check it out. It's in video form. And we appreciate our sponsor, the Law Offices of Michael A. Friedman.",
        "start": 1120.572,
        "end": 1144.377
    },
    {
        "text": " Good morning. This is Eddie Appelfelt with Dr. Dimitri Nova sitting right next to me here. He is the implant specialist in Owings Mills with over 30 years perfecting the art of dental implants, performing these implants thousands of times and hundreds of full mouth reconstructions. Welcome. Hello, Eddie. Thank you for having me.",
        "start": 1144.377,
        "end": 1162.415
    },
    {
        "text": " Over the course of time, we've talked about your specific philosophy in your practice. Can you tell me that again? Sure. Let me start with the old saying, we've never seen a tooth walking into our office. There is always human attached to it. So after your initial complementary consultation and 3D scan, we will develop personalized treatment plan in a judgment-free zone. No cookie-cutter solutions. Less is more. Do only what's needed. Okay.",
        "start": 1162.415,
        "end": 1188.387
    },
    {
        "text": " How would you separate what you do, your practice in Owingsville, with all the others? So that's pretty much the concept of everything is done under one roof. And secondly, it's very advanced technology and advanced training of the team. And lastly, it's a minimally invasive approach to dental implants.",
        "start": 1188.387,
        "end": 1209.002
    },
    {
        "text": " Now, that sounds interesting to me, minimally invasive implants. What does that mean exactly? Absolutely. Failing to plan what they say is planning to fail. So we would develop that treatment plan, perform it virtually, and when we're in the actual operating room, there's no surprise.",
        "start": 1209.104,
        "end": 1227.739
    },
    {
        "text": " And surgeries performed using robotic computer-guided surgical guide increases accuracy, reduces risk and trauma. And remember, our slogan is no cut, no pain, no stitches. One final question. How long would, say, one implant take? Oh, you can do it in 15 minutes. Wow, 15 minutes? Sure. Wow, that's great. Okay, well, there you have it. Dr. Nova, thank you very much for being here right next to me. To reach his office, all you have to do is go to dr.nova.",
        "start": 1227.739,
        "end": 1253.916
    },
    {
        "text": " Novodental.com. Dr. Novodental.com. We will talk again. Thank you for being here. Give us a call. The 2024 election will be the most pivotal in history. Hear the latest election news and developments so you can make an informed choice. Keep it here all day and all night on Talk Radio 680 WCVM and 99.9 FM in Hartford County.",
        "start": 1253.916,
        "end": 1274.991
    },
    {
        "text": " Good morning. It's 823 Wednesday morning on Talk Radio 680 WCVM traffic. And whether on the threes, once again, Mr. Indispensable, because he knows how to get around the problems. I'm telling you right now, Chuck Whitaker. Right now, 50 at the Bay Bridge and then over towards Cape St. Clair. We had all the problems yesterday. Nice and clear there this morning to the Severn River Bridge. The morning backup is there. I-97 southbound.",
        "start": 1277.534,
        "end": 1300.998
    },
    {
        "text": " At Route 32, we're still recovering. We had almost a 45-minute stoppage in the Old Harbor Tunnel. Northbound, we're still backed up to the spur from I-97 and coming up on 895 from the parkway. It's starting to move again at the plaza northbound. Very slow on the northbound side. Southbound, we're still in the area, I would say, 10 to 15 minutes now, both 95 and 895. Southbound, nothing really major, nothing out of the ordinary today.",
        "start": 1300.998,
        "end": 1329.497
    },
    {
        "text": " On the Beltway, JFX at last check. Still clear, moving okay from Ruxton Road through the ramps downtown. I'm Chuck Whitaker with traffic and weather on the threes on Talk Radio 680 WCVN. Well, the channel says heat advisory again today. 96 with heat index over 100. Thunderstorms this afternoon, maybe into tonight.",
        "start": 1329.497,
        "end": 1350.503
    },
    {
        "text": " 92 tomorrow. It is 83 in the city, 81 in Owings Mills. August said they did that to my grandparents to put in Route 70 there in Ellicott City. Just west of the Patapsco Bridge, they stole over 20 acres from my grandparents.",
        "start": 1350.503,
        "end": 1366.51
    },
    {
        "text": " Yeah, I imagine they didn't really get dollar for dollar. If they're going to take your land, they should give you two for one. Yeah, well, particularly in that kind of circumstance, because you live in a beautiful pastoral area. Guess what? We're taking 20 acres of your property. Right. We're going to underpay you for that. And then, of course, you no longer live in a pastoral area. You're next to a superhighway. Yep.",
        "start": 1367.039,
        "end": 1385.026
    },
    {
        "text": " Thanks. Yeah, really. Let's see. Gene says, good morning. In Carroll County, there are going to be two meetings. That's tomorrow, 7-11. It'll be from 2 to 4, and then again at 6-8 at the Senior Center in Westminster. So if you're concerned about the Piedmont Reliability Project and these...",
        "start": 1385.026,
        "end": 1402.892
    },
    {
        "text": " The power line's coming through your county, your property. There will be two meetings tomorrow at the Senior Center in Westminster in Carroll County. That'll be 2 to 4 p.m. and, again, 6 to 8 p.m. Make sure that you make plans to be in attendance. Patty's in Hartford. Good morning, Patty. Good morning. I've been following this project at PJM's Transmission Expansion Advisory Committee since last summer. Mm-hmm.",
        "start": 1402.892,
        "end": 1430.998
    },
    {
        "text": " And this project, the Maryland Piedmont Reliability Project, is part of a group of projects in four states that will cost ratepayers in the PJM 13 states $5.1 billion. It's bringing energy, electricity out of Chanceford Township, Pennsylvania.",
        "start": 1431.22,
        "end": 1451.527
    },
    {
        "text": " and then go through a flyover into northern Baltimore County, Carroll and Frederick, and it's going to hook up at the Dobbs substation, which is about three miles from the Potomac, across from northern Virginia, where it's data center alley. And you're right, this is to provide power to the data centers. PJM estimated that there will be 7,500 megawatts of increased demand from data centers in the Dominion and the APS first energy zones.",
        "start": 1451.527,
        "end": 1479.514
    },
    {
        "text": " We have 11,000 megawatts of retirement. And so they've ordered this big build out to bring electricity from West Virginia and from Pennsylvania. And and so the people in those counties are going to be victims of.",
        "start": 1480.196,
        "end": 1496.425
    },
    {
        "text": " right away that if they're not agreeing to sell to PSEG, PSEG will use eminent domain in court. We had a similar situation in 2017-18 here in Hartford. And so the folks are kind of shocked that that's what's happening, but they're going to have to push back. It doesn't benefit them at all.",
        "start": 1496.749,
        "end": 1519.36
    },
    {
        "text": " There is existing right away that Exxon owns that perhaps could be used, and they need to push for that. And I was at Valley Forge PDM headquarters on December 5th when they made 2023, when they decided these projects.",
        "start": 1519.36,
        "end": 1534.718
    },
    {
        "text": " And I asked the question of the VP of planning was the transmission owners like PSEG going to have town hall style meetings. And PDM said, yes, that's not what happened yesterday. PSEG was understaffed to deal with the size of the crowds. I was there at the evening meeting and Jason Kawa said,",
        "start": 1534.718,
        "end": 1554.599
    },
    {
        "text": " has agreed with Delegate Mangione's staff to hold a town hall meeting in the near future so that the folks of the area can have their questions answered. But this does not benefit anyone really directly in Maryland. It's basically to provide electricity to the data centers, the richest companies in the world. What about this claim, since you've been following it closely, Patty, that it would benefit a data center in Urbana?",
        "start": 1555.367,
        "end": 1581.988
    },
    {
        "text": " Well, you know, the data centers are mostly located in northern Virginia. And, of course, Frederick County is redeveloping an old aluminum smelting area, 2,100 acres, quantum loophole. And, of course, the governor is pushing for that. The PSC denied their 168 diesel backup generators.",
        "start": 1582.619,
        "end": 1605.333
    },
    {
        "text": " because they considered them to be a commercial endeavor. And, of course, Governor Moore had the legislature just last year change the law so that it bypasses the Maryland Public Service Commission. So, you know, they're going to do everything the governor is to make sure the data centers get up and running and screw the people in Baltimore. But the most thing that's concerning of the 70 miles, I ask the question,",
        "start": 1605.333,
        "end": 1628.063
    },
    {
        "text": " Because Sparks Glencoe Community Planning Council had a virtual meeting with PSED on June 26th, of which I participated. And I asked the question of how much ag-preserved land would be impacted along that 70 miles, and they said 10%. Well, you know, Sean and Bruce, state...",
        "start": 1628.251,
        "end": 1646.22
    },
    {
        "text": " taxpayers and county taxpayers pay for that preserved land. So we're going to steal that tax-funded preserved land to build transmissions. It doesn't benefit anyone in the area. And a half a billion dollars, $424 million is what it's going to cost. Yeah, absolutely. I mean, part of the projects are going to happen here in Hartford, in North Hartford.",
        "start": 1646.22,
        "end": 1667.995
    },
    {
        "text": " And Exelon was aboard at those, and they're going to be on existing infrastructure. All right, Patty, we've got to run. We're coming up on a break. But listen, thank you. Very valuable information. Thanks for calling in and sharing that with us and keep us posted on that. And again, those big meetings tomorrow in Carroll County, Senior Center, Westminster, 2 to 4, 6 to 8 p.m. 8.30, time for more news headlines. Here's Bruce.",
        "start": 1667.995,
        "end": 1689.258
    },
    {
        "text": " Thank you, Sean. Heat advisory, in effect, again today, is going to be brutal outside. According to the National Weather Service, the advisory covers central, northern, southern Maryland until 8 p.m. this evening. Combination of high temps and humidity expected to bring the heat index to about 107 degrees. Actual temps should be between 96 and 100.",
        "start": 1689.258,
        "end": 1709.275
    },
    {
        "text": " In Baltimore City, a code red extreme heat alert continues through Thursday. Cooling centers are open. Pools have extended hours. Severe storms moved through parts of Baltimore yesterday, bringing heavy rain and flooding to southern parts of the city. A number of drivers became stranded in high water in the areas around West Patapsco Avenue and Poteet Streets. Nobody was injured, but of course some cars are now pretty waterlogged.",
        "start": 1709.275,
        "end": 1732.022
    },
    {
        "text": " A proposal to cut the Baltimore City property tax will not be appearing as a ballot question in the November election. Board of Elections Director Armistead Jones says that under state law, the power to set a specific property tax rate in the counties in Baltimore City must remain with the county or the city council. And after 22 years, the Chesapeake Bay's annual report card is out and is now, wow, the Bay is now a C+. Wow.",
        "start": 1732.022,
        "end": 1758.49
    },
    {
        "text": " According to the University of Maryland Center for Environmental Studies, Bay's overall ecological health scored in the moderate range using data from 2023. That's up four points from the previous year. Bay's score, 55 percent, five points shy of the good range, while the upper eastern shore has a downward trend. Other parts of the Bay improved or held steady. It's 831. WCBM Sports is next.",
        "start": 1758.49,
        "end": 1781.647
    },
    {
        "text": " Hey, it's Sean Casey for Target Radon Mitigation. Until recently, I wasn't aware of the serious health consequences associated with exposure to radon gas. Why risk your health, right? Check out TargetRadon.com for yourself and test to see if your home is higher than normal levels. If so, install a mitigation system with Maryland's premier radon mitigation company. You'll get the best service, equipment, pricing, and peace of mind. Visit TargetRadon.com or call Steve, the owner, at 410-913-6675.",
        "start": 1781.647,
        "end": 1810.043
    }
]