[
    {
        "text": " Highs 78 to 83, partly sunny Monday, some shower and possible thunderstorm activity developing. Highs of 81 to 84. For the WMIC and WTGV 24-hour weather center, I'm meteorologist John McMurray.",
        "start": 0.009,
        "end": 19.889
    },
    {
        "text": " We'll be right back.",
        "start": 20.213,
        "end": 50.026
    },
    {
        "text": " Whoa, isn't it supposed to be a four-leaf clover? Not the way I play. Right. Everybody's playing the Michigan Lottery's Fast Cash Game, Five-Win Lucky Clover. It's a $20 ticket with five different ways to play and win, and a top prize of the full Fast Cash jackpot, plus $250,000. Just my kind of number. Try your luck with the new Fast Cash Game, Five-Win Lucky Clover, only from the Michigan Lottery. Knowing your limits is always the best bet.",
        "start": 51.647,
        "end": 80.094
    },
    {
        "text": " So each and every week in this country, there are a lot of big news stories that social media makes sure never appear on your timelines. So you want to know what they're actually hiding from you? What are the big stories that you need to know about? What's the information they're making sure that even if you share it, your family and friends won't see it? We give it all to you every Sunday night.",
        "start": 81.101,
        "end": 99.821
    },
    {
        "text": " right here on the Ben Ferguson Show. Yeah, we cover the stories that big tech and big media won't let you see. Ben Ferguson Show, Sundays, 7 p.m. to 10 p.m. on WMIC, AM 660 and 95.3 FM. When I got out of the Marine Corps, I was not just, you know, working with my physical disabilities. I was emotionally broken. I remember thinking, how did I get here? How?",
        "start": 99.821,
        "end": 129.497
    },
    {
        "text": " It was affecting me in my marriage. My husband, he didn't know how to help me. He actually called Wounded Warrior Project. Wounded Warrior Project had this thing called Couples Odyssey. It was an eye opener and I think it really saved our marriage. They gave us books and resources and tools on how to help us with that. I just love him. I love you, honey. I love you too.",
        "start": 129.855,
        "end": 153.968
    },
    {
        "text": " Watching her fight for her mental health, fighting for other veterans, fighting for this family, helped me to fight too. Well, I always loved it, but I love her 10 times more for that. Not all wounds are visible. If you or a loved one are suffering, visit woundedwarriorproject.org slash notalone. Hey, Dad, your prescription will be ready in just a minute. Hey, Dad, your laundry will be ready in just a minute. Dad, your lunch will be ready in just a minute.",
        "start": 155.23,
        "end": 185.128
    },
    {
        "text": " Hey, honey, why don't you take a minute? When you help care for a loved one, you give them as much time as you can, making sure they're safe and comfortable. But it's just as important that you take some time for yourself. At AARP, we can help with information and useful tips on how you can maintain a healthy life balance, care for your own physical and mental well-being, and manage the challenges of caring for a loved one. Because the better care you take of yourself, the better care you can provide for your loved one.",
        "start": 185.725,
        "end": 214.804
    },
    {
        "text": " Thanks, Dad. Thank you. You're there for them. We're here for you. Find free care guides to support you and your loved one at aarp.org slash caregiving. That's aarp.org slash caregiving. A public service announcement brought to you by AARP and the Ed Council. It's the Car Doctor Show with Ron Ananian on the Voice of the Thumb, WMIC 660 AM and 95.3 FM Sandusky.",
        "start": 215.452,
        "end": 243.899
    },
    {
        "text": " About older cars, you know, now that I've convinced you that you can't keep your older car because there's no parts, let me tell you why they're fun and great to have. All right. We just added a 2002 Thunderbird, a Ford Thunderbird, to the family fleet. Had to make some repairs. Took forever to find parts. Really, really a tough gig. And, you know, kind of tooling around in that as a, my God, what a basic car.",
        "start": 245.247,
        "end": 268.097
    },
    {
        "text": " You know, it's got a radio that's only a radio. It's not an entertainment system. It's not a television set. It doesn't launch missiles. It doesn't have a backup camera built into it. It doesn't warn you when anybody's near you. It's a radio. And it's got these funny little buttons. You push it on, it turns it on. You push it again, it turns it off. It has these little sticky buttons called presets. You go ding, ding, ding, ding, ding.",
        "start": 268.097,
        "end": 291.561
    },
    {
        "text": " I think the most high-tech option on this car is you can lock the trunk with a switch. You put the key in and you turn it and the button won't go down. That's high-tech on a 2002 Ford Thunderbird. It's really kind of hilarious. You're just not used to any of this. New cars have spoiled us, I will tell you that. And sometimes it's just fun to get into something like that and just go for a ride because it's very, very mechanical. So that's one thing I will always enjoy about older vehicles.",
        "start": 291.561,
        "end": 318.575
    },
    {
        "text": " Let's go to Tom in Florida with some general battery questions. Tom, welcome to The Car Doctor, sir. How can I help? Yes, sir. What's going on? Before I start, I think your website might be under that meltdown there because it's not working, the live thing on there. The stream? Okay. All right. Good to know. We'll take a look at that. Not a problem. Yes. But last year, I bought a battery for my daughter's Audi. It was...",
        "start": 318.575,
        "end": 346.613
    },
    {
        "text": " Yeah, it was just about a year ago, and it died last week. And we were looking at the battery, and it was dated two years. When we bought it, it was dated two years ago. So are you saying the battery is three years old, or it was a year old when you bought it? Yep, it was two years old when we bought it. Now it's three, and it's dead. Okay, and what's the warranty on it?",
        "start": 347.278,
        "end": 375.162
    },
    {
        "text": " They actually covered it 100%. They gave us a new battery. It was checked to date. It was fine. My question is, and maybe to warn other people, can they sell it forever or...",
        "start": 376.476,
        "end": 388.575
    },
    {
        "text": " You know, it's a great question, Tom. It really is, and it is a concern. I will answer it like this, if I can, with a little story. So, you know, we stock batteries at the shop. And, you know, we just stock, I think, 10 or 12 of the common popular numbers and some of the not-so-common popular numbers. And I count on the battery truck to come around every couple of weeks, and he'll look at the date code on the battery and say, yeah, this one's got to go, this one's got to go, and they rotate your stock around.",
        "start": 389.258,
        "end": 416.408
    },
    {
        "text": " You know, it took me a while, but after so many years in the business, I finally asked the question one day. I said, so when you take these batteries out of here, if the battery is sitting longer than 120 days, they'll pull it from my inventory. And, you know, where does it go? You know, I kind of wanted to know that question. I'm just curious by nature.",
        "start": 417.261,
        "end": 435.691
    },
    {
        "text": " And to your point, they'll take that battery, and depending upon the part number, they will either put it at a location that has high recorded instances of using a 26R or a 34G or something like that, or they'll sell it off to other vendors. And I said, what do you mean other vendors?",
        "start": 435.691,
        "end": 454.48
    },
    {
        "text": " And the battery guy explained to me, and I've seen this a couple of times, so I believe it to be true. They will sell it off to bidders, road service companies, you know, the towing companies of the world, to say it cleanly, that will buy that battery.",
        "start": 455.367,
        "end": 471.937
    },
    {
        "text": " And recondition it. By recondition it, I mean they will put it through a recharging process where they'll desulfate the battery, make sure it's up to charge, give it some load testing, make sure it passes, and then put their own label on it, their private brand label. So Tom's Battery Company, right? And they'll sell that as a new battery. Why? Because it's never been used.",
        "start": 471.937,
        "end": 493.592
    },
    {
        "text": " but it's old. And I see this a lot. And as convenient as roadside battery installation is, and it isn't anymore because battery installation is getting to be a chore unto itself. If somebody wants to put a battery in their late model Ford Escape going up to about model year 2018, I'd pay to see that because it's a chore doing a battery. Half the car's got to come apart on that driver's side.",
        "start": 493.729,
        "end": 521.869
    },
    {
        "text": " So, you know, yeah, it's an issue. You know, if you're looking for battery information too, Tom, just to give it a real quick shout out, go out to autobatteries.com. Excellent resource, how batteries work, things to be concerned with, how to find a good battery, that kind of thing. But autobatteries.com can probably help you. And, you know, it's sort of like the online resource we use in the shop all the time. But it's not unusual. You know, is the car all right now?",
        "start": 522.022,
        "end": 548.524
    },
    {
        "text": " Yeah, yeah, I mean, put the new battery in, it works fine now. Right, yeah, it's, you know, and the funny thing is, and I'm not sure why, but about five years ago, the industry changed. They used to prorate batteries.",
        "start": 549.48,
        "end": 564.462
    },
    {
        "text": " where you would use it so many months and get back so many dollars against it and such. They don't do that anymore. Most batteries today have a three. At max, I've seen a four-year warranty, maybe three and a half. And then after that, you're done.",
        "start": 564.718,
        "end": 581.886
    },
    {
        "text": " And yeah, there's no warning or anything. There's no warning or anything. I you know, it's funny. I still see batteries as having a four to five year life cycle. You know, the online people are going to generate so much mail over this comment. But, you know, because everybody's going to write me and tell me I got nine years out of my battery. Good. Lucky you. The industry says, you know, listen, you know.",
        "start": 581.886,
        "end": 605.401
    },
    {
        "text": " You're the guy stuck on the side of the road or in the parking lot at 2 o'clock in the morning when it won't start. You know, the industry says four to five years. And AGM batteries, AGM batteries are a funny duck, right? They're a completely different type of battery in a sense.",
        "start": 605.401,
        "end": 620.913
    },
    {
        "text": " I've seen certain models gobble up batteries every three and a half years, and I've seen certain models go six years. But beyond six years, I'm putting a battery in it. And if I'm changing the battery in a vehicle and it has a separate start-stop battery, I'm doing that as well because that battery is generally the same material, and obviously it's the same age. So if one went, the other went. Batteries are a very complicated conversation to have these days.",
        "start": 620.913,
        "end": 650.282
    },
    {
        "text": " They really are. And on a newer car, do you have to get start-stop now on a gas engine? You don't have a choice. It'll depend on what the manufacturer is trying to achieve from emissions values. The reason there's start-stop, let me answer it this way. The reason there's start-stop is manufacturers are trying to hit a certain fuel economy.",
        "start": 650.282,
        "end": 671.886
    },
    {
        "text": " Because how many cars they sell that get 40 miles to the gallon versus how many cars they sell that get 20 miles to the gallon, they get emissions credits and different compensation from the government because they're trying to clean up the environment. And that's really where all that start-stop technology came from. They're worried about emissions and gasoline. There are ways to get around start-stop. There are some vehicles that come with a button that you can turn it off. If the vehicle has a fault code in it, start-stop will not work.",
        "start": 672.261,
        "end": 702.261
    },
    {
        "text": " in most experiences that i've had if i get to a traffic light and i want to see if start stop doesn't work pop it into neutral just gotta remember to hold your foot on the brake so the car doesn't roll um but you know sometimes popping it in neutral will take it away i personally have an issue with start stop real quick because i just worry that on an older vehicle",
        "start": 702.261,
        "end": 722.073
    },
    {
        "text": " the abuse I'm putting on the starter, the, the, how, how good is that battery? Um, I don't want to find out, you know, late at night in a bad part of town, right. That my stop start battery isn't working. Um, you know, to me, I'd like to know once the car started, I'm coming home late at night, et cetera. I'm going to get there. Uh, you know, but shame on me. I try to think logically. Um,",
        "start": 723.029,
        "end": 748.131
    },
    {
        "text": " And, you know, I did an experiment, Ron, last year. I just bought a brand new car. I left it on. I didn't touch anything for six months. It said I saved a total of 0.97 gallons of gas. Well, listen, I can show you that the government's crazy.",
        "start": 748.131,
        "end": 765.555
    },
    {
        "text": " All right. You know, it's it's listen, move to New Jersey, move to move to New Jersey and go get a vehicle titled in North Jersey. I had to travel an hour and five minutes a week ago to go get a vehicle titled. But the agency that does registration is six minutes from the house. So, you know, but we're trying to clean up the environment and save gasoline. I want to know who makes up these things. Who thinks of this?",
        "start": 765.555,
        "end": 786.323
    },
    {
        "text": " Somebody that rides a bicycle, I bet. Yeah. Even for the government, the post office would be out of business. Right. Exactly right. You wouldn't need it. Yeah. Yeah. It's crazy. All right, sir. I got to run. Thanks for the info about the website, Tom. You have a great time. Get out to autobatteries.com, and that'll help you in the future, and you be well, and thanks for being part of the Car Doctor family. I'm Ron Anany in the Car Doctor, 855-560-9900. I'll return right after this.",
        "start": 786.323,
        "end": 811.323
    },
    {
        "text": " Ronananian, the car doctor, is brought to you in part by Dorman Products, featuring the largest selection of direct replacements for failure-prone turbocharger system parts in the business. Learn more at DormanProducts.com. Clean, correct coolant is vital to the life cycle and operation of your vehicle's cooling system and engine. Peak Antifreeze Plus Coolant is specially engineered to deliver guaranteed superior lifetime protection. It's compatible for use with any color or type of antifreeze in your vehicle's system.",
        "start": 832.022,
        "end": 860.64
    },
    {
        "text": " And with robust organic additives, Peak Antifreeze Plus Coolant will fight against the damaging effects of scale deposits and corrosion. You can learn more at peakauto.com. That's peakauto.com. Clarios is a global leader in energy storage solutions, powering one in three of the world's vehicles today. They offer the most advanced battery technologies for virtually every type of vehicle. We recently talked with Clarios Vice President of Technology, Craig Rigby.",
        "start": 860.64,
        "end": 887.585
    },
    {
        "text": " Craig touched on the future of electric and hybrid vehicles. Well, new vehicle production is definitely shifting towards hybrids, and in particular, electric vehicles at a very rapid pace. Claris estimates that out of the 1.7 billion cars expected to be on the road by 2040, up to 50% of those will be some combination of full, mild hybrids and electric vehicles. This shift will require a lot of change, not the least of which is having enough charging stations to make both daily driving and long trips practical.",
        "start": 887.585,
        "end": 915.623
    },
    {
        "text": " As different and complex as these vehicles have become, the basic things we do to maintain them won't really change. And that includes maintaining your 12-volt battery and changing it out when necessary. Learn more about AGM batteries at Autobatteries.com. That's Autobatteries.com. As a professional, you've got 1,001 things to track in your shop and zero minutes to slow down. AutoZone understands that and is here to help you keep your business moving.",
        "start": 916.169,
        "end": 942.261
    },
    {
        "text": " AutoZone has original equipment quality or better parts from brands you can trust. Leading in-stock coverage, fast hot shot delivery, and easy to track online ordering so that you can get the right parts right when you need them. Keep it moving with AutoZone's professional edge.",
        "start": 942.261,
        "end": 961.101
    },
    {
        "text": " Summer's most exciting week is approaching fast. It's the Santa La County Youth and 4-H Fair Sunday through Saturday, August 4th through the 10th. The week begins with the fair auction Sunday at 2. There's a gospel sing Sunday evening. The Big Rock Amusements Carnival runs from 3 to 10 Tuesday, Wednesday and Thursday and from 1 to 11 Friday and Saturday.",
        "start": 963.746,
        "end": 986.067
    },
    {
        "text": " Kicking off the Grandstand Show on Monday evening is the Bump and Run. Monday's admission to the fair is just $15. This is ideal for fairgoers to see the exhibits and take in the Grandstand Show. Monday is also Military Day with $10 admission for military members with ID. Kids Day is Thursday with $15 admission for every member of the family between 11 and 1. And you can stay all day.",
        "start": 986.834,
        "end": 1012.841
    },
    {
        "text": " The TK Pearl Rodeo happens both Tuesday and Wednesday evenings. Thursday, it's Bump and Run Enduro. Friday, it's the Big Tractor Pull. And Saturday evening, the Great Demolition Derby. Don't miss a day of the Santa Licana Youth and 4-H Fair Sunday through Saturday, August 4th through the 10th in Sandusky.",
        "start": 1012.841,
        "end": 1032.21
    },
    {
        "text": " The next disaster is coming. The time to get ready is now. Make a plan. Identify meetup locations and people you'll need to contact. Put your contact list in your wallet, on your phone, and somewhere visible in your home. Build a kit. Store enough food and water for three days. Don't forget your pets. And consider buying a pre-made kit. Keep at least seven days of medication on hand.",
        "start": 1033.183,
        "end": 1062.005
    },
    {
        "text": " Work with your pharmacist and insurance company to secure the extra doses. Make copies of important documents. Keep them on your phone, in the cloud, or on a USB stick. Stay informed. Learn about local hazards. Take courses in CPR and first aid. And sign up for local alert systems. An early warning can give you the time you need to prepare for a fast-moving disaster. Be ready. Learn more at americares.org slash send us in.",
        "start": 1062.517,
        "end": 1092.517
    },
    {
        "text": " Ron and Amy in the Car Doctor here to answer your questions at 855-560-9900. Let's go over to Travis up in Canada and see what's going on here. Travis, welcome to the Car Doctor, sir. How can I help? Hi, Ron. Thanks for having me. How are you doing? You're welcome, sir. Good. What's going on? I got a 2003 Mitsubishi Eclipse. It's got 131,000 miles on it, and it's got the 2.4 liter motor in there. Right, yep. And I've been fighting a P0171.",
        "start": 1105.043,
        "end": 1133.882
    },
    {
        "text": " Okay. For, oh, I don't know, about eight or nine months. Right. And it's been off the road for a while just as I'm trying to diagnose and fix the darn thing. And, yeah, I've kind of gone through the service manual, and I'm kind of stuck. I don't know where else to go. I've checked for, you know, vacuum leaks, exhaust leaks, and I've fixed a few of those. And it's still throwing the code. The vacuum leaks I fixed have brought the short-term fuel trim back.",
        "start": 1134.07,
        "end": 1161.834
    },
    {
        "text": " Down at idle, which at first I thought that was, oh, hey, maybe that was the problem. But my long-term fuel trims driving and at idle and under load are stuck at 12.5 all the time. Okay. So it's always got high fuel trims. Are the fuel trims high at idle or even going down the road?",
        "start": 1162.346,
        "end": 1182.329
    },
    {
        "text": " Both. The long-term is just pegged out at positive 12.5, and at idle they were low 20s consistently before I fixed the vacuum leaks. Still too high. And then now they seem to be long-term stuck at 12.5, and short-term is anywhere from plus, I'd say plus 7 to plus 10 all the time. Okay. So have you tried making this richer? Do you have any propane?",
        "start": 1183.831,
        "end": 1211.715
    },
    {
        "text": " I have, yeah, and immediately when I throw that in the intake, the trims come down. Okay, good. So that shows us DO2s are working, right? Yeah. It's able to respond. So sitting there at idle, warmed-up engine, have you looked at mass airflow grams per second? Yeah, I'm sitting at about 2.8. That's about right. That's about right. And then as you accelerate down the road, it increases.",
        "start": 1213.148,
        "end": 1240.657
    },
    {
        "text": " Yeah, absolutely. Yeah. Okay. And have you poked around with propane? For like looking for leaks, you mean? Yeah, just looking for a vacuum leak. I've smoke tested. I bought a smoke machine off Amazon, and that's been great. That helped me find my other leaks. So now when I go into the brake booster or another line, the only minor leak that I have is,",
        "start": 1241.92,
        "end": 1269.582
    },
    {
        "text": " It's almost like it has a mechanical throttle body with a throttle cable. Right. And it's coming out. There's a bit of smoke coming out where the spring is on the throttle body. I don't know if it's the throttle body shaft seal maybe. Okay. But I don't know if that's normal as the smoke machine builds up pressure, but that's the only spot I got smoke coming out in the intake side. Well, and smoke's a great way to go and good initiative, right? I like your thinking. Mm-hmm.",
        "start": 1270.179,
        "end": 1297.073
    },
    {
        "text": " So a smoke machine generates about a half a PSI in most cases, depends on what yours is. But a smoke machine test is only half the equation, all right? I'd still like to do it with propane. So what sort of propane setup do you have? Oh, it's just a generic camping, like, yeah, like a torch. Oh, okay. Tell you what, sit tight, Trevor. Let me pull over and take the pause. When we come back, we'll finish up. I'm Ron Ananyan, The Car Doctor. We'll be back right after this.",
        "start": 1297.073,
        "end": 1326.834
    },
    {
        "text": " Since 1996, AgriValley Services has proudly provided the thumb with internet service touting better speeds, reliability, prices, and support. These are the pillars of our mission to deliver quality internet connectivity to rural Michigan communities. As technology steadily advances, we do too. That's why we've adopted a fresh look and a new name, AVS Broadband.",
        "start": 1350.998,
        "end": 1372.944
    },
    {
        "text": " Now rest assured, we're the same great people and the same amazing service that you've known for the past 27 years. We're still locally owned and committed to investing in the communities we serve. Our new name clearly reflects where we're headed, a broadband future powered by our advanced fiber optic and fixed wireless technologies.",
        "start": 1372.944,
        "end": 1390.794
    },
    {
        "text": " If the past few years have taught us anything, it's that broadband access is a vital part of how we live, work, and play. With AVS Broadband, the future is full of opportunity. For more information about our plans and availability, go to avsbroadband.com or call our sales team at 888-282-4932.",
        "start": 1391.084,
        "end": 1412.039
    },
    {
        "text": " I'm Ben Affleck, and I want to thank you for joining me and supporting Paralyzed Veterans of America. I joined the Navy to serve my country as a Navy SEAL. While parachuting with my platoon, my parachute didn't open. I broke my neck. It left me paralyzed. Paralyzed Veterans of America was by my side from that moment on.",
        "start": 1416.766,
        "end": 1436.903
    },
    {
        "text": " Since 1946, Paralyzed Veterans of America has kept a promise to our wounded veterans. We will never leave a fallen comrade behind. Thanks to PVA, paralyzed veterans are getting specialized medical care and treatments, the benefits they've earned, the jobs they want, and the accessible vehicles and homes they need. I just don't think my family would be as happy as they are without the support that I've received from Paralyzed Veterans of America.",
        "start": 1438.575,
        "end": 1467.346
    },
    {
        "text": " Our veterans fought for us. Let's fight for them. To learn more, go to pva.org today. Are you a veteran who served offshore of the Republic of Vietnam between 1962 and 1975? Blue Water Navy veterans and their family members may now qualify for compensation and survivor benefits for health conditions linked to herbicide exposure such as Agent Orange.",
        "start": 1468.302,
        "end": 1493.797
    },
    {
        "text": " To learn more, call 1-800-749-8387 or go to va.gov and search Blue Water Navy. Brought to you by the U.S. Department of Veterans Affairs.",
        "start": 1494.957,
        "end": 1506.015
    },
    {
        "text": " Time is precious. Tens of thousands of people with incurable breast cancer must wait 29 months for federal financial assistance and health coverage. Many won't live that long. They need help now. In less than 30 seconds, you can improve their quality of life. Text the word waiting to 40649 or go to coleman.org slash waiting to send a message to Congress. Tell lawmakers that time is running out for people with terminal breast cancer.",
        "start": 1508.643,
        "end": 1536.578
    },
    {
        "text": " Hey, we're back. Ron and Amy in the Car Doctor at 855-560-9900. The Car Doctor's 24-7 hotline. Travis, you're there.",
        "start": 1547.346,
        "end": 1553.882
    },
    {
        "text": " I am, sir. Okay. I want you to take your propane bottle. All right. And you've probably got like the little crank on black knob that turns on and off. Like if you're going to light it to do plumbing work or light up a camping lantern, that kind of a thing. Right. Okay. So somehow you've got to nick that on. You've got to attach a black rubber hose or some sort of rubber hose to that. And then on the other end of that rubber hose, I want you to get a small piece of steel brake line, three sixteenths.",
        "start": 1555.06,
        "end": 1580.725
    },
    {
        "text": " And I want you to peen one end of that brake line down so it's just a point. So crush it flat. Typically what I'll do is I'll put it in a vice and I will peen it shut except for one little corner. I'm trying to make a pinpoint opening in the end of the brake line.",
        "start": 1580.879,
        "end": 1598.285
    },
    {
        "text": " All right. Now, when I open up the propane and I'm going to open it up slow, realizing that if something backfires, I've got a hand grenade in my hand. Right. OK. The dangers of auto repair, brother. All right. And I'm going to use that pinpoint like a wand and I'm going to direct it at specific things. And I can control the flow with the knob. I don't have to turn on a full just a little bit of a flow. Right.",
        "start": 1599.053,
        "end": 1620.896
    },
    {
        "text": " If you were to look at the O2 sensor by scan tool or voltmeter, whatever way you want to do it, can we agree that if you were able to get propane directly in that throttle shaft and it made a difference on how the O2 read, that it's making a difference on fuel trim?",
        "start": 1620.896,
        "end": 1634.906
    },
    {
        "text": " It should, yeah. Yeah, right? Fuel trim is fuel trim. I mean, it doesn't know where the fuel or the air is coming from. So, you know, I want you to do that. That's the whole purpose of propane. Propane is not just in that big globular. If we were going to do massive amounts of propane like that, we might as well use carb clean from the 70s.",
        "start": 1636.442,
        "end": 1654.394
    },
    {
        "text": " All right. The idea is propane can make a very pinpoint accurate diagnostic tool. All right. I want you to get a yellow notepad and just eliminate things. I want you to check fuel pressure if you can. I've done that. Yep. Good. You wrote down your results?",
        "start": 1654.394,
        "end": 1671.357
    },
    {
        "text": " Yeah, it was one PSI at curb idle over the spec. Okay. So I figured that was good enough. Take a look at the maps. Take a look at the map sensor. Key on, engine off. You should see four to four and a half volts. Start it up. You should see a volt, volt and a half, something like that. But just be specific. Propane the throttle body. Just make sure there are no vacuum leaks elsewhere. Leave the brake booster disconnected.",
        "start": 1672.346,
        "end": 1697.381
    },
    {
        "text": " All right? And then last, look around in the area of the O2 sensor. Any exhaust leaks. Any exhaust leaks will skew that O2 and will contribute to a lean code. Do those things. Call me back. Until the next time, I'm Ron Ananian, The Car Doctor. Good mechanics aren't expensive. They're priceless. See ya.",
        "start": 1697.381,
        "end": 1713.319
    },
    {
        "text": " United States Deputy Sheriff's Association is a national nonprofit and America's largest nongovernmental provider of services to law enforcement. USDA assists city, county, state, and federal law enforcement agencies through our many varied programs, including free safety equipment donations, free officer survival training, cash donations, and condolence letters to the family of law enforcement officers who perish in the line of duty.",
        "start": 1722.449,
        "end": 1748.66
    },
    {
        "text": " USDA also offers college scholarships for the dependent children of law enforcement along with a citizen awareness program and thank you cards to law enforcement. These are just some of the ways United States Deputy Sheriffs Association assists America's law enforcement and the citizens they serve. For more information about United States Deputy Sheriffs Association or to see how you can help,",
        "start": 1748.66,
        "end": 1771.015
    },
    {
        "text": " visit www.usdeputy.org. United States Deputy Sheriff's Association, taking training to the next level because lives are on the line. Celebrating over 50 years on the air, this is AM 660 WMIC Sandusky and 95.3 FM W237EQ Sandusky.",
        "start": 1771.015,
        "end": 1793.609
    },
    {
        "text": " From ABC News, I'm Chuck Sievertson. Former President Trump holding his first rally with his new running mate, J.D. Vance, in Grand Rapids, Michigan, a battleground state, and needling the Democrats calling for President Biden to quit the race. Sort of interesting. This guy goes and he gets the votes and now they want to take it away. That's democracy. They talk about democracy.",
        "start": 1795.964,
        "end": 1816.032
    }
]