[
    {
        "text": " that sometimes end up in food because they're given to cows and athletes eat the cows and it's in their system. TMZ is not one of those drugs. This is a prescription heart medication. And the Chinese are unable to explain why a prescription heart medication ended up in a kitchen or how the athletes even ingested it. And under the code that is supposed to govern Olympic athletes,",
        "start": 0.009,
        "end": 28.78
    },
    {
        "text": " you can have what are called essentially no-fault contaminations in which an athlete is not penalized for testing positive for a drug. But to do that, you essentially need to prove exactly how it happened. And the Chinese explanation, according to anti-doping experts who've looked at this and studied it, doesn't rise to that level.",
        "start": 29.224,
        "end": 54.991
    },
    {
        "text": " OK, so what do they do in this case? In this case, the World Anti-Doping Agency essentially comes in, looks at the Chinese explanation and accepts the rationale that these athletes were contaminated with this prescription heart drug.",
        "start": 55.111,
        "end": 74.667
    },
    {
        "text": " And without anyone knowing, these swimmers who tested positive head to the 2021 Olympics and have some of the greatest success in Chinese swimming history. A male swimmer who had tested positive for TMZ becomes the second man in Chinese history to win a gold in swimming. A female swimmer who had tested positive won two gold medals and one silver.",
        "start": 75.333,
        "end": 103.626
    },
    {
        "text": " And the most dramatic example comes in the women's four by 200 relay race. China up for the challenge. Two of the four swimmers on the Chinese team had tested positive for TMZ.",
        "start": 103.626,
        "end": 120.742
    },
    {
        "text": " For the United States, Alison Schmidt, who testified on Capitol Hill, is the first swimmer in the water. For much of the race, China and Australia are neck and neck. But the Australians still can't shake off the attentions of China.",
        "start": 120.981,
        "end": 144.684
    },
    {
        "text": " But then... While Ledecky is racing in the water for the USA, the USA could steal this whole thing with Ledecky now. In the final leg, Kate Ledecky, the greatest female swimmer of her generation, gets in the water and closes the distance. I think we may have a change of leader when it comes to the 50 metres to go mark. This is a wild finish at the end of the women's 4x200 freestyle. China have broken Australia, but Katie Ledecky on the charge.",
        "start": 145.452,
        "end": 173.968
    },
    {
        "text": " And as it comes down the stretch, the United States pulls into second. And in the final moments, as the swimmers are approaching the wall. China's strike gold, just in front of the United States. It's a new world record, of course it is. A Chinese swimmer hits the wall first by less than half a second.",
        "start": 173.968,
        "end": 200.435
    },
    {
        "text": " giving China the gold and the United States the silver. And what a swim from the Americans. You write them off at your peril. I honestly have chills hearing this. I mean, this is an extremely tight race, which we're now learning, based on your reporting, was potentially fundamentally unfair. And as Phelps and Schmidt said when they testified before Congress...",
        "start": 200.64,
        "end": 230.213
    },
    {
        "text": " All of this calls into question the larger system. Was the system that was supposed to ensure that athletes were all competing on the same playing field, was that functioning? Was this a race in which athletes were showing their natural abilities or that something else was at play?",
        "start": 230.776,
        "end": 254.053
    },
    {
        "text": " We'll be right back. The Daily is supported by BetterHelp, committed to supporting mental health through therapy. Clients are matched with one of 35,000 therapists and can communicate via video chat or phone at betterhelp.com slash public.",
        "start": 263.473,
        "end": 279.923
    },
    {
        "text": " Climate change is dire, but it does not have to be world-ending. Even though they can feel removed from our daily lives, the solutions are out there. Tune in to the latest season of How We Survive from Marketplace, wherever you get your podcasts. For everything you need to know about the most important stories of the day, you're listening to The Daily, distributed by American Public Media.",
        "start": 280.162,
        "end": 304.002
    },
    {
        "text": " Tonight is the first presidential debate of the 2024 general election, and some are bracing themselves. Nobody expects the debate to be a positive, happy experience. 25% of voters say that they're not happy with either of these choices. I'm Ari Shapiro, a debate preview with political strategists from both parties on all things considered from NPR News.",
        "start": 306.22,
        "end": 326.425
    },
    {
        "text": " All Things Considered starts at 3.30 here on KAWC Yuma, KAWP Parker, 88.9 FM and kawc.org.",
        "start": 334.377,
        "end": 343.524
    },
    {
        "text": " I use KAWC almost on a daily basis in my car. It's the background for chores around my house. And I go to the website and look for stories that are of interest and I listen to podcasts. I look to the news on NPR because I'm looking for something beyond the headline or a soundbite or a gotcha moment.",
        "start": 344.48,
        "end": 364.394
    },
    {
        "text": " I really want news that shows me sort of the multiple dimensions of a story that seeks information from multiple sources and doesn't tell me how to think. It just presents the issues. And I really appreciate that. Being a sustaining member of a service like KAWC takes the mystery out of it for me. So I know that I am supporting every month.",
        "start": 364.394,
        "end": 385.469
    },
    {
        "text": " I also know that I don't have to remember to sit down and write a check at the end of the year or a budget for a check at the end of the year, right? It's kind of coming out of my account every month, and that makes me feel a little bit like I'm part of the team. I'm Laurie Stoff from Arizona Western College, and I'm a proud supporter of KAWC Yuma. Mike Schmidt on a new doping scandal rocking the world of Olympic swimming.",
        "start": 385.469,
        "end": 414.565
    },
    {
        "text": " Mike, let's talk about that larger system that failed to expose these positive tests by Chinese swimmers that kept these tests hidden. It sounds like one potential issue is that the system relies on self-policing. But there are these perverse incentives, right, for many countries to not actually root out doping when they find it because...",
        "start": 415.452,
        "end": 438.456
    },
    {
        "text": " I mean, number one, they want to win medals, and number two, they don't want to damage the reputation of their athletes. Why does the system work this way? One of the reasons that it was set up this way is that it was just too logistically hard to have the World Anti-Doping Agency, also known as WADA, trying to track thousands and thousands of Olympic athletes around the world.",
        "start": 438.456,
        "end": 464.326
    },
    {
        "text": " They needed the countries to be able to administer the testing and to prosecute the cases. And WADA was supposed to make sure that those countries were doing their job, that they were holding their athletes accountable, and they had the power to step in",
        "start": 464.326,
        "end": 483.626
    },
    {
        "text": " And in those cases in which they said, hey, this doesn't look right, more needs to be done, they could come in and prosecute the cases. But what happens here is that when WADA finds out about this and they get this explanation from the Chinese, they essentially take it at face value. But when WADA's credibility comes into question, the whole system comes into question.",
        "start": 483.626,
        "end": 510.538
    },
    {
        "text": " And that's the point that Phelps and Schmidt were making when they were sitting before Congress under oath. They were saying, is this thing legit or is it a charade? Mike, it feels like a lot of this comes down to why did WADA just accept China's explanation for the doping, which, as you've said, seemed a little suspect, right?",
        "start": 511.34,
        "end": 537.176
    },
    {
        "text": " WADA says that it accepted the Chinese argument basically because all of the athletes had similarly low levels of this drug in their system. The science looked like it had come from ingestion.",
        "start": 537.534,
        "end": 553.2
    },
    {
        "text": " all of the swimmers who tested positive were staying at the same hotel. Swimmers who had not been staying at the hotel did not test positive. And that it was just simply too hard to disprove what the Chinese were putting forward. And that if they tried to prosecute the case themselves, they wouldn't have been successful and they wouldn't have been able to stop them from competing at the Olympics.",
        "start": 554.087,
        "end": 582.619
    },
    {
        "text": " But a lot of people don't buy it. They don't buy that that was enough to not do anything. And look, we don't know the answer. We don't have full visibility into what went down here. WADA has appointed a investigator to look into this to see whether they gave China preferential treatment and whether this was handled properly. That report is supposed to come out before the Olympics.",
        "start": 582.619,
        "end": 611.186
    },
    {
        "text": " But in the void, as people have looked at this, they have speculated about why is it that this happened.",
        "start": 612.073,
        "end": 621.971
    },
    {
        "text": " And one of the theories put forward, a sort of dark one, has been WADA didn't want to embarrass China, especially at a time when China was moving heaven and earth to do the Olympic movement of solid by holding the 2022 Winter Olympics in Beijing, games that they were trying to pull off at the height of a pandemic in a country that was shut down.",
        "start": 622.551,
        "end": 651.391
    },
    {
        "text": " And other theories have been that the Olympic movement doesn't really want to go out and tarnish their own sports and put out there the notion that these games may not be being played on a level playing field. But Mike, doesn't it tarnish the sport more to find evidence of doping and not report it?",
        "start": 651.391,
        "end": 672.142
    },
    {
        "text": " Not if you're able to keep it secret. Because if, in the lead up to an Olympics, you had to suspend half of a country's swimming team so they couldn't compete, that would cast a really dark cloud over the games.",
        "start": 672.568,
        "end": 689.462
    },
    {
        "text": " And at the end of the day, there's an enormous amount of money on the line here. And do you want to tarnish that product? Do you want to undermine it in the eyes of fans and raise the question, oh, gosh, is this really a level playing field?",
        "start": 689.462,
        "end": 708.558
    },
    {
        "text": " And the only reason we know about this case is because of your reporting, which makes me wonder whether you think there may be other examples of this that we haven't yet heard about. Look, I don't know what I don't know. But the problem is, is that when you learn about things like this, it calls everything else into question.",
        "start": 708.916,
        "end": 730.879
    },
    {
        "text": " After all your reporting, Mike, I have to ask if you actually think that we can trust what we see in the Olympics next month, that we're going to be watching the best athletes from all over the world who've trained for years for this put their bodies to the test and achieve these miraculous feats based not on drugs, but on their merit.",
        "start": 731.596,
        "end": 755.896
    },
    {
        "text": " Well, we know that 11 of the Chinese swimmers who tested positive for TMZ will be going to this Olympics in Paris to compete. They have faced no consequence and will be in the water swimming against American swimmers who have been subject to this rigorous drug testing program.",
        "start": 756.135,
        "end": 782.381
    },
    {
        "text": " But I've wondered about this question too, right? What should we think when we tune into the Olympics? Should we look at it and sort of just kind of let it go and enjoy it for what it is? Or should we look at it more skeptically? I don't really know the answer. So what I did was I went to the chief broadcaster of the Olympics, NBC, and",
        "start": 782.705,
        "end": 810.026
    },
    {
        "text": " And I asked them essentially that same question. Are you confident that you'll be broadcasting an Olympics in which the athletes will be competing on a level playing field? And NBC acknowledged receiving the email, and they never got back to me.",
        "start": 810.538,
        "end": 830.213
    },
    {
        "text": " And in all of this, it was a bit telling that the chief broadcaster of the Olympics couldn't answer the basic question about whether fans could trust what they're going to be seeing. Mike, thank you so much. Thanks for having me. Mike Schmidt is an investigative reporter for The New York Times.",
        "start": 831.715,
        "end": 859.838
    },
    {
        "text": " The Daily is supported by The Wall Street Journal. From the boardroom table to what's on the kitchen table, it's your business. And by Total Wine & More, helping shoppers love what they find. At TotalWine.com. Spirits not sold in Virginia or North Carolina, drink responsibly, be 21.",
        "start": 866.442,
        "end": 886.51
    },
    {
        "text": " Rigorous reporting told through a human lens. Go deeper into the most important stories of the day with The Daily, an audio series from The New York Times. The Daily is powered by the journalism of The New York Times and is distributed by APM, American Public Media. You can go deeper into the stories you hear on The Daily at nytimes.com slash the daily.",
        "start": 887.346,
        "end": 913.319
    },
    {
        "text": " That's it for The Daily. I'm Natalie Kitrow. See you tomorrow. This is KAWC Yuma, KAWP Parker, 88.9 FM and kawc.org. All Things Considered begins next. It's 3.30.",
        "start": 919.65,
        "end": 936.357
    },
    {
        "text": " It's all things considered from NPR News. I'm Ari Shapiro. And I'm Scott Detrow. Kevin Costner's new Western tries to tell a big sweeping story about America. To get it made, he took a page from the script of Westerns and bet a whole lot of money on himself. I'm taking a financial risk, you know, but I believe in the audience I'm making this for. I know that I'll die trying to make this. First News.",
        "start": 945.145,
        "end": 965.282
    },
    {
        "text": " Live from NPR News in Culver City, California, I'm Dwayne Brown. The Supreme Court has put on hold a Biden administration policy aimed at reducing air pollution. NPR's Alejandra Burunda reports the EPA rule called the Good Neighbor Plan called for limiting air pollution that crossed state lines.",
        "start": 967.5,
        "end": 986.391
    },
    {
        "text": " Air pollution doesn't stay where it's made. Wind and weather can carry it hundreds of miles. So when coal-burning power plants in states like Ohio spit out pollutants that generate long-damaging ozone, the bad air can hurt people downwind in Pennsylvania or New York.",
        "start": 986.63,
        "end": 1001.903
    },
    {
        "text": " The Environmental Protection Agency created the Good Neighbor Rule to address that cross-state problem. Twenty-three states would have to clean up their power sources and industrial activities. Three, Ohio, West Virginia, and Indiana, filed a lawsuit objecting. They said the plan overrode the states' own pollution initiatives and would be too expensive. The rule is now on hold while lower courts reconsider it. The Supreme Court has weakened or rolled back many environmental rules in recent years. Alejandra Burunda, NPR News.",
        "start": 1002.193,
        "end": 1031.527
    },
    {
        "text": " Well, a new class action lawsuit has been filed against the Tennessee Department of Children's Services. That suit claims the agency failed to protect children in the juvenile justice system from physical and mental harm. From Member Station WPLN, Paige Flager reports.",
        "start": 1032.21,
        "end": 1047.415
    },
    {
        "text": " The lawsuit alleges one child was kept in solitary confinement until he ripped his hair out. Another was shackled, then pepper sprayed by staff for being disrespectful. Families filing suit also claim that Tennessee's juvenile justice system punishes kids with disabilities instead of supporting them, and that children's services knew about the issues but failed to intervene. DCS forwarded a request for comment to the state attorney general's office. The AG will only say it's aware of the lawsuit.",
        "start": 1047.415,
        "end": 1076.698
    },
    {
        "text": " For NPR News, I'm Paige Flager in Nashville. Stocks finished modestly higher on Wall Street today. The Dow gained 36 points, up slightly. This is NPR.",
        "start": 1076.698,
        "end": 1086.135
    },
    {
        "text": " The head of the Social Security Administration is calling for an overhaul of a program that provides benefits to several million disabled and elderly people with little income. NPR's Joseph Shapiro reports. An NPR investigation of Supplemental Security Income, or SSI, found the anti-poverty program is troubled by complex and out-of-date rules. Martin O'Malley, the commissioner of the Social Security Administration, agrees that the program needs to be modernized.",
        "start": 1088.029,
        "end": 1117.705
    },
    {
        "text": " The program should be simplified. Congress needs to do an overhaul of this program. Changes such as raising asset limits that haven't increased since 1989 or limits on how much one can earn from a job which hasn't changed since the program started 50 years ago. O'Malley says there are also things the agency can do, like letting people apply for SSI online with a simplified application form, not the one now that's dozens of pages long. Joseph Shapiro.",
        "start": 1117.705,
        "end": 1147.381
    },
    {
        "text": " NPR News. The New York City public school system is planning a major policy shift to ban cell phone use during the school day. Officials plan to announce the rule change early next month. This follows a similar announcement by the Los Angeles Unified School District this month. It also comes as the Biden administration warns about the long-term impact social media poses to children's mental health. I'm Dwayne Brown. This is NPR News.",
        "start": 1147.381,
        "end": 1175.401
    },
    {
        "text": " Hi, I'm Chris McDaniel. Later this hour, Yuma County voting machines have been tested for accuracy. Find out more coming up. KAWC and Border Radio are supported by the Hills Gastropub by Chef Eddie Guzman. With a menu ranging from specialty salads to classic entrees and featuring New Orleans-inspired dishes, the Hills strives to satisfy any craving. Crafted cocktails await in a bar enhanced for all to sip, savor, and socialize. More at thehillsgastropub.com.",
        "start": 1177.892,
        "end": 1207.039
    },
    {
        "text": " The Tedeschi Trucks Band brings Roots Rock on tour with shots of rhythm and blues, gospel, and soul. We'll talk to Susan Tedeschi and Derek Trucks about their roadmap in life and music. Also remembering piano man Fats Domino, who brought New Orleans-accented R&B into rock and roll. I'm Nick Spitzer. Join me for American Roots from PRX. Sunday afternoon from noon to 2 on 88.9 FM KWC.",
        "start": 1208.558,
        "end": 1235.759
    },
    {
        "text": " Support for NPR comes from NPR member stations and from Cancer Treatment Centers of America, where each patient has a dedicated care manager to help coordinate every aspect of care, from scheduling appointments to transferring medical records and arranging transportation and accommodations, at cancercenter.com. From EBSCO, working in partnership with open source library technologies and open access journals to support libraries and their users. Learn more at ebsco.com.",
        "start": 1237.056,
        "end": 1265.845
    },
    {
        "text": " And from the National Endowment for the Arts, art works. It's All Things Considered from NPR News. I'm Scott Detrow. And I'm Ari Shapiro. The Environmental Protection Agency's Good Neighbor Plan is designed to protect downwind states from air pollution blowing across state lines. It's a friendly enough name, but a group of states, companies, and trade associations does not find the Good Neighbor Plan friendly.",
        "start": 1266.408,
        "end": 1290.708
    },
    {
        "text": " So they sued, and in a 5-4 vote today, the Supreme Court sided with them and put the plan on hold while litigation continues in lower courts. To talk more about the decision, we're joined by Jonathan Adler. He's the founding director of the Coleman P. Burke Center for Environmental Law at Case Western Reserve University. Good to have you back. Good to be here. What's your top line reading of this opinion?",
        "start": 1290.708,
        "end": 1311.288
    },
    {
        "text": " Well, the court is holding the EPA to a fairly stringent rule about responding to comments in the rulemaking process. And I think this is one of several decisions we've seen over the last 10 years where the court is concerned.",
        "start": 1312.585,
        "end": 1327.773
    },
    {
        "text": " that if companies have to begin complying with environmental regulations while judicial review is still going on, they may make investments that the EPA could not have properly required them to make. And we saw that happen with some prior rules, and I think that's in the background of this decision as well.",
        "start": 1327.773,
        "end": 1346.288
    },
    {
        "text": " The plan was established to ensure that states complied with a 2015 air quality law, and the states that filed suit say the EPA failed to adequately consider the legal and practical implications of substituting its plan for the states' plans. Is this a familiar states' rights argument that we've heard in many other contexts, or are they getting at something more specific to air pollution here?",
        "start": 1346.34,
        "end": 1367.346
    },
    {
        "text": " Well, the state's arguments that they made included some traditional appeals to states' rights concerns. But the decision the court gave was very narrowly focused on the procedure the EPA goes through, and in particular, a requirement that's usually dealt with in lower courts.",
        "start": 1368.524,
        "end": 1386.169
    },
    {
        "text": " that agencies adequately respond to all the significant comments made during the rulemaking process. And the majority was convinced that the EPA did not adequately respond to questions about what to do if the number of states that were supposed to participate in the Good Neighbor program was reduced because in various other cases,",
        "start": 1386.169,
        "end": 1410.009
    },
    {
        "text": " some of the states were at least temporarily removed from the program. And the complaining states said this arguably changes how much of an emission reduction effort different states or different companies have to make. EPA, you didn't adequately tell us how you were going to figure out how the program changes if some states drop out.",
        "start": 1410.009,
        "end": 1431.288
    },
    {
        "text": " And five of the justices found that convincing. Given how conservative and forward-leaning this court has tended to be, does it strike you as a rather restrained ruling? I mean, they didn't give the EPA a win, but they didn't give them as much of a loss as they might have, right?",
        "start": 1431.288,
        "end": 1445.862
    },
    {
        "text": " Well, yes and no. I mean, the legal holding of the opinion is very narrow. But what was very aggressive about this case is that the court didn't wait for the challenges on these arguments in the lower courts to proceed. Rather, this case came to the court on an emergency motion for a stay to stop the rule in its tracks while litigation was ongoing. And that was quite an aggressive move, even though the ultimate decision was narrow.",
        "start": 1446.749,
        "end": 1474.753
    },
    {
        "text": " And just in our last 30 seconds, do you think this implies something larger about the issue of rulemaking, which is before the court in a couple of cases? Well, I mean, I do think it shows that a majority of the court is skeptical of federal regulatory agencies and is concerned that when cases finally get to the Supreme Court, it might be too late, and that in this case, it justified the court intervening early. That's Jonathan Adler, law professor at Case Western Reserve University. Thank you.",
        "start": 1474.753,
        "end": 1504.514
    },
    {
        "text": " My pleasure. Thank you. People in New Mexico are reeling from multiple disasters. A deadly wildfire remains uncontained in the south, while up north mudslides have created a drinking water crisis in another city. It's been climate whiplash, fire, then a lot of rain, then debris flows and dangerous flooding, with more heavy rain on the way. And PR's Kirk Siegler joins us from New Mexico to tell us more. Hey, Kirk. Hey, Scott. So first, what's the latest on the wildfire?",
        "start": 1506.203,
        "end": 1533.251
    },
    {
        "text": " Well, it's actually two wildfires side by side and one nearly consumed the village of Ridoso. It's a big tourist area in the mountains of southern New Mexico. As of today, crews are reporting they're getting close to three-quarters containment on the fire, and it's really not burning anymore due to all the rain, as you said, that's been hitting here. So they're kind of just in the interior mopping up hot spots. There's also a lot of pressure to reopen the village because this is the height of the tourist season. Particularly, you have a lot of Texans coming over here to escape the heat.",
        "start": 1533.251,
        "end": 1562.756
    },
    {
        "text": " That's not an easy thing to do. You know, some 1,300 homes burned. There have been power outages. You've had whole neighborhoods destroyed. And those rains wreaked more havoc, causing flooding and mudslides. And there are still flash flood watches in effect, last I checked. And there's other flooding elsewhere in New Mexico. Tell us about that.",
        "start": 1562.756,
        "end": 1580.026
    },
    {
        "text": " Yeah, so I'm actually in Las Vegas, New Mexico. It's a couple hundred miles to the north of Rio Doso. About 13,000 people live here and this city is perilously close to running out of water. Downpours triggered mudslides of toxic debris running off a two-year-old wildfire burn scar, Scott, and",
        "start": 1580.691,
        "end": 1598.046
    },
    {
        "text": " into the town's water supply. They're saying there may not be drinking water in another day or so, so all businesses except grocery stores and a couple gas stations have been ordered to close, and there are long lines at water and sandbag distribution sites. To my left, I can see a long line of dozens of idling cars. Looks like they just started moving. People are worried about flooding knocking out their homes. I talked to Marcela Sanchez. She'd been waiting for more than an hour for sandbags to protect her home. Let's listen to her.",
        "start": 1598.046,
        "end": 1627.159
    },
    {
        "text": " We have a high wall, but good thing in certain areas. But the other land by the arroyo, the ditch, the neighbors, all their stuff came and I don't know what's involved because he collects junk. Scott, there's so much demand in New Mexico right now that people here are only getting 20 sandbags a day, which really doesn't do that much. And Sanchez told me it's a fiasco here. So what's being done to help?",
        "start": 1627.159,
        "end": 1651.067
    },
    {
        "text": " Well, there are now disaster declarations in multiple counties in northern and southern New Mexico, so that's big. FEMA is now on the ground in Redoso, where that big fire is still not out, of course. And the agency is starting to send more water here to Las Vegas, the National Guard.",
        "start": 1651.92,
        "end": 1667.261
    },
    {
        "text": " The National Guard just told me that they're open for eight hours today and they're not turning anyone away like in previous days when they were relying on donated water now that FEMA has arrived. And, you know, there's a lot of pressure on the feds to help get that water treatment plant here fully operational. But I have to say, Scott, you know, there's not a lot of faith in FEMA here. This is the site of that wildfire two years ago. It was the largest in New Mexico history. And despite a federal law being passed that",
        "start": 1667.261,
        "end": 1694.616
    },
    {
        "text": " guarantees FEMA aid. A lot of survivors here in town that I've been talking to say they haven't really seen much, if any, and some have just totally given up on the federal government. Yeah, yeah. Looking forward, what's the weather outlook? Could it help or hurt?",
        "start": 1694.616,
        "end": 1709.377
    },
    {
        "text": " probably hurt. It's a matter of whether or not they're going to be prepared in time. The National Weather Service has issued flash flood watches here in Las Vegas and down in southern New Mexico until midnight tonight. The National Guard just told me they're expecting more storms this weekend. So, you know, it really just depends where the storms hit and how much rain falls. But I can tell you it's a very stressful situation still here and in Las Vegas anyway. All of the 4th of July festivities have been canceled. So that's a pretty big bummer in town.",
        "start": 1709.65,
        "end": 1736.101
    },
    {
        "text": " That's NPR's Kirk Siegler in Las Vegas, New Mexico. Thanks so much. You're welcome.",
        "start": 1736.34,
        "end": 1740.896
    },
    {
        "text": " You're listening to All Things Considered from NPR News. For KAWC News, I am Chris McDaniel. Arizona State Election Director Lisa Mara, along with a delegation from the Office of the Secretary of State, were at the Yuma County Recorder's office Thursday morning to test the voting machines in advance of upcoming elections. Their testing showed the machines are 100% accurate. I spoke to Mara after the testing had concluded.",
        "start": 1772.688,
        "end": 1800.009
    },
    {
        "text": " So today we conducted what's called the logic and accuracy test, the LNA test for counties. Anytime there is a federal or state election, the Secretary of State's office is responsible for going to each county and taking a random selection of precincts, a random number of ballots. We have to make sure every candidate gets votes, gets overvotes, undervotes, blank ballots. Every congressional district is tested. Every legislative district is tested.",
        "start": 1800.794,
        "end": 1825.503
    },
    {
        "text": " And the county has no idea how many ballots we bring or what those results are. You observed us randomly picking machines, testing all the accessible voting devices, and then comparing the results. And the results were spot on, 100% match, 528 ballots. So Yuma County passed with a perfect score? Yuma County passed with a perfect score.",
        "start": 1825.503,
        "end": 1845.077
    }
]