[
    {
        "text": " The logic and accuracy test, the LNA test for counties. Anytime there is a federal or state election, the Secretary of State's office is responsible for going to each county and taking a random selection of precincts, a random number of ballots. We have to make sure every candidate gets votes, gets overvotes, undervotes, blank ballots. Every congressional district is tested, every legislative district is tested.",
        "start": 0.009,
        "end": 22.995
    },
    {
        "text": " And the county has no idea how many ballots we bring or what those results are. You observed us randomly picking machines, testing all the accessible voting devices, and then comparing the results. And the results were spot on, 100% match, 528 ballots. So Yuba County passed with a perfect score.",
        "start": 22.995,
        "end": 39.957
    },
    {
        "text": " Yuma County passed with a perfect score. Yuma County has amazing election officials, and we're very lucky that we have them. They're good partners. So you guys are all over the state today. How many are you going to go to each county and do the same thing? So we can't go to each county every day, the same day, but we do three counties a day. So today, after we leave here, this was our first test today. We go to La Paz, and then we go to Mojave.",
        "start": 39.957,
        "end": 59.94
    },
    {
        "text": " And then we have two counties tomorrow and one county next week, and then we're done. So we started out Monday morning testing the counties three a day. And counties can't start early voting using machines until they have a successful LNA. So Yuma County is good to go. Why is it important to ensure accuracy and security in advance of the upcoming elections?",
        "start": 59.94,
        "end": 79.275
    },
    {
        "text": " It's critical. It's paramount. We've got to have confidence in our elections. We've got to have confidence in our election officials. And when you consider that our team at the Secretary of State's office marks, hand marks, mind you, they're not machine printed, hand marks ballots with a random generated script so we know what those results are. And they hand mark 12,000 to 15,000 ballots, take them across the state to counties, and they're 100 percent match in every county. And if they're not 100 percent match, we have to go back and figure why not.",
        "start": 79.275,
        "end": 105.862
    },
    {
        "text": " And usually it's human error on our staff's part from mismarking a ballot. So we can identify that quickly, fix that, and then make sure we've got a count. Because every vote matters. If you're one off, you're one off and you've got to find out why. So it's incredibly important to the security and accuracy of elections. And you said earlier a lot of times it's just human error. So you guys are looking for human error and the machines are working today. So how does that work?",
        "start": 105.862,
        "end": 129.087
    },
    {
        "text": " You know, before we came here, they've tested thousands of ballots when they got their program. So they've checked the audio, because it's not just the printed ballot, right? It's the audio, it's making sure that the accessible voting devices work, and that if I have a vision impairment or a physical disability, I'm still able to vote in person on Election Day if that's how I choose to vote. So all those things have been tested, and I can't be prouder of all the counties, especially Yuma.",
        "start": 129.087,
        "end": 154.36
    },
    {
        "text": " The Fontes office, you guys are ready for this busy season coming up? We are. We're busy all the time, but right now the counties are really the busy ones. So we've got the L&A testing under the belt almost. So for us, our part is done because the Secretary of State's office, we don't conduct elections. Counties do. We don't register voters. Counties do that. But the next thing that's facing our office is ballot measure filing.",
        "start": 154.36,
        "end": 176.766
    },
    {
        "text": " Because the deadline for ballot measure filing is July 3rd, same day as early voting starting, so it's going to be very busy. And we've anticipated four filings, and if all four of those come through with estimated signatures that we're thinking about, that's roughly 2.1 million lines of signatures.",
        "start": 176.766,
        "end": 192.773
    },
    {
        "text": " that our office reviews, and then sends a 5% sampling to counties. So keep in mind how busy counties are going to be because they're during early voting most of the month of July, and then they'll be doing those random checks of samples of those voters for the ballot measure. So it's going to be very busy times in elections. And the government's at work. Government's at work. I'm Chris McDaniel.",
        "start": 192.773,
        "end": 213.353
    },
    {
        "text": " KAWC and Border Radio are supported by Solari Crisis and Human Services, providing confidential text-initiated support for any situation 24 hours a day. Specialists provide a human connection for trauma, emotional stress, and crisis situations. Help is available by texting HOPE to 4HOPE, H-O-P-E to 44673.",
        "start": 215.043,
        "end": 234.855
    },
    {
        "text": " NPR headlines are about 10 minutes away. You're tuned to NPR's All Things Considered on KAWC Yuma, KAWP Parker, 88.9 FM, and KAWC.org. You can also hear us on the KAWC app. Just search your app store for KAWC Radio. It's 348.",
        "start": 235.759,
        "end": 254.514
    },
    {
        "text": " This week on This American Life, Bowen thinks a huge part of who he is can be traced back to a moment before he was even born, when his dad met this guy named Dave at the Oklahoma City airport. So, one day, Bowen calls Dave. I would just urge you that if you do write this that's honoring to your mom and dad, you don't want the devil jumping on them. The devil he knows, and the devil he doesn't, this week.",
        "start": 255.009,
        "end": 281.374
    },
    {
        "text": " This American Life, Saturday at 4 p.m. and Sunday at 7 p.m. on KAWC, 88.9 FM and kawc.org. Another sunny, hot, but breezy day here in southwest Arizona. We're expecting winds gusting up to 25 miles per hour today and tonight for both Yuma and Parker. Yuma's high today should be about 110 with an overnight low around 85. Parker's high today should be about 111 with an overnight low around 84.",
        "start": 285.981,
        "end": 315.026
    },
    {
        "text": " KAWC and Border Radio are sponsors of the Lutz Summer Jazz Series, featuring live performances on selected Fridays through August from 7 to 9 at Lutz Casino. Along with Lutz food, drink, and atmosphere, the events will feature Yuma Jazz Company and guest performers. Schedule and performers under Lutz at YumaJazz.com.",
        "start": 315.538,
        "end": 334.735
    },
    {
        "text": " This is All Things Considered from NPR News. I'm Ari Shapiro. And I'm Scott Detrow. For decades, Kevin Costner and Westerns have gone together. Big sweeping critical wins like Dances with Wolves. Actually, sir, I'm here at my own request. Really? Why? I've always wanted to see the frontier. Do you want to see the frontier? Yes, sir.",
        "start": 334.735,
        "end": 358.933
    },
    {
        "text": " Before it's gone. Big sweeping critical flops like Wyatt Earp. My name is Wyatt Earp. It all ends now. And more recently, the mega hit Paramount Network show Yellowstone. We're ranching so hard. How can we do it? Because it's one hell of a live tape.",
        "start": 359.838,
        "end": 381.596
    },
    {
        "text": " which Costner recently confirmed he's leaving after five seasons. Through all those years, Costner was thinking about one more big, sweeping project, one he's been writing and rewriting and trying to get made for decades. The initial idea was in 1988. There was already a town. It was called Sidewinder.",
        "start": 384.343,
        "end": 404.514
    },
    {
        "text": " And it was a pretty good screenplay. Ultimately, I wasn't able to make it, but I didn't really fall out of love with the idea. And now he's brought that idea to fruition. And it's not about a person. It's about a town. Why do all the Westerns have a town and we don't know how it came to be?",
        "start": 404.701,
        "end": 423.183
    },
    {
        "text": " Horizon, an American saga, attempts to tell that story. Costner stars in the film, which he also co-wrote, produced, and directed. And similar to some of his past projects, he has put a lot of his own money into Horizon, which he intends to release in four parts. I'm taking a financial risk, you know, but I believe in the audience I'm making this for. I know that I'll die trying to make this.",
        "start": 423.183,
        "end": 446.015
    },
    {
        "text": " And that risk is where we started the conversation. I asked Kevin Costner about the reports. He's personally put $38 million into the film.",
        "start": 446.015,
        "end": 454.241
    },
    {
        "text": " It's more than that now. It's interesting how a number, you know, it's just grown. I will just tell you that personally. It's much more than that. This was a factor for you walking away from Yellowstone. I guess the question... It was not a factor walking away from Yellowstone. It just simply wasn't. There's a mythology there. I made Yellowstone a priority. I worked in between the dates that Yellowstone was scheduled to work. When that work was...",
        "start": 454.292,
        "end": 483.916
    },
    {
        "text": " that schedule was done, I had already prepared the ground to make Horizon. So I didn't make Horizon on the backs of Yellowstone. So we have myths about the West and I guess myths about Western movies being made at the same time, we're finding. I would say that that's correct.",
        "start": 483.916,
        "end": 504.838
    },
    {
        "text": " We've already touched on mythology and the way that the story changes or flattens or gets exaggerated over time and how much of a central theme that is for the idea of America and the West. And I feel like in Hollywood, outside of Hollywood, there's been pushes in different corners to kind of reconsider those myths in recent years. Have you thought about that? Has that changed the way you tell these stories at all?",
        "start": 505.213,
        "end": 526.237
    },
    {
        "text": " I just tell a story where I embrace the idea of human behavior. I embrace the realities of why people came, the people that were here. There's enough stories that tell me that my story happened thousands of times in this conflict. What I try to do is invest in behavior and create the architecture of a novel almost.",
        "start": 526.766,
        "end": 552.722
    },
    {
        "text": " I was thinking about the attack at the end of the movie as a symmetry to the attack at the beginning of the movie and the different perspective. Sometimes the great cities were formed in these river crossings, and we don't know the beginnings. And so my investment in story is simply reality mixed with behavior, mixed with deciding to tell multiple stories. And that's just my style. Mm-hmm.",
        "start": 552.892,
        "end": 582.312
    },
    {
        "text": " At many different points, though, you've made a point to put a three-dimensional Native American point of view into the story.",
        "start": 582.312,
        "end": 587.773
    },
    {
        "text": " I think it doesn't work if they don't come off as people themselves. By the time the settlers were really coming in, the tribes were torn apart politically. It was gross what was happening. Our intentions were not honest. They weren't fair. It doesn't negate that people came with hope.",
        "start": 588.729,
        "end": 614.428
    },
    {
        "text": " and a resourceful attitude to build a new community. They just had no concept of who they were displacing. And there was the Native Americans found themselves an inconvenience in their own country.",
        "start": 614.428,
        "end": 631.049
    },
    {
        "text": " I took the opportunity here prepping for this interview to rewatch a lot of your movies, and I was thinking about some big through lines through a lot of them. You suddenly dropped volume for some reason. That's because I was complimenting you. Maybe it just dropped out. I don't know if you want... You just wanted to whisper that so I didn't get a big head? Okay. I was saying I use this to do the hardship assignment of rewatching a lot of your movies over the last couple of weeks.",
        "start": 631.903,
        "end": 659.002
    },
    {
        "text": " I apologize. You know, they hold up pretty well. A lot of them keep coming back to these big themes about America. Danny Houston's character in Horizon has this big speech early on that gets to these ideas of America. These people have been pushing the same wheel back home around and around until they can't bear another turn on it. That's the path they inherit. If they try to change it at all, they have to do it by inches.",
        "start": 659.206,
        "end": 687.944
    },
    {
        "text": " You may recall that's what drove us across the ocean to this country in the first place. You and I are standing guard in one of the last great open spaces, Trent. There's no army of this earth that's going to stop those wagons coming.",
        "start": 689.531,
        "end": 706.271
    },
    {
        "text": " So Houston's character is conceding there that the push west is inevitable. But given that, do you think that if you were living in this period, you would have gone west? Because that's something we were talking about watching this movie. Like, look at all the different ways you can get yourself killed. Look at all the ways that this was so incredibly hard.",
        "start": 706.476,
        "end": 724.77
    },
    {
        "text": " Do you think that's something you would have done? I would have been probably more of a mountain man. I love the idea of seeing things and telling people about them and then continuing on. Myself, when I saw How the West Was Won, I was seven years old and the first image of Jimmy Stewart in a birch bark canoe headed across a lake that didn't have a ripple",
        "start": 724.77,
        "end": 751.101
    },
    {
        "text": " backed up by the Sierra Mountains to see a group of people standing on the beach. I was moved, so moved that I, born in the inner city in a place called Compton, California, I built three canoes before I was 18 years old and ultimately went down several of the rivers that Lewis and Clark had gone down.",
        "start": 751.101,
        "end": 774.172
    },
    {
        "text": " just because it ignited me, that imagery. So trading with people where I didn't share the same language, meeting them on their ground, that I could see myself doing that. Kevin Costner, the writer, director, and star of Horizon, an American saga. Thanks for talking to us. You're welcome. The film's first chapter is out tomorrow.",
        "start": 774.172,
        "end": 804.07
    },
    {
        "text": " This is NPR News. Support for NPR comes from NPR member stations and from Honda, maker of the restyled 2017 Accord Hybrid with 212 horsepower and a 49 mile per gallon EPA city rating. Available now. Learn more at accord.honda.com.",
        "start": 816.101,
        "end": 841.203
    },
    {
        "text": " From the Candida Fund, dedicated to advancing the dignity of individuals and the sustainability of communities across the U.S. and around the globe through investments in transformative leaders and ideas. Learn more at candidafund.org.",
        "start": 841.203,
        "end": 856.63
    },
    {
        "text": " and from the financial services firm of Raymond James, offering personalized wealth management advice and banking and capital markets expertise, all with a commitment to putting clients' financial well-being first.",
        "start": 857.807,
        "end": 872.227
    },
    {
        "text": " KAWC and Border Radio are sponsors of New Orleans Jazz Vibes at the Hills every Saturday through July from 6 to 9 at the Hills Gastropub. The menu features NOLA-inspired items like gumbo and beignets, and the New Orleans Gator Stompers will perform traditional and modern tunes. Details under the hills at YumaJazz.com. This is 88.9 FM, KAWC Yuma, KAWP Parker, KAWC.org, and now on the KAWC app.",
        "start": 874.804,
        "end": 904.343
    },
    {
        "text": " a service of Arizona Western College for more than 50 years, trusted news for Yuma and La Paz counties. It's 4 o'clock. Another hour of All Things Considered is next. The Freedom Library at 2035 Arizona Avenue will host its Public Independence Day celebration on July 4th at 930. Cake, ice cream, snacks, and water will be provided, and there will be a history and reading of the Declaration of Independence. Learn more about this event and the library at freedomlibrary.org.",
        "start": 904.787,
        "end": 933.49
    },
    {
        "text": " The court doesn't touch Congress's ability to allow agency adjudication for public benefits and pensions and patents. Near the end of the term, the Supreme Court issued a flurry of consequential rulings. We'll tell you all about them this Thursday, June 27th on All Things Considered from NPR News.",
        "start": 935.657,
        "end": 951.937
    },
    {
        "text": " I'm Ari Shapiro. And I'm Scott Detrow. This hour, another black eye for Boeing after an exec said this to reporters. The fact that one employee could not fill out one piece of paperwork in this condition and could result in an accident was shocking to all of us. Also, a rare white bison has been born in Yellowstone National Park. Many Native Americans view it as both a blessing and a warning. Mother Earth, Ujimaka, is going to be sick and has a fever.",
        "start": 958.473,
        "end": 985.247
    },
    {
        "text": " Plus, our intrepid correspondent braves one of the biggest music festivals in the world. We're reporting from Glastonbury after the news.",
        "start": 985.247,
        "end": 992.517
    },
    {
        "text": " Live from NPR News in Washington, I'm Jack Spear. The first debate of the 2024 election gets underway in Atlanta tonight with President Biden and former President Donald Trump meeting on stage for the first time in four years. As NPR's Windsor Johnston reports, the highly anticipated matchup comes less than five months before voters head to the polls.",
        "start": 995.009,
        "end": 1017.295
    },
    {
        "text": " The stakes are high for both candidates as they make the case for a second term in office. Justin Crow is a political science professor at Williams College. Like he did at the State of the Union, I think you're going to see Biden come out energetically to try to dispel the notion that he is too old for this.",
        "start": 1017.295,
        "end": 1035.282
    },
    {
        "text": " On the Trump side, while the age concerns are there, I think most people's concerns about Trump are about coherence and competence and whether this is an agent of chaos.",
        "start": 1035.282,
        "end": 1047.739
    },
    {
        "text": " The candidates will have the opportunity to lay out their plans to address some of the most pressing issues for voters, including abortion rights, inflation, and immigration. Windsor Johnston, NPR News. OxyContin maker Purdue Pharma says it is disappointed by a Supreme Court ruling rejecting a nationwide settlement that would have provided billions to combat the epidemic while shielding the wealthy family members who own the company.",
        "start": 1047.841,
        "end": 1073.985
    },
    {
        "text": " Justices today blocked a deal that would have had the Sackler family contribute $6 billion and relinquish ownership of the company. Under the initial agreement, which the court ruled against, Purdue Pharma would have emerged from bankruptcy as a different entity, with its profits used for treatment and prevention. The 5-4 decision weakens the ability of corporations and insiders to use bankruptcy to try to avoid mass litigation.",
        "start": 1073.985,
        "end": 1095.811
    },
    {
        "text": " The Justice Department is bringing charges against nearly 200 people for their roles in health care fraud schemes. The department says the alleged schemes involved some $1.6 billion in losses. More from NPR's Ryan Lucas. Among the 193 defendants charged in the nationwide law enforcement effort were 76 medical professionals, including doctors and nurse practitioners. Here's Attorney General Merrick Garland.",
        "start": 1095.811,
        "end": 1118.626
    },
    {
        "text": " The Justice Department has been clear that we will bring to justice criminals who defraud Americans and steal from taxpayer-funded programs. One of the alleged fraudulent schemes involved over $900 million related to unnecessary amniotic wound grafts. Another involved more than $146 million in fraudulent addiction treatment services.",
        "start": 1118.626,
        "end": 1139.735
    },
    {
        "text": " Garland says with its enforcement actions, the Justice Department aims to protect vulnerable patients and defend programs funded by taxpayer dollars. Ryan Lucas, NPR News, Washington. As electric vehicle maker Rivian looks to begin offering less costly vehicles, including crossovers, a huge investment from German automaker Volkswagen may help that happen. Rivian reportedly lost upwards of $39,000 in every vehicle it sold in the first quarter. An investment of up to $5 billion from BW could help Rivian reduce material costs.",
        "start": 1139.735,
        "end": 1169.002
    },
    {
        "text": " On Wall Street, the Dow was up 36 points. This is NPR.",
        "start": 1169.002,
        "end": 1173.2
    },
    {
        "text": " What's being built is the world's largest liquefied natural gas terminal. It's been given the green light by the Federal Energy Regulatory Commission. It has not yet been approved by the Department of Energy. The massive project, known as CP2, would be built in Cameron Parish, Louisiana. It would be able to export up to 20 million metric tons of LNG per year. It would be connected to a large natural gas pipeline that would transport natural gas from Texas. Environmental groups, meanwhile, have expressed concerns about the project.",
        "start": 1174.923,
        "end": 1203.2
    },
    {
        "text": " Walgreens says it is planning to close more stores, quote, a significant number. The pharmacy chain has already shuttered hundreds of locations in recent months, but is now blaming inflation for further cuts. The financial health of Walgreens has been touch and go for years.",
        "start": 1203.746,
        "end": 1219.053
    },
    {
        "text": " Same with its rivals. CVS, Walgreens and Rite Aid have been closing stores. Rite Aid has filed for bankruptcy. Walgreens has more than 8,700 locations. It's been trying to reorganize its business, at one point trying to become more of a primary care provider. It also faced a multi-billion dollar settlement for its role in the opioid crisis.",
        "start": 1219.053,
        "end": 1237.978
    },
    {
        "text": " Its pharmacy operations have become less and less profitable. It's facing new competition from Amazon. And now Walgreens executives say shoppers are also spending less on snacks and home supplies as prices have gone up. Retail sales at Walgreens dipped 4% in the most recent quarter compared to last year. Alina Seluk, NPR News.",
        "start": 1237.978,
        "end": 1256.852
    },
    {
        "text": " A pair of giant pandas are now winging their way to the U.S., part of an ongoing conservation partnership between the U.S. and China. The latest panda pair destined for the San Diego Zoo. They're named Yunchuan and Senbao. I'm Jack Spear, NPR News, in Washington.",
        "start": 1256.852,
        "end": 1272.722
    },
    {
        "text": " Support for NPR comes from Sony Pictures Classics, presenting Daddio, starring Dakota Johnson and Sean Penn. A woman and a cabbie connect and engage in intimate and mysterious conversations during a taxi ride. Starts Friday, only in theaters. This is NPR. It's 4.06. You're tuned to All Things Considered from NPR on KAWC Yuma, KAWP Parker, 88.9 FM.",
        "start": 1275.128,
        "end": 1303.916
    },
    {
        "text": " The town of Welton is hosting a movie in the park on Friday, July 21st at Butterfield Park, 10234 Dome Street in Welton. They will screen a million miles away based on the true story of Jose Hernandez's journey from farm worker to astronaut. Event opens at 7.30 p.m. with film at 8.30. More details at weltonaz.gov.",
        "start": 1304.701,
        "end": 1323.882
    },
    {
        "text": " It's All Things Considered from NPR News. I'm Scott Detrow. And I'm Ari Shapiro. The U.S. Supreme Court is heading into the final stretch of the term, and the justices issued a raft of new and consequential decisions today on everything from opioids to ozone pollution. NPR legal affairs correspondent Nina Totenberg reports.",
        "start": 1324.667,
        "end": 1342.807
    },
    {
        "text": " In the space of less than a half hour this morning, the High Court invalidated a multi-billion dollar opioid settlement. It put on hold an important EPA rule aimed at reducing ozone pollution. It temporarily allowed emergency abortions in Idaho in cases where the woman's health, but not her life, is in grave jeopardy. And finally, the conservative supermajority continued its march to curtail agency power.",
        "start": 1342.995,
        "end": 1370.077
    },
    {
        "text": " ruling that Congress exceeded its power when it authorized the Securities and Exchange Commission to impose fines on financial wrongdoers. The SEC decision ruled unconstitutional one of the major ways that the agency penalizes those found to have committed fraud,",
        "start": 1370.077,
        "end": 1388.08
    },
    {
        "text": " in the securities industry. Congress specifically strengthened the law in 2010 by authorizing the SEC to use independent administrative law judges to conduct hearings, make factual findings, and to impose fines on those accused of securities fraud. But today, writing for the court's conservative supermajority, Chief Justice John Roberts said that system violates the Seventh Amendment right to a jury trial.",
        "start": 1388.08,
        "end": 1415.555
    },
    {
        "text": " Although he acknowledged that under the current system, the accused do have the right to appeal in federal court, Roberts said that's not the same thing as having the right to be tried by a jury of one's peers in a courtroom supervised by a federal judge.",
        "start": 1415.555,
        "end": 1431.084
    },
    {
        "text": " In a rare oral dissent from the bench, Justice Sonia Sotomayor accused the majority of, quote, judicial aggrandizement and blowing up the so-called public rights doctrine. Under that doctrine, she observed, the court has for more than a century permitted agencies, when authorized by Congress, to penalize with monetary penalties those who have defrauded the government. Make no mistake, she said, today's decision is a power grab.",
        "start": 1431.084,
        "end": 1459.667
    },
    {
        "text": " Once again, the majority arrogates Congress's policymaking role to itself. And in so doing, she said, the court has cast a cloud of doubt over the way dozens of agencies carry out their congressional mandates. Congress, she said, had no reason to anticipate the chaos today's majority would unleash after all these years.",
        "start": 1459.667,
        "end": 1481.988
    },
    {
        "text": " Indeed, the court's decision could have huge ripple effects for agencies that use a process like the SEC's to enforce laws on everything from labor rights to mine safety and energy regulation. But as Case Western University professor Jonathan Adler observes, the court's majority did carve out an exception for agencies that deal with federal benefits.",
        "start": 1481.988,
        "end": 1505.811
    },
    {
        "text": " The court doesn't touch Congress's ability to allow agency adjudication for public benefits and pensions and patents and things like that. Indeed, the court's decision leaves intact the Social Security Administration's cadre of 1,500 administrative law judges who make decisions in a half million cases every year.",
        "start": 1505.811,
        "end": 1526.988
    },
    {
        "text": " Thank you very much.",
        "start": 1526.988,
        "end": 1548.166
    },
    {
        "text": " Jargasi was investigated for fraud, and after a hearing before an administrative law judge, he was fined $300,000 and ordered to pay back $700,000 in ill-gotten gains. In addition, the agency barred him from various activities in the securities industry.",
        "start": 1548.166,
        "end": 1565.794
    },
    {
        "text": " Today's Supreme Court decision did not touch that $700,000 in restitution, just the fine. George Washington University law professor Alan Morrison says the court seems to be drawing a line between a fine, a penalty, that is not permissible, and restitution, which is. That, he notes, may be a saving grace for the agency. So an agency like the SEC may say, look...",
        "start": 1565.794,
        "end": 1591.34
    },
    {
        "text": " Disgorgement is a lot of money, and we'll be happy to get disgorgement and stay at the administrative level. Ironically, after today's ruling, the SEC is likely to suffer fewer consequences than other agencies, largely because the Supreme Court, beginning in 2018, began eating away at the agency's power to use administrative law judges, and in response, the SEC decreased the number of ALJs at the agency from six to two, choosing instead to bring its cases mainly in federal court.",
        "start": 1591.34,
        "end": 1621.34
    },
    {
        "text": " federal courts however do not have the power to bar convicted offenders from working in the securities industry Nina Totenberg NPR News Washington",
        "start": 1621.34,
        "end": 1631.766
    },
    {
        "text": " Picture this, lush green fields in southwest England, a few cows, some apple trees, a quiet countryside scene. But then picture something else, some of the world's biggest names in music descending on this farm, bringing with them more than 200,000 fans who all camp out there for five days, rain or shine. The result is one of the biggest performing arts festivals in the world, Glastonbury. It is underway right now, and NPR's Lauren Frayer is right in the middle of it. Hey, Lauren.",
        "start": 1632.159,
        "end": 1661.664
    },
    {
        "text": " Hi, Scott. Let me get right to it. Are you in the middle of a muddy mosh pit? Scott, I took a huge risk and I left my rubber boots at home and now I'm watching these dark clouds roll in ominously. I'm also looking at a sea of multicolored tents and stages where Dua Lipa, Coldplay, Femi Kuti, Shania Twain, those are some of the headliners playing here this week and this weekend. This place is legendary. Here's one of the music fans I met here, Sam Llewellyn, and he has his baby son Theo in his backpack.",
        "start": 1661.664,
        "end": 1689.087
    },
    {
        "text": " It's his first year. He's one. He was one on the 1st of May. I've been coming since I was six months old. I'm now 29. You've been coming here since you were a child. Your parents took you here. Yeah, yeah. And now you're taking your child. Now I'm taking my child. I'm living on the generations of Glastonbury.",
        "start": 1689.087,
        "end": 1706.357
    },
    {
        "text": " This festival has been going on since 1970. It's kind of like Woodstock, so there are these generations and generations of fans. There's a kids' field with playgrounds, arts and crafts, face painting. There are diaper-changing areas. I mean, 50 years is such a long time for pop culture and music. I'm pretty sure there weren't diaper-changing areas at the beginning. What did it look like in the beginning? How has it changed over time?",
        "start": 1706.51,
        "end": 1729.258
    },
    {
        "text": " There was nothing. This was a farm. There's a farmer named Michael Evis. Back in 1970, the tickets cost one pound, about $1.25. Now they cost more than $450. Most people, like me, camp in their own little tent in the grass. But there are glamping options now. There are luxury yurts for thousands of dollars a night. There's a pop-up hotel with a swimming pool. Michael Evis is still around, incidentally. He's 88. He's now Sir Michael Evis. He's a knight now.",
        "start": 1729.258,
        "end": 1757.517
    },
    {
        "text": " He still runs this festival. He was actually on stage today singing Frank Sinatra's My Way to massive cheers. It still retains Evas's ethos, though, which is resisting commercialization. You don't see a lot of big logos here. Glastonbury has sort of managed to avoid controversies that have hit, like festivals like South by Southwest, for example, where artists have pulled out, objected to sponsorship from certain industries.",
        "start": 1757.517,
        "end": 1783.012
    },
    {
        "text": " The motto here is leave no trace on the land. Every five years or so, they have a fallow year. They literally skip the festival to let the grass regrow because this is actually still a functioning dairy farm. They make cheddar cheese here. I mean, let's get to that. I've been to a lot of music festivals and I can see how much of a mess they make. How can hundreds of thousands of people camp for five days and leave no trace?",
        "start": 1783.012,
        "end": 1805.367
    },
    {
        "text": " I mean, the organizers are just serious about sustainability. There are composting toilets. There's an army of volunteers who clear trash in exchange for free tickets. The festival is plastic-free, glass-free. Here's Sarah Stevens. She's been volunteering here for the past 40 years. Yeah, the cows are just missing at the moment. And that's why you have to respect the land even more. You know, no glass and no non-biodegradable glitter. Yes.",
        "start": 1805.725,
        "end": 1831.254
    },
    {
        "text": " Because what you drop, a cow could be eating in three weeks' time. And it's not just music. There's art, magic, acrobats, political activism. Last year, this festival raised more than $2 million for three big charities.",
        "start": 1831.254,
        "end": 1845.128
    }
]