[
    {
        "text": " and I spoke to them today. They said, look, the Israeli military has to make conditions safer on the ground for us because the operating environment across Gaza has become, in the words of the spokesperson, almost impossible in the last few weeks. And we also have heard from groups like Mercy Corps that say aid is just trickling into Gaza through crossings, but the majority of stuff that's coming in now that Israel's allowing is coming from Israeli merchants, and these are on commercial trucks. And what that looks like is market stalls",
        "start": 0.009,
        "end": 26.698
    },
    {
        "text": " with the kind of fruits and poultry we haven't seen in months. So that could include like mangoes and chicken. But people can't afford it. People are just walking past it. They can't afford it. They haven't worked in months. Banks don't operate. And the prices have skyrocketed. So people just can't afford this stuff. So, Tom, based on your conversations with aid workers and U.S. officials, what's the path forward here?",
        "start": 26.698,
        "end": 45.862
    },
    {
        "text": " Well, the U.S. said it's working with the U.N. and Israel to come up with solutions such as better communications between U.N. humanitarian workers in Israel. That aid worker I spoke with in Gaza said, you know, communications is vital. Right now it's working in some places with the Israeli military but not others. And they don't want to get caught in a crossfire or be mistaken for Hamas fighters. He also said, listen, we need armored vehicles. He's driving around in just a regular car.",
        "start": 46.101,
        "end": 74.224
    },
    {
        "text": " That's something else the U.N. wants too. Armored vehicles will be really important to provide that security for these aid workers.",
        "start": 74.224,
        "end": 81.186
    },
    {
        "text": " And I'll just say, you know, we've reported also on the U.N. saying they want to work with police on the ground for local security, but those police have been targeted by Israel because they're also deemed as an arm of Hamas. So it's unclear who could provide security on the ground at this point because the aid organizations, they don't want to hire just gunmen and gangs like the commercial trucks have. But one nurse told me that she said, look, there are cherries now, but no gauze. So it's not just food. It's also a lack of fuel for hospitals and ambulances and medical supplies.",
        "start": 81.323,
        "end": 107.193
    },
    {
        "text": " As well as Tom Bowman. Thanks to both of you. You're welcome. Thank you. A few months before his death, Japanese composer Ryuichi Sakamoto sat down at the piano and performed a final private concert.",
        "start": 107.193,
        "end": 124.684
    },
    {
        "text": " It was late 2022. Sakamoto played selections of his beloved film scores, like Merry Christmas, Mr. Lawrence, along with new compositions he had never previously recorded. He was too sick to play the whole set without taking breaks. By then, Sakamoto had battled cancer for years, and he later wrote that, quote, due to the exertion, I felt utterly hollow afterwards. He died in March of last year. He was 71.",
        "start": 128.882,
        "end": 153.695
    },
    {
        "text": " Today, Sakamoto's estate announced a new album of songs from that concert called Opus, and will come out in August. Here's the first song that's been released, a slow, meditative version of his 1978 classic, Tong Poo.",
        "start": 153.695,
        "end": 165.759
    },
    {
        "text": " You're listening to All Things Considered from NPR News. This is KAWC Yuma, KAWP Parker, 88.9 FM on the KAWC app and at kawc.org. We've been a listener-supported service of Arizona Western College for more than 50 years. It is 18 minutes past 5 o'clock. NPR's All Things Considered continues in a moment.",
        "start": 206.817,
        "end": 230.35
    },
    {
        "text": " Hey, this is Steve Inskeep with NPR News. With one of the ways that NPR is different, other media have struggled to get their content behind a paywall, to make sure that you pay something for the content. NPR News is different because our content is free, and yet many of the people who use it volunteer to put themselves behind a paywall. They volunteer to pay for something that is free.",
        "start": 231.527,
        "end": 254.036
    },
    {
        "text": " because they know how valuable it is. And that is the way that NPR News works. That is the way that KAWC works. Your station is supported by the people who use it, which means that they can operate in your interest. Your interest. We think that's important, and we're guessing you do too, because you turn to this station every day for the information and news that you need. To ensure that this station continues to be a place where you can be challenged to think,",
        "start": 254.036,
        "end": 279.684
    },
    {
        "text": " where you can get information in your interest. I'm asking you right now, support KAWC if you can. Visit kawc.org to make your donation today. Thanks. Hola, I am composer Elvio Barilari, your host for Fiesta. On our next program, we are going to present an amazing Renaissance Spanish composer, the great Tomás Luis de Victoria.",
        "start": 279.684,
        "end": 307.449
    },
    {
        "text": " Join me for a program of gorgeous music by this 16th century composer. Next on Fiesta. Sunday night at 8 on KWC 88.9 FM.",
        "start": 308.148,
        "end": 319.701
    },
    {
        "text": " Support for NPR comes from NPR member stations and from the Bill and Melinda Gates Foundation, dedicated to the belief that all lives have equal value and working with partners to help envision a world where every person has the opportunity to live a healthy, productive life at GatesFoundation.org. From Heather and Paul Haga, supporting Salzburg Global Seminar, committed to helping tomorrow's leaders forge solutions today. More information is available online at SalzburgGlobal.org.",
        "start": 331.561,
        "end": 360.52
    },
    {
        "text": " And from the listeners who support this NPR station. This is All Things Considered from NPR News. I'm Ari Shapiro. And I'm Scott Detrow. For decades, Kevin Costner and Westerns have gone together. Big sweeping critical wins like Dances with Wolves. Actually, sir, I'm here at my own request. Really? Why? I've always wanted to see the frontier. Do you want to see the frontier? Yes, sir.",
        "start": 361.442,
        "end": 390.606
    },
    {
        "text": " Before it's gone. Big sweeping critical flops like Wyatt Earp. My name is Wyatt Earp. It all ends now. And more recently, the mega hit Paramount Network show Yellowstone. We're ranching so hard. How can we do it? Because it's one hell of a live tape.",
        "start": 391.578,
        "end": 413.387
    },
    {
        "text": " which Costner recently confirmed he's leaving after five seasons. Through all those years, Costner was thinking about one more big, sweepy project, one he's been writing and rewriting and trying to get made for decades. The initial idea was in 1988, there was already a town. It was called Sidewinder.",
        "start": 416.186,
        "end": 436.186
    },
    {
        "text": " And it was a pretty good screenplay. Ultimately, I wasn't able to make it, but I didn't really fall out of love with the idea. And now he's brought that idea to fruition, and it's not about a person, it's about a town.",
        "start": 436.442,
        "end": 449.07
    },
    {
        "text": " Why do all the Westerns have a town and we don't know how it came to be? Horizon, an American saga, attempts to tell that story. Costner stars in the film, which he also co-wrote, produced, and directed. And similar to some of his past projects, he has put a lot of his own money into Horizon, which he intends to release in four parts. I'm taking a financial risk, you know, but I believe in the audience I'm making this for. I know that I'll die trying to make this.",
        "start": 449.104,
        "end": 477.756
    },
    {
        "text": " And that risk is where we started the conversation. I asked Kevin Costner about the reports. He's personally put $38 million into the film.",
        "start": 477.756,
        "end": 485.964
    },
    {
        "text": " It's more than that now. It's interesting how a number... It's just grown. I will just tell you that personally. It's much more than that. This was a factor for you walking away from Yellowstone. I guess the question... It was not a factor walking away from Yellowstone. It just simply wasn't. There's a mythology there. I made Yellowstone a priority. I worked in between the dates that Yellowstone was scheduled to work. When that work was...",
        "start": 486.032,
        "end": 515.64
    },
    {
        "text": " that schedule was done, I had already prepared the ground to make Horizon. So I didn't make Horizon on the backs of Yellowstone. So we have myths about the West and I guess myths about Western movies being made at the same time, we're finding. I would say that that's correct.",
        "start": 515.64,
        "end": 536.544
    },
    {
        "text": " We've already touched on mythology and the way that the story changes or flattens or gets exaggerated over time and how much of a central theme that is for the idea of America and the West. And I feel like in Hollywood, outside of Hollywood, there's been pushes in different corners to kind of reconsider those myths in recent years. Have you thought about that? Has that changed the way you tell these stories at all?",
        "start": 536.954,
        "end": 557.944
    },
    {
        "text": " I just tell a story where I embrace the idea of human behavior. I embrace the realities of why people came, the people that were here. There's enough stories that tell me that my story happened thousands of times in this conflict. What I try to do is invest in behavior and create the architecture of a novel almost.",
        "start": 558.507,
        "end": 584.462
    },
    {
        "text": " I was thinking about the attack at the end of the movie as a symmetry to the attack at the beginning of the movie and the different perspective. Sometimes the great cities were formed in these river crossings, and we don't know the beginnings. And so my investment in story is simply reality mixed with behavior, mixed with deciding to tell multiple stories. And that's just my style. Mm-hmm.",
        "start": 584.633,
        "end": 614.053
    },
    {
        "text": " At many different points, though, you've made a point to put a three-dimensional Native American point of view into the story.",
        "start": 614.053,
        "end": 619.497
    },
    {
        "text": " I think it doesn't work if they don't come off as people themselves. By the time the settlers were really coming in, the tribes were torn apart politically. It was gross what was happening. Our intentions were not honest. They weren't fair. It doesn't negate that people came with hope.",
        "start": 620.469,
        "end": 646.169
    },
    {
        "text": " and a resourceful attitude to build a new community. They just had no concept of who they were displacing. And there was the Native Americans found themselves an inconvenience in their own country.",
        "start": 646.169,
        "end": 662.773
    },
    {
        "text": " I took the opportunity here prepping for this interview to rewatch a lot of your movies, and I was thinking about some big through lines through a lot of them. You suddenly dropped volume for some reason. That's because I was complimenting you. Maybe it just dropped out. I don't know if you want... You just wanted to whisper that so I didn't get a big head? Okay. I was saying I use this to do the hardship assignment of rewatching a lot of your movies over the last couple of weeks. I apologize.",
        "start": 663.643,
        "end": 692.21
    },
    {
        "text": " You know, they hold up pretty well. A lot of them keep coming back to these big themes about America. Danny Houston's character in Horizon has this big speech early on that gets to these ideas of America. These people have been pushing the same wheel back home around and around until they can't bear another turn on it. That's the path they inherit. If they try to change it at all, they have to do it by inches.",
        "start": 692.432,
        "end": 719.633
    },
    {
        "text": " You may recall that's what drove us across the ocean to this country in the first place. You and I are standing guard in one of the last great open spaces, Trent. There's no army of this earth that's going to stop those wagons coming.",
        "start": 721.271,
        "end": 737.773
    },
    {
        "text": " So Houston's character is conceding there that the push west is inevitable. But given that, do you think that if you were living in this period, you would have gone west? Because that's something we were talking about watching this movie. Like, look at all the different ways you can get yourself killed. Look at all the ways that this was so incredibly hard. Do you think that's something you would have done?",
        "start": 737.927,
        "end": 758.08
    },
    {
        "text": " I would have been probably more of a mountain man. I love the idea of seeing things and telling people about them and then continuing on. Myself, when I saw How the West Was Won, I was seven years old and the first image of Jimmy Stewart in a birch bark canoe headed across a lake that didn't have a ripple",
        "start": 758.37,
        "end": 782.91
    },
    {
        "text": " backed up by the Sierra Mountains to see a group of people standing on the beach. I was moved, so moved that I, born in the inner city in a place called Compton, California, I built three canoes before I was 18 years old and ultimately went down several of the rivers that Lewis and Clark had gone down.",
        "start": 782.91,
        "end": 805.981
    },
    {
        "text": " just because it ignited me, that imagery. So trading with people where I didn't share the same language, meeting them on their ground, that I could see myself doing that. Kevin Costner, the writer, director, and star of Horizon, an American saga. Thanks for talking to us. You're welcome. The film's first chapter is out tomorrow.",
        "start": 805.981,
        "end": 835.879
    },
    {
        "text": " This is NPR News. It's 529 NPR Headlines in a moment here on KAWC Yuma, KAWP Parker, 88.9 FM.",
        "start": 868.012,
        "end": 880.265
    },
    {
        "text": " KAWC and Border Radio are supported by Arizona Western College, offering more than 100 degrees and certifications in person and online. Dedicated to lifelong learning, AWC seeks to enhance the Yuma community through economic and workforce development and community partnerships. Details available at azwestern.edu.",
        "start": 881.425,
        "end": 901.561
    },
    {
        "text": " How does this always happen? A new year just starts, and then suddenly it's six months later. I'm Elena See, and this week, it's our mid-year musical roundup on Folk Alley. I'm going to share some of our favorite music of 2024, including the latest from Cedric Burnside, Sierra Farrell, and more. Hope you'll join me this week on Folk Alley. Saturday evening from 6 to 8 on 88.9 FM KAWC.",
        "start": 902.125,
        "end": 928.848
    },
    {
        "text": " Clear skies overnight tonight in the Yuma area with a low around 85 degrees, 25 mile per hour wind gusts. The high on Friday for Yuma around 110. Mostly clear tonight in Parker with a low around 84, 25 mile per hour wind gusts as well. The high on Friday for Parker should be around 111. Music",
        "start": 932.432,
        "end": 958.831
    },
    {
        "text": " Live from NPR News in Culver City, California, I'm Dwayne Brown. Well, for the first time in four years, President Biden and his Republican rival Donald Trump are set to meet on the debate stage in about half an hour. The 81-year-old Democratic incumbent has the opportunity to reassure voters he's capable of guiding the country through a second term, while 78-year-old Trump could use the moment to move past his recent felony conviction. NPR's Windsor Johnston has more.",
        "start": 962.09,
        "end": 989.48
    },
    {
        "text": " With recent polling showing an extremely tight rematch, the stakes are high for each candidate as he makes his case for a second term. It's yet to be seen whether this debate will change the trajectory of the race, but it gives Trump and Biden the opportunity to address the most pressing issues, including abortion rights, immigration and inflation. Voters will not only be listening for what the candidates say, but how they interact with each other.",
        "start": 989.616,
        "end": 1017.329
    },
    {
        "text": " and whether either of them can move the needle among undecided voters. NPR will be providing live special coverage of tonight's debate, which begins shortly at 9 Eastern. In New Mexico, the risk of flash flooding around wildfire burn areas remains high through the weekend. NPR's Kirk Sigler tells us most businesses are closed in Las Vegas, New Mexico, due to a water crisis. This city of 13,000 people is believed to be within a day or two of running out of drinking water.",
        "start": 1017.329,
        "end": 1046.442
    },
    {
        "text": " After days of relying on donations, FEMA just sent eight semi-truckloads of pallets of water. Lieutenant Colonel Megan Napier of the New Mexico National Guard says now they're able to distribute water for eight hours a day instead of just limited windows. The need is extreme. We are able to service people who are working during the day and unable to come during the early morning hours to get in line. So we're not having to turn people away today, and that's a pretty good feeling.",
        "start": 1046.442,
        "end": 1071.596
    },
    {
        "text": " Mudslides coming off a wildfire burn scar from two years ago rendered the city's water treatment plant all but inoperable. You're listening to NPR News.",
        "start": 1071.749,
        "end": 1081.067
    },
    {
        "text": " In Kentucky, plaintiffs challenging abortion restrictions are using a move often employed by conservative groups to argue their case, religious freedom. From Kentucky Public Radio, Sylvia Goodman has more. The Kentucky women filed their suit more than a year and a half ago as part of a wave of lawsuits saying state abortion restrictions are a violation of religious freedom.",
        "start": 1082.466,
        "end": 1103.848
    },
    {
        "text": " Plaintiff Lisa Sobel argues that Kentucky's ban not only endangers her health, but her ability to practice her religion. As much as I'd like to go forward and try and have more children, I can't in good conscience because there's too much risk.",
        "start": 1103.848,
        "end": 1117.671
    },
    {
        "text": " to my life and to what I may or may not be charged with. The lawsuit revolves in part around in vitro fertilization. The women say Kentucky's laws aren't clear on whether embryos, whether they're viable or not, can be discarded in the IVF process. For NPR News, I'm Sylvia Goodman in Louisville.",
        "start": 1118.148,
        "end": 1135.674
    },
    {
        "text": " In Atlanta, the hotel company Red Roof Inn has agreed to a major undisclosed settlement in a sex trafficking case involving 11 alleged victims. This after the hotel chain and some of its employees knowingly profited from sex trafficking at two hotels near Atlanta over a 10-year period. The landmark settlement resolves allegations from women who said they were exploited for years at Red Roof hotels.",
        "start": 1136.271,
        "end": 1163.285
    },
    {
        "text": " On Wall Street, stocks finished modestly higher today. The Dow gained 36 points. This is NPR. Hi, I'm Chris McDaniel. Later this hour, Yuma County voting machines have been tested for accuracy. Find out more coming up.",
        "start": 1163.456,
        "end": 1179.753
    },
    {
        "text": " The city of Yuma will host the men's and women's Donnie Crump Late Night Over the Line tournaments, which will take place on August 10th and 11th at the Pacific Avenue Athletic Complex. Teams consisting of two players will play a series of pool games, followed by a single elimination tournament. Registration and information are under activities at YumaAZ.gov.",
        "start": 1181.681,
        "end": 1201.152
    },
    {
        "text": " President Joe Biden and former President Donald Trump take the stage tonight in Atlanta for the first presidential debate of this election season. It's the earliest general election debate in modern history, and this time there are a few new rules. Join us for live special coverage and analysis of the CNN presidential debate simulcast on NPR News starting tonight at 6 o'clock on KAWC Yuma 88.9 FM.",
        "start": 1202.363,
        "end": 1228.404
    },
    {
        "text": " Support for NPR comes from NPR member stations and from Cancer Treatment Centers of America, where each patient has a dedicated care manager to help coordinate every aspect of care, from scheduling appointments to transferring medical records and arranging transportation and accommodations, at cancercenter.com. From EBSCO, working in partnership with open source library technologies and open access journals to support libraries and their users. Learn more at ebsco.com.",
        "start": 1231.561,
        "end": 1260.299
    },
    {
        "text": " And from the National Endowment for the Arts, Art Works. It's All Things Considered. From NPR News, I'm Scott Detrow. And I'm Ari Shapiro. The Environmental Protection Agency's Good Neighbor Plan is designed to protect downwind states from air pollution blowing across state lines. It's a friendly enough name, but a group of states, companies, and trade associations does not find the Good Neighbor Plan friendly.",
        "start": 1260.896,
        "end": 1285.35
    },
    {
        "text": " So they sued, and in a 5-4 vote today, the Supreme Court sided with them and put the plan on hold while litigation continues in lower courts. To talk more about the decision, we're joined by Jonathan Adler. He's the founding director of the Coleman P. Burke Center for Environmental Law at Case Western Reserve University. Good to have you back. Good to be here. What's your top line reading of this opinion?",
        "start": 1285.35,
        "end": 1305.947
    },
    {
        "text": " Well, the court is holding the EPA to a fairly stringent rule about responding to comments in the rulemaking process. And I think this is one of several decisions we've seen over the last 10 years where the court is concerned.",
        "start": 1307.227,
        "end": 1322.415
    },
    {
        "text": " that if companies have to begin complying with environmental regulations while judicial review is still going on, they may make investments that the EPA could not have properly required them to make. And we saw that happen with some prior rules, and I think that's in the background of this decision as well.",
        "start": 1322.415,
        "end": 1340.947
    },
    {
        "text": " The plan was established to ensure that states complied with a 2015 air quality law, and the states that filed suit say the EPA failed to adequately consider the legal and practical implications of substituting its plan for the state's plans. Is this a familiar states' rights argument that we've heard in many other contexts, or are they getting at something more specific to air pollution here?",
        "start": 1340.947,
        "end": 1361.971
    },
    {
        "text": " Well, the state's arguments that they made included some traditional appeals to states' rights concerns. But the decision the court gave was very narrowly focused on the procedure the EPA goes through, and in particular, a requirement that's usually dealt with in lower courts.",
        "start": 1363.166,
        "end": 1380.828
    },
    {
        "text": " that agencies adequately respond to all the significant comments made during the rulemaking process. And the majority was convinced that the EPA did not adequately respond to questions about what to do if the number of states that were supposed to participate in the Good Neighbor program was reduced because in various other cases, some of the states were at least temporarily removed from the program.",
        "start": 1380.828,
        "end": 1409.667
    },
    {
        "text": " And the complaining states said this arguably changes how much of an emission reduction effort different states or different companies have to make. EPA, you didn't adequately tell us how you were going to figure out how the program changes if some states drop out.",
        "start": 1409.667,
        "end": 1425.93
    },
    {
        "text": " And five of the justices found that convincing. Given how conservative and forward-leaning this court has tended to be, does it strike you as a rather restrained ruling? I mean, they didn't give the EPA a win, but they didn't give them as much of a loss as they might have, right?",
        "start": 1425.93,
        "end": 1440.503
    },
    {
        "text": " Well, yes and no. I mean, the legal holding of the opinion is very narrow. But what was very aggressive about this case is that the court didn't wait for the challenges on these arguments in the lower courts to proceed. Rather, this case came to the court on an emergency motion for a stay to stop the rule in its tracks while litigation was ongoing. And that was quite an aggressive move, even though the ultimate decision was narrow.",
        "start": 1441.391,
        "end": 1469.394
    },
    {
        "text": " And just in our last 30 seconds, do you think this implies something larger about the issue of rulemaking, which is before the court in a couple of cases? Well, I mean, I do think it shows that a majority of the court is skeptical of federal regulatory agencies and is concerned that when cases finally get to the Supreme Court, it might be too late, and that in this case, it justified the court intervening early. That's Jonathan Adler, law professor at Case Western Reserve University. Thank you. Case Western.",
        "start": 1469.394,
        "end": 1499.172
    },
    {
        "text": " My pleasure. Thank you. People in New Mexico are reeling from multiple disasters. A deadly wildfire remains uncontained in the south, while up north mudslides have created a drinking water crisis in another city. It's been climate whiplash, fire, then a lot of rain, then debris flows and dangerous flooding, with more heavy rain on the way. And PR's Kirk Siegler joins us from New Mexico to tell us more. Hey, Kirk. Hey, Scott. So first, what's the latest on the wildfire?",
        "start": 1500.862,
        "end": 1527.875
    },
    {
        "text": " Well, it's actually two wildfires side by side and one nearly consumed the village of Ridoso. It's a big tourist area in the mountains of southern New Mexico. As of today, crews are reporting they're getting close to three-quarters containment on the fire, and it's really not burning anymore due to all the rain, as you said, that's been hitting here. So they're kind of just in the interior mopping up hot spots. There's also a lot of pressure to reopen the village because this is the height of the tourist season. Particularly, you have a lot of Texans coming over here to escape the heat. But",
        "start": 1527.875,
        "end": 1557.517
    },
    {
        "text": " That's not an easy thing to do. You know, some 1,300 homes burned. There have been power outages. You've had whole neighborhoods destroyed. And those rains wreaked more havoc, causing flooding and mudslides. And there are still flash flood watches in effect, last I checked. And there's other flooding elsewhere in New Mexico. Tell us about that.",
        "start": 1557.517,
        "end": 1574.701
    },
    {
        "text": " Yeah, so I'm actually in Las Vegas, New Mexico. It's a couple hundred miles to the north of Rio Doso. About 13,000 people live here, and this city is perilously close to running out of water. Downpours triggered mudslides of toxic debris running off a two-year-old wildfire burn scar, Scott, and...",
        "start": 1575.333,
        "end": 1592.671
    },
    {
        "text": " into the town's water supply. They're saying there may not be drinking water in another day or so, so all businesses except grocery stores and a couple gas stations have been ordered to close, and there are long lines at water and sandbag distribution sites. To my left, I can see a long line of dozens of idling cars. Looks like they just started moving. People are worried about flooding knocking out their homes. I talked to Marcela Sanchez. She'd been waiting for more than an hour for sandbags to protect her home. Let's listen to her.",
        "start": 1592.671,
        "end": 1621.783
    },
    {
        "text": " We have a high wall, but good thing in certain areas. But the other land by the arroyo, the ditch, the neighbors, all their stuff came and I don't know what's involved because he collects junk. Scott, there's so much demand in New Mexico right now that people here are only getting 20 sandbags a day, which really doesn't do that much. And Sanchez told me it's a fiasco here. So what's being done to help?",
        "start": 1621.783,
        "end": 1645.691
    },
    {
        "text": " Well, there are now disaster declarations in multiple counties in northern and southern New Mexico, so that's big. FEMA is now on the ground in Redoso, where that big fire is still not out, of course. And the agency is starting to send more water here to Las Vegas, the National Guard.",
        "start": 1646.578,
        "end": 1661.903
    },
    {
        "text": " The National Guard just told me that they're open for eight hours today and they're not turning anyone away like in previous days when they were relying on donated water now that FEMA has arrived. And, you know, there's a lot of pressure on the feds to help get that water treatment plant here fully operational. But I have to say, Scott, you know, there's not a lot of faith in FEMA here. This is the site of that wildfire two years ago. It was the largest in New Mexico history. And despite a federal law being passed that says",
        "start": 1661.903,
        "end": 1689.275
    },
    {
        "text": " guarantees FEMA aid. A lot of survivors here in town that I've been talking to say they haven't really seen much, if any, and some have just totally given up on the federal government. Yeah, yeah. Looking forward, what's the weather outlook? Could it help or hurt?",
        "start": 1689.275,
        "end": 1704.07
    },
    {
        "text": " probably hurt. It's a matter of whether or not they're going to be prepared in time. The National Weather Service has issued flash flood watches here in Las Vegas and down in southern New Mexico until midnight tonight. The National Guard just told me they're expecting more storms this weekend. So, you know, it really just depends where the storms hit and how much rain falls. But I can tell you it's a very stressful situation still here and in Las Vegas anyway. All of the 4th of July festivities have",
        "start": 1704.309,
        "end": 1728.353
    },
    {
        "text": " been cancelled, so that's a pretty big bummer in town. That's NPR's Kirk Siegler in Las Vegas, New Mexico. Thanks so much. You're welcome.",
        "start": 1728.473,
        "end": 1735.555
    },
    {
        "text": " You're listening to All Things Considered from NPR News. For KAWC News, I am Chris McDaniel. Arizona State Election Director Lisa Mara, along with a delegation from the Office of the Secretary of State, were at the Yuma County Recorder's office Thursday morning to test the voting machines in advance of upcoming elections. Their testing showed the machines are 100% accurate. I spoke to Mara after the testing had concluded.",
        "start": 1767.346,
        "end": 1794.48
    },
    {
        "text": " So today we conducted what's called the logic and accuracy test, the LNA test for counties. Anytime there is a federal or state election, the Secretary of State's office is responsible for going to each county and taking a random selection of precincts, a random number of ballots. We have to make sure every candidate gets votes, gets overvotes, undervotes, blank ballots. Every congressional district is tested. Every legislative district is tested.",
        "start": 1795.265,
        "end": 1820.009
    },
    {
        "text": " And the county has no idea how many ballots we bring or what those results are. You observed us randomly picking machines, testing all the accessible voting devices, and then comparing the results. And the results were spot on, 100% match, 528 ballots. So Yuma County passed with a perfect score? Yuma County passed with a perfect score. Yuma County has amazing election officials, and we're very lucky that we have them. They're good partners. So you guys are all over the state?",
        "start": 1820.009,
        "end": 1845.009
    }
]