[
    {
        "text": " Support for NPR comes from the station and from the George Gund Foundation, working to make Cleveland more vibrant, sustainable and just and setting an example for the nation. More information available at Gund Foundation dot org. From the Doris Duke Foundation, which aims to support the well-being of people and the planet for a more creative, equitable and sustainable future.",
        "start": 0.009,
        "end": 23.558
    },
    {
        "text": " and from the William T. Grant Foundation, supporting research to improve the lives of young people, at wtgrantfdn.org.",
        "start": 24.241,
        "end": 33.592
    },
    {
        "text": " For KAWC News, I am Chris McDaniel. Arizona State Election Director Lisa Mara, along with a delegation from the Office of the Secretary of State, were at the Yuma County Recorder's office Thursday morning to test the voting machines in advance of the upcoming election. Their testing showed the machines are 100% accurate. I spoke to Mara after the testing had concluded.",
        "start": 36.578,
        "end": 58.251
    },
    {
        "text": " So today we conducted what's called the logic and accuracy test, the LNA test for counties. Anytime there is a federal or state election, the Secretary of State's office is responsible for going to each county and taking a random selection of precincts, a random number of ballots.",
        "start": 59.07,
        "end": 74.565
    },
    {
        "text": " We have to make sure every candidate gets votes, gets overvotes, undervotes, blank ballots. Every congressional district is tested. Every legislative district is tested. And the county has no idea how many ballots we bring or what those results are. You observed us randomly picking machines, testing all the accessible voting devices, and then comparing the results. And the results were spot on, 100% match, 528 ballots. So Yuma County passed with a perfect score.",
        "start": 74.565,
        "end": 100.691
    },
    {
        "text": " Yuma County passed with a perfect score. Yuma County has amazing election officials, and we're very lucky that we have them. They're good partners. So you guys are all over the state today. How many of you are going to go to each county and do the same thing? So we can't go to each county every day, the same day, but we do three counties a day. So today, after we leave here, this was our first test today. We go to La Paz, and then we go to Mojave.",
        "start": 100.691,
        "end": 120.486
    },
    {
        "text": " And then we have two counties tomorrow and one county next week, and then we're done. So we started out Monday morning testing the counties three a day. And counties can't start early voting using machines until they have a successful LNA. So Yuma County is good to go. Why is it important to ensure accuracy and security in advance of the upcoming elections?",
        "start": 120.486,
        "end": 140.009
    },
    {
        "text": " It's critical. It's paramount. We've got to have confidence in our elections. We've got to have confidence in our election officials. And when you consider that our team at the Secretary of State's office marks, hand marks, mind you, they're not machine printed, hand marks ballots with a random generated script. So we know what those results are.",
        "start": 140.009,
        "end": 156.493
    },
    {
        "text": " And they handmark 12,000 to 15,000 ballots, take them across the state to counties, and they're 100% match in every county. And if they're not 100% match, we have to go back and figure why not. And usually it's human error on our staff's part from mismarking a ballot. So we can identify that quickly, fix that, and then make sure we've got a count. Because every vote matters. If you're one off, you're one off and you've got to find out why. So it's incredibly important to the security and accuracy of elections.",
        "start": 156.493,
        "end": 183.217
    },
    {
        "text": " And you said earlier, a lot of times it's just human error. So you guys are looking for human error and the machines are working today. So how does that work? You know, before we came here, they've tested thousands of ballots when they got their program. So they've checked the audio because it's not just the printed ballot, right? It's the audio. It's making sure that the accessible voting devices work.",
        "start": 183.217,
        "end": 201.493
    },
    {
        "text": " and that if I have a vision impairment or a physical disability, I'm still able to vote in person on Election Day if that's how I choose to vote. So all those things have been tested, and I can't be prouder of all the counties, especially Yuma.",
        "start": 201.493,
        "end": 215.094
    },
    {
        "text": " The Fontes office, you guys are ready for this busy season coming up? We are. We're busy all the time, but right now the counties are really the busy ones. So we've got the LNA testing under the belt almost. So for us, our part is done because the Secretary of State's office, we don't conduct elections. Counties do. We don't register voters. Counties do that. But the next thing that's facing our office is ballot measure filing because the deadline for ballot measure filing is July 3rd.",
        "start": 215.162,
        "end": 240.435
    },
    {
        "text": " Same day as early voting starting, so it's going to be very busy. And we've anticipated four filings, and if all four of those come through with estimated signatures that we're thinking about, that's roughly 2.1 million lines of signatures that our office reviews and then sends a 5% sampling to counties. So keep in mind how busy counties are going to be because they're during early voting most of the month of July, and then they'll be doing those random checks of samples of those voters for the ballot measure. So it's going to be very busy times in elections.",
        "start": 240.435,
        "end": 269.923
    },
    {
        "text": " And the government's at work. Government's at work. I'm Chris McDaniel. A service of Arizona Western College for 50 years, this is 88.9 FM KAWC. You can hear us with the KAWC app and at kawc.org. Follow us or leave your comments at facebook.com slash kawc radio.",
        "start": 269.923,
        "end": 290.435
    },
    {
        "text": " The town of Welton is hosting a movie in the park on Friday, July 21st at Butterfield Park, 10234 Dome Street in Welton. They will screen a million miles away based on the true story of Jose Hernandez's journey from farm worker to astronaut. Event opens at 7.30 p.m. with film at 8.30. More details at weltonaz.gov. I'm Maria Hinojosa. This week on Latino USA, episode one of our two-part investigation into the strange death around the death of a man",
        "start": 290.725,
        "end": 320.469
    },
    {
        "text": " in a U.S. immigrant detention center. We look into why and how Jose de Jesus died, who runs immigration detention centers, and who's accountable for taking care of the people there. That's this week on Latino USA. We hope you can join us for Latino USA with Maria Hinojosa. That airs every Friday at 7 p.m. here on KAWC 88.9 FM.",
        "start": 320.691,
        "end": 350.06
    },
    {
        "text": " Another hot, sunny, and breezy day here in southwest Arizona. Yuma can expect a high near 110 with 20 mile per hour wind gusts. The low tonight for Yuma around 84. Parker can expect a high near 111 with some 25 mile per hour wind gusts. The low tonight for Parker should be around 81.",
        "start": 351.476,
        "end": 368.763
    },
    {
        "text": " The City of Yuma presents Orienteering 101, an introduction to the sport of navigation using a map and compass. Orienteering exercises the body and mind, and this introduction activity happens from 9 to 11 a.m. on July 6th at the Riverside Outdoor Education Center on Prison Hill Road. More under Parks and Recreation at yumaaz.gov.",
        "start": 369.787,
        "end": 389.906
    },
    {
        "text": " It's Morning Edition from NPR News. I'm Michelle Martin. And I'm Layla Faudel. Four black women at Harvard University, including Harvard's first black president, Claudine Gay, have been accused of plagiarism by right-wing activists in recent months. Gay resigned as president in January under pressure that was compounded by her congressional testimony about confronting anti-Semitism on campus.",
        "start": 390.469,
        "end": 412.671
    },
    {
        "text": " Critics have also used plagiarism allegations to raise doubts about campus policies on diversity, equity, and inclusion. Philip Martin of member station GBH in Boston reports. Karen Mapp, a professor at Harvard's Graduate School of Education, has never been targeted.",
        "start": 412.671,
        "end": 428.234
    },
    {
        "text": " But she wonders aloud when they might come for her. Professor Mapp's reference to they is to right-wing activists who have leveled what she terms selective accusations of plagiarism against four black women at Harvard. Why is it only black women? It seems like, at least in the case of Harvard and some of the institutions I know,",
        "start": 428.575,
        "end": 448.985
    },
    {
        "text": " That seems to be who's being targeted. On March 20th, activist Christopher Ruffo posted on X, formerly Twitter, quote, Let's not ignore the pattern. This is the fourth black female CRT DEI scholar to be accused of plagiarism at Harvard, unquote. Critical race theory, or CRT, is a body of legal scholarship that delves into structural racism.",
        "start": 448.985,
        "end": 473.814
    },
    {
        "text": " Ruffo's accusations come after Claudine Gay testified before a Republican-led congressional committee looking into anti-Semitism. We reached out to Ruffo for the story. He's a senior fellow with the right-leaning Manhattan Institute. We received no response. His colleague, Ilya Shapiro, spoke with NPR. Claudine Gay is the apotheosis of the anti-intellectual movement.",
        "start": 473.814,
        "end": 498.08
    },
    {
        "text": " that values DEI identity and activism over truth-seeking merit and education. She is sort of the epitome of the crisis in higher education.",
        "start": 498.387,
        "end": 506.63
    },
    {
        "text": " A university investigation concluded Gay did not violate Harvard's research standards. In January, she resigned as Harvard president, but returned to faculty as professor of government at African American Studies. Ruffo then directed charges of plagiarism against Sherry Charleston, chief diversity officer, Shirley Green, Title IX coordinator, and Christina Cross, a sociology professor. Three more black women at Harvard. All declined comment.",
        "start": 506.834,
        "end": 533.524
    },
    {
        "text": " Writer Jonathan Bailey runs the online publication Plagiarism Today. Bailey says that while some citations in the published work of these four women may warrant a review, most do not amount to research misconduct. Conservatives obviously are not particularly fond of DEI programs, and they see this as a way to attack it.",
        "start": 534.241,
        "end": 555.913
    },
    {
        "text": " Bailey has exposed plagiarism in higher education for 18 years, and he laments that plagiarism, from his perspective, is being, quote, weaponized. This isn't a case where they're checking everyone and happen to be finding, you know, plagiarism in these DEI cases. They are literally focusing all of their effort on those cases and totally ignoring pretty much everyone else.",
        "start": 555.981,
        "end": 578.848
    },
    {
        "text": " I don't even know what to say. I don't. Professor Karen Mapp says she is stunned by attempts by right-wing activists to discredit black scholarship. I think if people want to come for you, they're going to come for you. I think the question is why. The answer is clear, says Barbara Ransby, professor of history at the University of Illinois at Chicago. There's certain people, certain ideas, certain bodies of scholarship.",
        "start": 579.121,
        "end": 603.029
    },
    {
        "text": " that are just undeserving, that don't fit into the sort of longstanding white supremacist patriarchal notion of the academy of brilliance, of intelligence. Khalil Gibran Muhammad, who teaches history at Harvard, says a broader conservative campaign is in motion.",
        "start": 603.302,
        "end": 621.425
    },
    {
        "text": " If these people have their way, they will criminalize even the ability to talk about race in America, let alone to track it or to study it or to look at the racial disparities that continue to be a fundamental threat to a functioning, healthy democracy. Professor Muhammad says we've already seen the banning of certain books and some black history courses in Florida and Texas. This followed Ruffo's success in redefining critical race theory.",
        "start": 621.425,
        "end": 648.695
    },
    {
        "text": " Ilya Shapiro of the Manhattan Institute scoffs at the suggestion that there is systemic racism. In terms of racial discrimination, I just, I don't see evidence of it. Shapiro notes two exceptions, especially in higher education.",
        "start": 649.343,
        "end": 662.671
    },
    {
        "text": " I do see great evidence of discrimination against Asian American applicants and white applicants. Sociologist Joan Donovan, an assistant professor of journalism and an expert on disinformation at Boston University, says opposition to DEI and race studies is all about white grievance. They believe having to go through the process as a white person, particularly as a white man, disadvantages them.",
        "start": 662.824,
        "end": 687.483
    },
    {
        "text": " And I think people who are white have this vision of whiteness as being more advantaged and therefore are owed these positions. Activists like Shapiro and Ruffo say they are seeking a return to, quote, the traditional core mission of higher education, unquote, which they characterize as colorblind.",
        "start": 687.483,
        "end": 709.531
    },
    {
        "text": " An undercurrent of white supremacy has also been the false assumption of black incompetence. Barbara Ransby says those declaring themselves to be colorblind while making selective plagiarism accusations should be viewed skeptically. We saw that during Reconstruction when black politicians finally assumed positions of leadership and there was a mockery made of their ability to speak, lead, legislate, etc.,",
        "start": 709.821,
        "end": 735.657
    },
    {
        "text": " Some of the kinds of character assassinations that we've seen on black women academics is a part of that larger context.",
        "start": 735.981,
        "end": 742.381
    },
    {
        "text": " Harvard University officials did not respond to NPR's request for comment, but in a statement, Frank Dobbin, Harvard Sociology Department chair, says the claims are, quote, bogus against the black women. Meanwhile, Christopher Ruffo, anonymous complainants, and the online publication Free Beacon are calling for more investigations, not only at Harvard, but also at MIT, UCLA, and Columbia University.",
        "start": 742.722,
        "end": 770.486
    },
    {
        "text": " Ransby says as an historian on race and gender, she would not be surprised if they came after her, too. Because that's the strategy is to bully and intimidate and make people silent and fearful. I think we have to name this moment of growing racism, repression and authoritarianism, which means we have to organize, not something academics are known for doing.",
        "start": 770.486,
        "end": 791.869
    },
    {
        "text": " Barbara Ransby says those academics may have little choice but to defend themselves as plagiarism and anti-DEI campaigns focused against black scholars escalate. For NPR News, I'm Philip Martin in Boston.",
        "start": 791.869,
        "end": 807.875
    },
    {
        "text": " This is Morning Edition from NPR News. Our theme music was inspired by BJ Lederman. I'm Lilo Faldin. And I'm Michelle Martin.",
        "start": 816.903,
        "end": 823.968
    },
    {
        "text": " This is 88.9 FM, KAWC Yuma, KAWP Parker, KAWC.org, and on the KAWC app, a service of Arizona Western College for more than 50 years, trusted news for Yuma and La Paz counties. Stay with us for more Morning Edition at 7 o'clock.",
        "start": 841.015,
        "end": 859.48
    },
    {
        "text": " The City of Yuma will host its Independence Day celebration on July 4th at Desert Sun Stadium. The family-friendly, non-alcoholic event starts at 6 in the evening and will feature food vendors, a DJ, and a foam party. Attendees are encouraged to bring their own chairs. Only clear bags will be allowed. And the celebration will conclude with fireworks at 9.",
        "start": 860.196,
        "end": 879.701
    },
    {
        "text": " Another breezy day here in southwest Arizona in Parker. Winds gusting up to 25 miles per hour today and tonight. The high this afternoon for Parker 111. The low tonight in Parker 81. In Yuma, the high today should be 110 with 20 mile per hour wind gusts today and tonight. The low tonight for Yuma around 84.",
        "start": 880.998,
        "end": 898.507
    },
    {
        "text": " Good morning. In a presidential campaign where age is an issue, 81-year-old Joe Biden debated 78-year-old Donald Trump. We'll get reaction from Gen Z leaders in both parties this hour on Morning Edition from NPR News.",
        "start": 901.015,
        "end": 913.899
    },
    {
        "text": " Many Democrats say they're worried about President Biden's performance last night. I'm Layla Faldin. And I'm Michelle Martin. We have a Democratic lawmaker for his reaction.",
        "start": 921.852,
        "end": 931.101
    },
    {
        "text": " Also this morning, we're watching the Supreme Court, which is expected to issue more big opinions today. And in this week's Story Court, two women find love at a ballroom dance class. It is Friday, June 28th. Happy birthday to sprinter Elaine Thompson-Hurrah. The five-time Olympic champion is 32 years old today. And the news is next.",
        "start": 935.845,
        "end": 958.2
    },
    {
        "text": " Live from NPR News in Washington, I'm Corva Coleman. President Biden will campaign today in North Carolina, and former President Donald Trump will campaign in Virginia after last night's debate. There's been a lot of response to President Biden's debate performance. He's been criticized for his raspy voice, his facial appearance, and moments where he appeared to lose his train of thought. NPR's Domenica Montanara says a lot of that concern is coming from Biden's fellow Democrats.",
        "start": 960.35,
        "end": 985.589
    },
    {
        "text": " The elephant in the room was that Democrats really were very nervous about the performance that Joe Biden gave. You know, people close to him on the record were talking about how this was a disappointing effort. You know, his campaign said that he had a cold. That's why his voice was hoarse. He sounded weak, somewhat feeble. And the problem with that is it plays into his key vulnerability, which is his age and his competency. NPR's Domenico Montanaro reporting.",
        "start": 985.589,
        "end": 1012.654
    },
    {
        "text": " Separately, Trump is getting criticism for making statements that were vague enough to be misleading, and then he lied. That includes Trump's comments about fraud in the 2020 presidential election, and Trump claimed that Biden encouraged Russia to invade Ukraine.",
        "start": 1012.654,
        "end": 1028.234
    },
    {
        "text": " Those statements are false. Iranians are voting to replace the late president, Ibrahim Raisi. He died last month in a helicopter crash. NPR's Peter Kenyon reports the contest features two conservative hardliners and one reformist candidate.",
        "start": 1028.234,
        "end": 1043.251
    },
    {
        "text": " Iran's Guardian Council, tasked with vetting candidates, approved six hardliners, but three have since dropped out in hopes of consolidating support behind a single candidate. Parliament Speaker Mohammad Bakr Khalibaf and former nuclear negotiator Saeed Jalili are seen as the top hardline contenders, while reform-minded voters may opt for Massoud Bazeshkian, the lone reformist in the race.",
        "start": 1043.251,
        "end": 1065.469
    },
    {
        "text": " Supreme Leader Ayatollah Ali Khamenei cast his vote shortly after the polls opened and once again called for high turnout. Voter disinterest in the election appears to be running high, however, with analysts saying Iranians have largely lost faith in the ballot box as a means of effecting change. Peter Kenyon, NPR News, Istanbul.",
        "start": 1065.469,
        "end": 1084.155
    },
    {
        "text": " Stocks opened higher this morning as the Commerce Department reported cooler inflation last month. NPR's Scott Horsley reports the Dow Jones Industrial Average rose about 100 points in early trading. Consumer prices in May were up 2.6% from a year ago, a smaller annual increase than the month before.",
        "start": 1084.206,
        "end": 1101.92
    },
    {
        "text": " That's according to the Commerce Department's inflation yardstick, which is closely watched by the Federal Reserve. Prices actually fell slightly between April and May, stripping out volatile food and energy costs. So-called core prices rose a scant one-tenth of one percent during the month.",
        "start": 1102.295,
        "end": 1118.319
    },
    {
        "text": " Personal income rose by half a percent last month, mainly thanks to rising wages. Personal spending rose just two-tenths of a percent. That allowed people to sock away a little bit more of their paychecks. The personal savings rate inched up to a still low 3.9 percent. Scott Horsley, NPR News, Washington. You're listening to NPR News.",
        "start": 1118.319,
        "end": 1138.985
    },
    {
        "text": " The Iowa Supreme Court has taken action on a state abortion law. The Iowa justices have overturned a temporary block, and they will allow a state law to take effect.",
        "start": 1140.452,
        "end": 1151.374
    },
    {
        "text": " It bans abortions in Iowa as soon as six weeks into pregnancy, before many women realize they are pregnant. The top education official in Oklahoma says he is requiring all public schools to teach the Bible to students. Beth Wallace of State Impact Oklahoma reports it's not clear how Superintendent Ryan Walter's mandate will work.",
        "start": 1151.681,
        "end": 1173.319
    },
    {
        "text": " Walters announced the policy change at Oklahoma's State Board of Education meeting Thursday, and he spoke more on it afterward. With the mandate today, we're the first state in the country to require the Bible be in every classroom and the Bible be taught from in every classroom. In a memo to school districts and comments to reporters, Walters clarified the mandate will apply in social studies and English and in fifth through 12th grades. He says more guidance is on the way.",
        "start": 1173.592,
        "end": 1198.473
    },
    {
        "text": " It's unclear whether the state superintendent has the authority to mandate the teaching of the Bible. Under Oklahoma state law, only school districts can make decisions on curriculum and materials. The directive is getting pushback from groups advocating for separation of church and state. For NPR News, I'm Beth Wallace in Tulsa. Sweltering heat is still bearing down on the middle of the country in the south.",
        "start": 1198.473,
        "end": 1222.381
    },
    {
        "text": " Almost the entire state of Oklahoma is under some sort of National Weather Service warning because of the soaring temperatures and rising heat index values. Kansas, Texas, and Louisiana are also going to be hot today. I'm Corva Coleman, NPR News, Washington. Support for NPR comes from NPR stations. Other contributors include Fisher Investments. As a fiduciary, Fisher Investments is obligated to act in their clients' best interest.",
        "start": 1222.381,
        "end": 1250.742
    },
    {
        "text": " Learn more at FisherInvestments.com. Investing in securities involves the risk of loss. This is NPR. It's 7.06. I'm Victor Calderon. Thank you for listening to NPR's Morning Edition here on KAWC. You can listen to us on your radio at 88.9 FM, on your computer at kawc.org, and on your smartphone on the KAWC app.",
        "start": 1251.084,
        "end": 1277.722
    },
    {
        "text": " Yuma Union High School District is hosting a federal student aid event at Somerton High School June 29th from 11 to 1. The event helps ensure that members of the class of 2024 have access to financial aid for post-secondary education. Individuals who have not completed their FAFSA will be able to get the document completed and submitted. On the next Living on Earth, tips from the CDC to help you stay safe on hotter, more dangerous days. We have a mantra.",
        "start": 1278.933,
        "end": 1305.964
    },
    {
        "text": " Stay cool, stay hydrated, know the symptoms. If you think you're staying cool and you're trying to stay hydrated, but your body's telling you things, you need to listen. I'm Ainsley O'Neill. Extreme heat and climate change, next time on Living on Earth from PRX. Monday evening at 7 on KWC, 88.9 FM.",
        "start": 1306.203,
        "end": 1326.032
    },
    {
        "text": " Throughout June, the Yuma County Library District will provide activities and featured resources at all branches. Events, author talks, and numerous clubs and classes for students of all ages are available for learning, exploration, and fun. Find details about all that is offered plus the calendar of events at yumalibrary.org.",
        "start": 1328.336,
        "end": 1347.176
    },
    {
        "text": " It's Morning Edition from NPR News. I'm Michelle Martin. And I'm Layla Faldin. Good morning. The current and former presidents of the United States debated last night for 90 minutes. And unlike the two times they met on stage in their last campaign, they did not interrupt each other. That's because the debate ground rules called for the mics to be muted. So for 90 minutes, Americans heard Joe Biden and Donald Trump in depth. On immigration, abortion, foreign policy, and the economy. Here is Biden. This is early in the CNN presidential debate.",
        "start": 1350.469,
        "end": 1379.599
    },
    {
        "text": " He rewarded the wealthy. He had the largest tax cut in American history, $2 trillion. He raised a deficit larger than any president has in any one term. He's the only president other than Herbert Hoover who's lost more jobs than he had when he began, since Herbert Hoover.",
        "start": 1379.991,
        "end": 1394.258
    },
    {
        "text": " And here's Trump moments later. The only thing he was right about is I gave you the largest tax cut in history. I also gave you the largest regulation cut in history. That's why we had all the jobs. And the jobs went down and then they bounced back. And he's taking credit for bounce back jobs. You can't do that. They also faced questions about their age and fitness for office. Either man would be the oldest president in U.S. history if sworn in next year. Here's Biden, who's 81. This guy's three years younger and a lot less competent.",
        "start": 1394.343,
        "end": 1421.22
    },
    {
        "text": " I think that just look at the record. Look at what I've done. Look how I've turned around the horrible situation he left me. And here's Trump, who's 78. I think I'm in very good shape. I feel that I'm as in good shape as I was 25, 30 years ago. Actually, I'm probably a little bit lighter, but I'm in as good a shape as I was years ago. I feel very good. I feel the same. So what might young voters make of it all? Here in the studio, we have Jack Lobel, national press secretary for the left-leaning group Voters of Tomorrow. Welcome. Thank you.",
        "start": 1421.22,
        "end": 1450.93
    },
    {
        "text": " And on the line, we have Joe Mitchell. He's the head of Run Gen Z, which encourages young conservatives to run for office. And he walks that talk. Joe Mitchell is also a former Iowa state lawmaker. Welcome. Good morning, Linda. So, Jack, let's start with you. We saw President Biden last night, whose voice was raspy at times. He would trail off. Sometimes he was hard to follow. As both a Democrat and a young voter, what did you make of President Biden's performance?",
        "start": 1450.93,
        "end": 1478.2
    },
    {
        "text": " Yeah. President Biden seemed old, but he's an old guy with a record of fighting for Gen Z. He has delivered on all of our top issues and has a compelling vision for what he wants to do for us in a second term. Meanwhile, Donald Trump was similarly old seeming, but he is a felon. He is he has been found liable of sexual assault.",
        "start": 1478.643,
        "end": 1502.193
    },
    {
        "text": " and he would restrict abortion access and access to other forms of healthcare. That is not a vision that resonates with Gen Z, and that's why I'm still going to be voting for President Biden in 2024. Joe, I want to turn to you and talk about Donald Trump. He rattled off statements throughout the debate that simply weren't true and were left unchecked. How did he come across to you? Well, I mean, first of all, the hardest job today in America is to defend that bait for Joe Biden. I mean, I think the fact-checking",
        "start": 1502.193,
        "end": 1531.766
    },
    {
        "text": " That, you know, analysis and panelists talked about afterwards that need to be happening on both sides. And so it was pretty skewed, the criticism towards that. But, I mean, altogether, we saw in that debate stage last night that Joe Biden does not belong on a debate stage. He does not belong in the Oval Office. He belongs in a nursing home.",
        "start": 1532.039,
        "end": 1550.401
    },
    {
        "text": " And Donald Trump stayed on message. He talked about inflation. He talked about the economy, talked about the open border and the crisis that's happening there. And Joe Biden clearly just didn't have a message at all. And his own vice president couldn't defend his performance. So it was truly something sad to see for the country. And ultimately, Donald Trump went away with a knockout win in the first round.",
        "start": 1550.401,
        "end": 1573.336
    },
    {
        "text": " Now, I will say, although unauthorized crossings hit a record high under Biden, the border's not fully open. It's arguably more reinforced than ever. But I'm going to talk to ask you both about these two candidates. You're both young voters. Is this a matchup that works for young voters? I'll start with you, Jack.",
        "start": 1573.507,
        "end": 1590.162
    },
    {
        "text": " Yeah, it is. We have one president who has given Gen Z a seat at the table, someone who Gen Z can push and who listens to us. He's delivered the American Climate Corps, the Inflation Reduction Act, and the Office of Gun Violence Prevention only because Gen Z voted in 2020, and then President Biden listened to our voices since he's taken office. Meanwhile, Donald Trump...",
        "start": 1590.401,
        "end": 1612.056
    },
    {
        "text": " has shut us out of the room and would continue to do so during his second term. Young voters have a very clear choice in November, and Voters of Tomorrow is going to do everything we can to make sure Gen Z is educated about the issues at hand that are on the ballot in 2024 and ensure that Gen Z uses their voices. And so you see Biden as the right candidate for Gen Z? Yes, that is correct. And Joe, what about you? Is this a matchup that makes sense for young voters?",
        "start": 1612.056,
        "end": 1640.657
    },
    {
        "text": " Yeah, I mean, young voters are smart. They see through all this, and that's why you see President Trump's poll numbers with young voters better than any other modern-day Republican nominee ever. And that's because young voters see that the price of housing is going up, the price of groceries are going up. You should not have to go to the grocery store and have anxiety to go buy a carton of eggs or a gallon of milk.",
        "start": 1640.998,
        "end": 1662.585
    },
    {
        "text": " And so that is what's happening right now is young voters are seeing with their own eyes how difficult it is to live in Joe Biden's America. And so that's why Donald Trump is going to prevail in November. And last night was just a snippet of what's going to happen over the next 18 weeks before the election. Do you think the candidates spoke enough about issues important to young voters last night? Jack, I'll start with you.",
        "start": 1662.585,
        "end": 1684.855
    },
    {
        "text": " Yeah. President Biden talked about making necessities more affordable, housing, education, health care. He also talked about protecting abortion rights, which is one of Gen Z's top issues and something that fueled us to go to the polls in 2022. President Biden has brought Gen Z into the room where decisions happen. So even though he's not a Gen Z-er, Gen Z still feels like they have a voice in the White House. And that's really important. Meanwhile, Donald Trump shuts us out.",
        "start": 1684.957,
        "end": 1713.234
    },
    {
        "text": " And that presents a clear contrast that young people can truly see. And Joe, did you feel that the candidates spoke enough about issues that young voters wanted to hear about? Yeah, I mean, again, President Trump was on message the whole time talking about his four years versus the last four years of Biden and talking about the inflation crisis, the economy. And on the abortion subject, President Trump was actually really on message. I was really impressed by his answer that he had.",
        "start": 1713.234,
        "end": 1741.135
    },
    {
        "text": " Jack Lobel of Voters for Tomorrow, thank you for being here. Yeah, thanks for having me. And Joe Mitchell, head of RUN Gen Z, thank you for taking the time. Yeah, thanks, Layla. Now we're going to turn to NPR political reporter Elena Moore because she's been focusing her reporting on new voters in youth politics, and she's also here with us. Good morning to you. Good morning. What stood out to you? What did you hear?",
        "start": 1742.005,
        "end": 1763.234
    },
    {
        "text": " I mean, I think it makes sense that Jack is highlighting Biden's record prevailing over worries about his age, while Joe is criticizing the same the same issue here. And throughout the campaign, we've heard concern about both these men's ages. They're pretty similar in age, but.",
        "start": 1763.404,
        "end": 1778.848
    },
    {
        "text": " Biden is a few years older and it has been a bigger concern. The Biden campaign has pushed back against that concern and said, look at his record, look at his political tenure. But this debate was an opportunity to assuage some of those worries and come out really strong against Trump. And we didn't appear to see that.",
        "start": 1778.848,
        "end": 1797.978
    },
    {
        "text": " Plus, you know, I don't think either candidate directly spoke to young voters. Trump has less to lose here because the voter the voting block is less part of his base. But Biden, you know, he brought up a few things related to the environment, which we know are issues that an issue young people care about. But on a topic like abortion, which we know motivates young people to turn out, that message was muddy, Michelle.",
        "start": 1797.978,
        "end": 1819.753
    },
    {
        "text": " It isn't something he seems to really like talking about. His record might be one thing, but whether he wants to talk about it or not. Well, talk about being on message. Both Joe and Jack very much were, as one would expect, because they're living in this space as advocates. But what are you hearing on the road? I'm interested in what you're hearing when you kind of go out and talk to voters who don't perhaps pay as much attention to these issues as these guys do. I would say outside the organizer space, that sentiment, it's much...",
        "start": 1819.753,
        "end": 1845.077
    }
]