[
    {
        "text": " Whiskey got me married",
        "start": 47.739,
        "end": 49.411
    },
    {
        "text": " Hi, I'm Elliot, and here's this week's live blues calendar. Wednesday, July 10th, the Gail Harrod Band is at Tacoma Station Tavern, Northwest D.C., from 6 to 9 p.m. Connor and the Lost Souls are at JV's Restaurant, Falls Church, Virginia, at 8. And Tom's Star Band is at the Cat's Eye Pub, Fells Point, Baltimore, at 8. Thursday, July 11th, Linwood, Taylor, and Stillstand are at Baby's Boys Tavern, Waldorf, Maryland, at 7.",
        "start": 69.701,
        "end": 95.981
    },
    {
        "text": " Reuben Montoya Band is at the Cat's Eye Pub, Fells Point, Baltimore at 8. And Soul Roots is at JV's Restaurant, Falls Church, Virginia at 8.30. Friday, July 12th, Gabe Stillman Band is at Old Bowie Town Grill, Bowie, Maryland at 6.30. Mary Shaver and Michael Tash Band is at Concert in the Park, Edmondson, Maryland at 7.00. The Bone Shakers are at the Avenue at White Marsh, White Marsh, Maryland at 7.00.",
        "start": 97.073,
        "end": 123.08
    },
    {
        "text": " and Carl Stoll and the Danger Zone are at J.B.'s restaurant, Falls Church, Virginia, at 8.30. Saturday, July 13th, Rick Franklin is at Lubber Run Farmer's Market, Arlington, Virginia, at 8.30. And the Big Funky Blues Festival is being held at Deep Creek Lake from 11 a.m. to 9 p.m. with Hambone Wilson, Billy Price Band, Tommy Lepson and the Bad Dogs, Sonny Petrosky's Don't Tell Susie, The Bone Shakers,",
        "start": 123.865,
        "end": 153.131
    },
    {
        "text": " the Music Cafe Tribute Band featuring Patty Reese, Jonathan Sloan, Dave Chappell, Sonny Prachoski, Tommy Lubson, and Darren Blessman, as well as Deanna Bogart and Paul Reed Smith's 8-Lock Band. For more information, go to BigFunkyBluesFest.com.",
        "start": 153.592,
        "end": 170.708
    },
    {
        "text": " Sunday, July 14th, Steve Kramer and the Bluesicians are at the Cat's Eye Pub, Fells Point, Baltimore at 4. Bad Influence is at Earps Ordinary, Fairfax, Virginia at 6. Billy Price Band is at Hank Dittles Tavern in Rockville, Maryland at 6.",
        "start": 171.817,
        "end": 185.623
    },
    {
        "text": " Bobby Thompson Band is at JV's Restaurant, Falls Church, Virginia at 8.30. Monday, July 15th, Nucleus and Friends Band 5G is at Westminster Church, Southwest DC at 6.00. And Wolf's Blues Show and Sit-In Jam with Linwood Taylor's at Hank Theodore's Tavern, Rockville, Maryland at 7.00. If you know of any future blues shows, you can email me the details at radio at elliottgross.com. Now get out and enjoy some live blues.",
        "start": 186.459,
        "end": 212.466
    },
    {
        "text": " All right. Y'all heard Elliot. Get out and enjoy some live blues. Support the live blues. And y'all know that's what we do here. We support it and we promote it. We perpetuate it, keep it going. Also, each and every Wednesday over at Old Bowie Town Grill, y'all check that out. The Blues Jam starts at 7 p.m.",
        "start": 216.015,
        "end": 235.93
    },
    {
        "text": " Go on over there and support those musicians over there. Just listen to some great music. Meet some new folks if you haven't been there or enjoy some folks that you already know. Get out there and socialize and keep the blues alive.",
        "start": 235.93,
        "end": 252.09
    },
    {
        "text": " Let's see what else I got going on here. I don't know. Well, hey, look, if y'all listen to the preceding program, We the People with David Whetstone.",
        "start": 253.37,
        "end": 268.439
    },
    {
        "text": " Yeah, he was talking about that. He had a guest and they were talking about the plastic and all that stuff. And so I want to throw this song out there about plastic. Y'all heard it before. My good friend Mark Mule Man Massey. Don't do nothing with that plastic stuff.",
        "start": 268.899,
        "end": 287.142
    },
    {
        "text": " Been working all my life, trying to get it right And now they're telling me it's time to go But before y'all lay me down in that cold, cold ground There's something I want everyone to know Don't put no plastic flowers on my grave I don't care how much money you can save",
        "start": 307.79,
        "end": 336.152
    },
    {
        "text": " Make sure my tombstone ain't made of styrofoam. Don't put no plastic flowers on my grave. Except no substitute like phony mohair suits. Rolex watches made in Tokyo. Imitation diamond rings and instant everything. Remember all that glitters is not gold.",
        "start": 337.261,
        "end": 365.52
    },
    {
        "text": " Don't put no plastic flowers on my grave I don't care how much money you can save Make sure my tombstone ain't made of styrofoam Don't put no plastic flowers on my grave",
        "start": 366.732,
        "end": 385.316
    },
    {
        "text": " On seats of Nagahat In a little limousine made in Japan Just load me in the back of a long black Cadillac Make sure that everybody understands Don't put no plastic flowers on my grave I don't care how much money you can save",
        "start": 418.183,
        "end": 444.036
    },
    {
        "text": " Make sure my tombstone ain't made of styrofoam Don't put no plastic flowers on my grave Don't put no plastic flowers on my grave I don't care how much money you can save Make sure my tombstone ain't made of styrofoam Don't put no plastic flowers on my grave",
        "start": 445.009,
        "end": 473.302
    },
    {
        "text": " Don't put no plastic flowers on my grave And I don't care how much money you can save Make sure my tombstone ain't made of styrofoam Don't put no plastic flowers on my grave",
        "start": 474.377,
        "end": 494.565
    },
    {
        "text": " I got up this morning My first day on a new job I got in my car And my car wouldn't start I went outside I got my bike I was determined to make this gig Even if I have to hitchhike I was done about 15 miles an hour I went missing out I got three blacks up the street",
        "start": 506.681,
        "end": 536.254
    },
    {
        "text": " And the damn chain broke. I just keep on running. Running in the closed door. Mama sure was right. She said, son, when it rained, it poured.",
        "start": 536.783,
        "end": 557.415
    },
    {
        "text": " Me and some friends of mine went bowling one night, and I was bragging about my stroke. When my turn came, I dropped the ball on my toe. I had this woman with me, but I was trying to impress. I bought her a drink, y'all is spilling on her dress. If it ain't one thing, y'all is another thing.",
        "start": 562.739,
        "end": 589.309
    },
    {
        "text": " I spent my last penny on her. She told me she had a full-time lover. I just keep on running, running in the closed door. Mama sure was right. She said, son, when it rained, it poured.",
        "start": 590.64,
        "end": 613.456
    },
    {
        "text": " My woman called me. She said, where you got around town? I bought me going with her best friend. And she was going to put me down. I left the house feeling bad. Headed to a poker game. I figured sooner or later, my luck has got to change. I took a shortcut through the alley. And oh, it's a crying chain.",
        "start": 618.677,
        "end": 646.015
    },
    {
        "text": " Somebody hit me on my head and took my last piece of chain. I just keep on running, running in the cold door. Mama sure was right. She said, son, when it rained, it poured.",
        "start": 646.92,
        "end": 670.128
    },
    {
        "text": " When it rains On and really pour I just keep on running, keep on running Running in the cold door Mama sure was right She said, son, when it rains it pours",
        "start": 674.838,
        "end": 704.002
    },
    {
        "text": " blues again tonight running through my head i got the 12-5 blues again tonight running through my head well i guess i better hit all 12 if i want to get home to",
        "start": 726.834,
        "end": 742.193
    },
    {
        "text": " Off at Big John's Tavern, go hear Butter and the Boys. Lots of happy people there, making lots of noise. Head on down to Easy Street, to the corner of Shuck and Jive. There's a bunch of funky blues joints there, I can maybe stomach five. Got your 12-bar blues again tonight, I'm feeling mighty loud.",
        "start": 743.899,
        "end": 770.828
    },
    {
        "text": " and the maple leaf and the swank and the dew drop in there's a club to lease where john lee plays one scotch one bourbon one gin yes i have to hit one more well it's got to be the zoo i have an l and a beer and talk to steve try not to think of you",
        "start": 795.128,
        "end": 817.022
    },
    {
        "text": " We'll be right back.",
        "start": 868.456,
        "end": 868.882
    },
    {
        "text": " Thank you.",
        "start": 896.135,
        "end": 900.691
    },
    {
        "text": " Thank you.",
        "start": 943.916,
        "end": 962.568
    },
    {
        "text": " Won't buy no car, but the price ain't right. Ha, ha, ha, ha. Vietnam's like cheapo. There's a war. Start riding a bike. Make a little kind of pie.",
        "start": 1014.343,
        "end": 1029.838
    },
    {
        "text": " One more time. One more time. One more time. One more time. One more time. One more time.",
        "start": 1042.944,
        "end": 1063.319
    },
    {
        "text": " Got to go to a disco, free trouble away. Dance to the music that a DJ play. Get a license hall, well, they can do what they want. Go home and play some music that don't sound too good.",
        "start": 1071.886,
        "end": 1098.114
    },
    {
        "text": " One more time! One more time!",
        "start": 1100.725,
        "end": 1121.118
    },
    {
        "text": " It's a real hellfire It's a real hellfire It's a real hellfire",
        "start": 1131.852,
        "end": 1142.244
    },
    {
        "text": " Say what? What?",
        "start": 1168.626,
        "end": 1172.142
    },
    {
        "text": " All right, all right, ladies and gentlemen. Thanks for tuning in to the Wednesday edition of Don't Forget the Blues. Clarence the Bluesman turning here. Look, it's about that time for me to get on out of here. So y'all know before I go, I got to say this one thing to you, and I say it three times. I love you, I love you, I love you. Y'all get out there, spread the love, share the love.",
        "start": 1321.681,
        "end": 1341.084
    },
    {
        "text": " And now is the time. The time is always now. So do it now. The people that you love, you tell them that you love them because you don't know what tomorrow's going to bring. Yesterday ain't going to happen again. So do it now. And I'm doing it. Thank you so much for tuning in. Special shout out to Sir Charles. And give it up for Charlie. Thank you so much for tuning in and listening. Bill, I got you. I got you, Bill. I'm doing swell. Hey, look, Clarence the Bluesman Turner.",
        "start": 1341.084,
        "end": 1367.995
    },
    {
        "text": " I am out. Thank you. Love you so much. And time is a precious thing.",
        "start": 1367.995,
        "end": 1390.572
    },
    {
        "text": " Life rearranges All of our best laid plans Better say what's in your heart You might not get another chance So tell them you love them",
        "start": 1404.838,
        "end": 1432.91
    },
    {
        "text": " And do it today. Don't wait for tomorrow. Don't wish one day away. Don't wish one day away. Oh, no. Have you taken folks for granted?",
        "start": 1435.725,
        "end": 1457.585
    },
    {
        "text": " It's too late to say sorry When they're sleeping in the ground So tell them you love them And do it today Don't wait",
        "start": 1466.664,
        "end": 1491.288
    },
    {
        "text": " Don't wish one day",
        "start": 1499.855,
        "end": 1501.152
    },
    {
        "text": " For WPFW in Washington and WBAI New York, I'm Chris Spinger-Drowns with some brief news headlines.",
        "start": 1526.374,
        "end": 1535.247
    },
    {
        "text": " The Israeli military ordered the full evacuation of Gaza City today, pushing ahead with a renewed offensive in the city that has killed dozens of people over the past two days. The heightened offensive comes as U.S., Egyptian, and Qatari mediators are meeting with Israeli officials in Qatar today. CIA Director Bill Burns met with Egypt's president in Cairo yesterday to discuss the negotiations.",
        "start": 1536.34,
        "end": 1561.203
    },
    {
        "text": " Hamas warned that the Israeli operation in Gaza City could cause ceasefire talks to collapse despite apparent recent progress in negotiations.",
        "start": 1561.34,
        "end": 1571.032
    },
    {
        "text": " South Gaza City had been the focus of Israeli operations early in the nine-month war, but militants appear to have regrouped there after an earlier Israeli withdrawal. The official death toll in Gaza is over 38,000 people, but a new study from the Lancet medical journal estimates that as many as 186,000 deaths could be attributable to the war in Gaza, including indirect deaths caused by food and water shortages and disease.",
        "start": 1571.271,
        "end": 1599.838
    },
    {
        "text": " The report estimates that about 10,000 dead bodies are still buried in rubble. In domestic news, late yesterday, a seventh elected Democrat called on President Biden to stand down as the party's candidate in the November election, following a day of closed-door meetings. New Jersey Rep. Mickey Sherrill said Biden should step aside because in an election against Trump, \"...the stakes are too high and the threat is too real to stay silent.\"",
        "start": 1599.838,
        "end": 1629.633
    },
    {
        "text": " Biden and his aides have been pushing hard to convince Democrats to back the president following his disastrous debate performance last month. Biden has refused to step aside, and in a letter to lawmakers earlier this week, he said he still believes he is the candidate best suited to beat Trump in November.",
        "start": 1629.923,
        "end": 1647.483
    },
    {
        "text": " Yesterday's meetings between lawmakers were closed door, but anonymous sources and multiple media outlets said many lawmakers continue to express doubts about Biden's ability to lead the party and to win the November election.",
        "start": 1647.483,
        "end": 1660.964
    },
    {
        "text": " Two Democratic senators announced yesterday that they are seeking a criminal investigation of Supreme Court Justice Clarence Thomas over gifts of travel, a loan for a recreational vehicle, and other benefits he received from billionaire Harlan Crow and other wealthy benefactors.",
        "start": 1662.312,
        "end": 1679.036
    },
    {
        "text": " Senator Sheldon Whitehouse, a member of the Judiciary Committee, and Senator Ron Wyden, chair of the Senate Finance Committee, released a letter to Attorney General Merrick Garland citing, quote, \"...evidence of repeated and willful omission of gifts and income from Justice Thomas's financial disclosure reports,\" end quote, which they said were required by the Ethics in Government Act.",
        "start": 1679.036,
        "end": 1702.261
    },
    {
        "text": " While it is unclear if Garland will actually grant White House and Wyden's request, the letter reflects an escalation in efforts by Democratic senators to address ethics controversies related to Thomas and the court in recent years.",
        "start": 1702.261,
        "end": 1716.015
    },
    {
        "text": " And over a million and a half homes and businesses are still without power in Texas, as the remnants of Hurricane Beryl churn north through the United States. Beryl struck south Texas on Monday as a Category 1 hurricane, but weakened to a post-tropical cyclone over southeastern Michigan around noon today. A flood watch is in effect for portions of New York, Vermont, Illinois, and other central or northeastern states.",
        "start": 1717.278,
        "end": 1743.49
    },
    {
        "text": " A tornado was reported in southwestern Indiana, where a warehouse collapsed and roofs were torn off buildings. Beryl has killed at least eight people in the U.S., one in Louisiana and six in Texas. It killed at least 11 people in the Caribbean when it became the earliest Category 5 storm on record in the Atlantic.",
        "start": 1743.49,
        "end": 1763.968
    },
    {
        "text": " Weather in Washington, D.C. right now is 94 degrees and mostly cloudy. In New York City, 88 degrees with fair skies. For WPFW in Washington and WBAI New York, I'm Chris Bengert-Drowns. Thanks for listening.",
        "start": 1765.503,
        "end": 1783.131
    },
    {
        "text": " Welcome to Africa Now.",
        "start": 1802.005,
        "end": 1804.172
    }
]