[
    {
        "text": " Stomp, you're right. Jump up, now shake your butt. That's DC Strut. I think I'm going to turn on WPFW. Cowboy Fred on the radio, talking about my show. Saying I'm in town, and that's the place to go.",
        "start": 11.152,
        "end": 32.125
    },
    {
        "text": " But y'all know D.C., the traffic sucks. Get the hell out the way. Time to do what? Do the D.C. strut. Let's stretch y'all. Oh, come on, put your back into it. Yeah. Stomp with your left foot. Stomp with your right. Jump up. Now",
        "start": 33.677,
        "end": 55.555
    },
    {
        "text": " Ah, shake it, shake it. Step off the curb, look here's the bus. Step back up, cause it's speeding up. It's out of service, oh what the. What we gotta do, we do the DC strut. Let's stretch y'all.",
        "start": 75.947,
        "end": 99.974
    },
    {
        "text": " It's strong if you're right",
        "start": 109.889,
        "end": 112.329
    },
    {
        "text": " Ain't no party like a D.C. party, cause a D.C. party don't stop. Ain't no party like a D.C. party, cause a D.C. party don't stop. Ain't no party like a D.C. party, cause a D.C. party don't stop. Come on, y'all! Ain't no party like a D.C. party, cause a D.C. party don't stop. Northwest! Party hard! Southwest! Party hard! Northeast! Party hard!",
        "start": 133.097,
        "end": 155.367
    },
    {
        "text": " For me to fall in love with you But I was young I know not what I want I want to do And I lived and I learned And now, and now I know it's true That I simply can't be without you",
        "start": 188.285,
        "end": 215.213
    },
    {
        "text": " black is white when the evening sky it turns to light and I have seen the death of your love from your eyes of green and I lived and I learned and now and now I know it's true that I simply can't",
        "start": 219.565,
        "end": 249.019
    },
    {
        "text": " Without you",
        "start": 249.838,
        "end": 250.879
    },
    {
        "text": " So let's take some time. Just you and I holding hands. And I'll tell you why. I want to be your forever man. Cause I live and I learn. And now in",
        "start": 280.009,
        "end": 303.166
    },
    {
        "text": " Yes, Lord, I know it's true that I simply can't be without you.",
        "start": 307.995,
        "end": 331.869
    },
    {
        "text": " Shakin' bacon down the street It's good to feel you next to me Music blastin' down on the bill And later on, when things get real I want you to come on over here and sue me, baby When you smile like that, it drives me crazy Just kiss me, baby",
        "start": 357.585,
        "end": 385.964
    },
    {
        "text": " Just kiss me, baby Puffin' love and holding hands I wanna tell the world that I'm your man Spin you around and watch you dance Tonight I'm gonna take a chance Come on over here and soothe me, baby",
        "start": 389.087,
        "end": 416.186
    },
    {
        "text": " Cause when you smile like that, you drive me crazy. Just kiss me, baby. Just kiss me, baby. Listen, honey. Girl, you really move me, thrill me. When you do, do, do, do me. Yeah, you really see me, ooh.",
        "start": 417.585,
        "end": 443.473
    },
    {
        "text": " Woo, woo, woo me Just kiss me, baby Just kiss me, baby I've been loving all over You just gotta feel it",
        "start": 445.862,
        "end": 468.797
    },
    {
        "text": " When you do, do, do, do me Girl you really see me When you woo, woo, woo, woo me Just kiss me baby Just kiss me baby Just give a little bit of sugar",
        "start": 480.691,
        "end": 507.892
    },
    {
        "text": " Come on, just kiss me, baby Just kiss me, baby Just kiss me, baby Come on, come on, come on, come on, come on, come on Just kiss me, baby",
        "start": 508.746,
        "end": 528.916
    },
    {
        "text": " Yeah, Kiss Me Baby. That was something brand new from the, what's his name, Sonny Gouledge. Go Be Free. Yeah, that's off the Blind Pig record label.",
        "start": 532.312,
        "end": 553.046
    },
    {
        "text": " Yep, they got something new. I dig it. Y'all dig it. If you do, look it up. Buy it. Support the blues, y'all. That's what we got to do. Keep the blues alive. And that's what we do right here each and every weekday from noon to 1. Keeping the blues alive. Keeping it in your mind and in your heart. Just delivering the blues.",
        "start": 553.353,
        "end": 577.654
    },
    {
        "text": " Whiskey got me married It said her love was true Whiskey got me married It said her love was true You know I hate to blame it",
        "start": 590.879,
        "end": 616.732
    },
    {
        "text": " But it told me what to do Johnny Walker Cinnamon brunette That night in Vegas I won't forget She was a cold-blooded kisser",
        "start": 618.404,
        "end": 642.159
    },
    {
        "text": " I tried to run, but the bottle said the trap. Yes, it did.",
        "start": 651.852,
        "end": 660.282
    },
    {
        "text": " The glass was tall Her little legs were long She moved in fast And came on strong Lord, that night The liquor called the shots One sip led to another",
        "start": 699.906,
        "end": 726.442
    },
    {
        "text": " We're tired tonight",
        "start": 729.309,
        "end": 731.015
    },
    {
        "text": " Whiskey got me married",
        "start": 791.408,
        "end": 793.268
    },
    {
        "text": " Hi, I'm Elliot, and here's this week's live blues calendar. Wednesday, July 10th, the Gail Harrod Band is at Tacoma Station Tavern, Northwest D.C., from 6 to 9 p.m. Connor and the Lost Souls are at JV's Restaurant, Falls Church, Virginia, at 8. And Tom's Star Band is at the Cat's Eye Pub, Fells Point, Baltimore, at 8. Thursday, July 11th, Linwood, Taylor, and Stillstand are at Baby's Boys Tavern, Waldorf, Maryland, at 7.",
        "start": 813.404,
        "end": 839.701
    },
    {
        "text": " Reuben Montoya Band is at the Cat's Eye Pub, Fells Point, Baltimore at 8. And Soul Roots is at JV's Restaurant, Falls Church, Virginia at 8.30. Friday, July 12th, Gabe Stillman Band is at Old Bowie Town Grill, Bowie, Maryland at 6.30. Mary Shaver and Michael Tash Band is at Concert in the Park, Edmondson, Maryland at 7.00. The Bone Shakers are at the Avenue at White Marsh, White Marsh, Maryland at 7.00.",
        "start": 840.776,
        "end": 867.193
    },
    {
        "text": " and Carl Stoll and the Danger Zone are at J.B.'s restaurant, Falls Church, Virginia, at 8.30. Saturday, July 13th, Rick Franklin is at Lubber Run Farmer's Market, Arlington, Virginia, at 8.30. And the Big Funky Blues Festival is being held at Deep Creek Lake from 11 a.m. to 9 p.m. with Hambone Wilson, Billy Price Band, Tommy Lepson and the Bad Dogs, Sonny Petroski's Don't Tell Susie, The Bone Shakers,",
        "start": 867.551,
        "end": 896.749
    },
    {
        "text": " the Music Cafe tribute band featuring Patty Reese, Jonathan Sloan, Dave Chappell, Sonny Prachoski, Tommy Lubson, and Darren Blessman, as well as Deanna Bogart and Paul Reed Smith's 8-Lock Band. For more information, go to BigFunkyBluesFest.com.",
        "start": 897.312,
        "end": 914.616
    },
    {
        "text": " Sunday, July 14th, Steve Kramer and the Bluesicians are at the Cat's Eye Pub, Fells Point, Baltimore at 4. Bad Influence is at Earps Ordinary, Fairfax, Virginia at 6. Billy Price Band is at Hank Dittles Tavern in Rockville, Maryland at 6.",
        "start": 915.538,
        "end": 929.326
    },
    {
        "text": " Bobby Thompson Band is at JV's Restaurant, Falls Church, Virginia at 8.30. Monday, July 15th, Nucleus and Friends Band 5G is at Westminster Church, Southwest DC at 6.00. And Wolf's Blues Show and Sit-In Jam with Linwood Tailors at Hank Theudel's Tavern, Rockville, Maryland at 7.00. If you know of any future blues shows, you can email me the details at radio at elliottgross.com. Now get out and enjoy some live blues.",
        "start": 930.179,
        "end": 956.049
    },
    {
        "text": " All right. Y'all heard Elliot. Get out and enjoy some live blues. Support the live blues. And y'all know that's what we do here. We support it and we promote it. We perpetuate it, keep it going. Also, each and every Wednesday over at Old Bowie Town Grill, y'all check that out. The Blues Jam starts at 7 p.m. Go on over there and support those musicians over there. Just listen to some great music.",
        "start": 959.701,
        "end": 985.316
    },
    {
        "text": " Meet some new folks if you haven't been there or enjoy some folks that you already know. Get out there and socialize and keep the blues alive. Let's see, what else I got going on here? I don't know. Well, hey, look, if y'all listen to the preceding program, We the People with David Whetstone,",
        "start": 985.316,
        "end": 1012.534
    },
    {
        "text": " Yeah, he was talking about that. He had a guest and they were talking about the plastic and all that stuff. And so I want to throw this song out there about plastic. Y'all heard it before. My good friend Mark Mule Man Massey. Don't do nothing with that plastic stuff.",
        "start": 1012.534,
        "end": 1030.845
    },
    {
        "text": " Been working all my life, trying to get it right And now they're telling me it's time to go But before y'all lay me down in that cold, cold ground There's something I want everyone to know Don't put no plastic flowers on my grave I don't care how much money you can save",
        "start": 1051.51,
        "end": 1079.855
    },
    {
        "text": " Make sure my tombstone ain't made of styrofoam. Don't put no plastic flowers on my grave. Except no substitute like phony mohair suits. Rolex watches made in Tokyo. Imitation diamond rings and instant everything. Remember all that glitters is not gold.",
        "start": 1080.981,
        "end": 1109.224
    },
    {
        "text": " Don't put no plastic flowers on my grave I don't care how much money you can save Make sure my tombstone ain't made of styrofoam Don't put no plastic flowers on my grave",
        "start": 1110.435,
        "end": 1129.053
    },
    {
        "text": " On seats of Nagahat In a little limousine made in Japan Just load me in the back of a long black Cadillac Make sure that everybody understands Don't put no plastic flowers on my grave I don't care how much money you can save",
        "start": 1161.886,
        "end": 1187.705
    },
    {
        "text": " Make sure my tombstone ain't made of styrofoam Don't put no plastic flowers on my grave Don't put no plastic flowers on my grave I don't care how much money you can save Make sure my tombstone ain't made of styrofoam Don't put no plastic flowers on my grave",
        "start": 1188.712,
        "end": 1217.005
    },
    {
        "text": " Don't put no plastic flowers on my grave. And I don't care how much money you can save. Make sure my tombstone ain't made of styrofoam. Don't put no plastic flowers on my grave.",
        "start": 1218.063,
        "end": 1238.592
    },
    {
        "text": " I got up this morning My first day on a new job I got in my car And my car wouldn't start I went outside I got in my bike I was determined to make this gig Even if I have to hitchhike I was done about 15 miles an hour I wasn't missing out I got three blocks up the street",
        "start": 1250.384,
        "end": 1279.94
    },
    {
        "text": " And the damn chain broke. I just keep on running. Running in the closed door. Mama sure was right. She said, son, when it rained, it poured.",
        "start": 1280.486,
        "end": 1301.118
    },
    {
        "text": " Me and some friends of mine went bowling one night, and I was bragging about my stroke. When my turn came, I dropped the ball on my toe. I had this woman with me, but I was trying to impress. I bought her a drink, y'all is spilling on her dress. If it ain't one thing, y'all is another thing.",
        "start": 1306.425,
        "end": 1333.029
    },
    {
        "text": " I spent my last penny on her She told me she had a four-time lover I just keep on runnin' Runnin' in the closed door Mama sure was right She said, son, when it rained it poured",
        "start": 1334.36,
        "end": 1357.193
    },
    {
        "text": " My woman called me. She said, what have you got around town? I bought me gold with her best friend. And she was going to put me down. I left the house feeling bad. Headed to a poker game. I figured sooner or later, my luck has got to change. I took a shortcut through the alley. And oh, it's a crying chain.",
        "start": 1362.415,
        "end": 1389.701
    },
    {
        "text": " Somebody hit me on my head and took my last piece of chain. I just keep on running, running in the cold door. Mama Jo was right. She said, son, when it rained, it poured.",
        "start": 1390.64,
        "end": 1413.848
    },
    {
        "text": " When it rains On and really pour I just keep on running, keep on running Running in the cold door Mama sure was right She said, son, when it rains it pours",
        "start": 1418.524,
        "end": 1447.705
    },
    {
        "text": " We'll be right back.",
        "start": 1470.623,
        "end": 1492.602
    },
    {
        "text": " Lots of happy people there, making lots of noise. Head on down to Easy Street, to the corner of Shuck and Jive. There's a bunch of funky blues joints there, I can maybe stomach five. Got your 12-bar blues again tonight, I'm feeling mighty low.",
        "start": 1493.2,
        "end": 1514.787
    },
    {
        "text": " and the maple leaf and the swank and the dew drop in there's a club to lease where john lee plays one scotch one bourbon one gin yes i have to hit one more well it's got to be the zoo i have an l and a beer and talk to steve try not to think of you i got 12 blue",
        "start": 1538.865,
        "end": 1563.012
    }
]