[
    {
        "text": " It happened almost right away after this assassination attempt here in Pennsylvania. And in a social media post this morning, Mr. Trump saying that he's looking forward to speaking in Milwaukee this week. You're listening to ABC News.",
        "start": 0.009,
        "end": 15.196
    },
    {
        "text": " Oh, no. Stomach issues again? Stomach issues? Who are you? Your pancreas. I could be the real reason for your diarrhea, gas, bloating, stomach pain, or loose oily stools. I thought it was my stomach. People often do. But any of these symptoms could mean having a condition called exocrine pancreatic insufficiency, or EPI. With EPI, the pancreas doesn't release enough enzymes to break down food. But EPI is manageable. Use the symptom checker on identifyepi.com and speak with your doctor. That's identifyepi.com. Sponsored by AbbVie.",
        "start": 17.619,
        "end": 46.613
    },
    {
        "text": " Don't let spring allergies make you miserable. Try the quick, drug-free solution trusted by over 4 million people. Navage. Only Navage uses suction to flush out your sinuses using refreshing saline, helping you breathe easier, sleep better, and feel healthier. And here's even better news. Navage is now available at your local Sam's Club in a great new value pack. It's everything you need to start breathing better fast. Check out Navage at your local Sam's Club today. Navage. N-A-V-A-G-E. Breathe easy.",
        "start": 46.613,
        "end": 76.323
    },
    {
        "text": " Airlines have just reduced their prices even more. Book 30 days in advance and save big. Want the absolute lowest prices on your airline tickets? Then call the low-cost airlines travel hotline right now. For prices so low, we can publish them anywhere. The only way to access our low rates and save up to 70% is to call. Save hundreds on your vacation tickets by calling right now.",
        "start": 77.927,
        "end": 103.592
    },
    {
        "text": " You can fly anywhere in the world and pay discount prices on your airline tickets. Book a flight today to London, Paris, Madrid, or anywhere else you want to go and pay a lot less guaranteed. Call the International Travel Department right now at low-cost airlines.",
        "start": 103.592,
        "end": 122.108
    },
    {
        "text": " 802-341-4542 802-341-4542 802-341-4542 That's 802-341-4542",
        "start": 122.108,
        "end": 137.978
    },
    {
        "text": " Don't let your yard be a source of irritation. Call Dolphin Landscape Design and Installation. Bruce up and bring life to your yard with affordable LED landscape lighting. Also, pavers, fire pits, and waterfalls. Dolphin Irrigation, 445-0284. WNZF and its owners and associates take no responsibility for the opinions or statements made by this talk show's hosts or guests. Statements or show topics are not necessarily the beliefs of WNZF Newsradio.",
        "start": 138.114,
        "end": 164.957
    },
    {
        "text": " You are now tuned in to Today with Pastor Jay on WNZF Newsradio, where we discuss inspiring and informative news. And now here's your host, Pastor Jerilyn Denny. Good morning, good morning. Wake up and good morning. It's a wonderful, beautiful day here in Florida, and I'm excited to be here. Last week.",
        "start": 167.602,
        "end": 186.869
    },
    {
        "text": " I had an opportunity to go visit my son, my baby boy in Asheville, North Carolina. Hashtag very proud mom. Got to see him and his beautiful bride and their new home and all this other jazz. I'm very proud of him, as you can tell. So all my children live in Florida, minus him. He lives in North Carolina. So give me an opportunity to see him, his beautiful bride, and all these other jazz. He's been married for about a year. So I have Commissioner Sullivan here. Hey, Commissioner.",
        "start": 186.869,
        "end": 216.63
    },
    {
        "text": " Hello, Pastor Jay. I'm glad to be here on this nice day. And I had news this week. You had news too? My granddaughter, Anna, I had my first great-grandchild, little baby girl, beautiful little baby girl named Arabella up in Virginia. So that's a big deal for me. That's my first time I'm going to be a great-grandfather.",
        "start": 217.159,
        "end": 236.357
    },
    {
        "text": " Well, I have seven grandchildren. You are a newly great grandfather. Right. And my son doesn't have any children at all. In fact, he has a couple of cats. He has one I call... She's a diva lady. And the other one is a...",
        "start": 236.357,
        "end": 252.329
    },
    {
        "text": " lady boss she's a boss lady for real so um those two little cats is about all i think i'm gonna have for my son he's 23 he doesn't have any children as of yet i don't think he's planning on it he's got lots of time he has lots of time but you know he's head of human resources for where he is and he um his wife is a graphic artist graphic designer something along those things anyway very proud of him um i can't do any of the stuff that they do and so it was a great visit with family so did you get a chance to see the picture of that great grand beautiful baby you have",
        "start": 252.329,
        "end": 281.22
    },
    {
        "text": " I just have one little picture. It just was on Tuesday, so I'll have a lot more. It just happened. Oh, you get a chance to spoil it, right? I saw one picture of the little baby, but just in her mother's arms. But there'll be more coming. I don't have it with me right now. No, I don't have a...",
        "start": 281.664,
        "end": 297.995
    },
    {
        "text": " Okay. I've got a picture right with me. But anyway, I'm very happy about it. And I think I'm probably the only county commissioner as a great-grandfather. Speaking of that, you've served on the county commission for how many years now? I'm in my eighth year. Eighth year. And you believe in term limits, I'm sure. And you've decided you were not going to run this time around. Well, for a variety of reasons. But I think two four-year terms is enough. And it's time to get started.",
        "start": 297.995,
        "end": 322.381
    },
    {
        "text": " You know, some new blood in and you want new ideas all the time. And as long as they're good, smart people, I have no problem with that. It sounds like a plan. So what are you most proud of in your eight years on the county commission? Well, then I'm still here, number one. I know that's right.",
        "start": 322.961,
        "end": 338.831
    },
    {
        "text": " But remember, when I ran for office, you may not remember it because it's eight years ago. I was here. Matthew had just struck in the middle of my campaign. We had our first in the recent modern history in Flagler County. So we had a lot of damage due to that. We had a big controversy about what we were going to do for a new sheriff's operation centers. Remember with the old hospital building?",
        "start": 338.831,
        "end": 362.193
    },
    {
        "text": " All those are reasons to run and say, hey, you know, maybe it's time to get in there and try to make things better. So as we sit here today, we have a brand new, beautiful Sheriff's Operations Center. We've got the beach being renewed now in a permanent way. It's ongoing right now. Major operation, $27 million. Got a new South Library coming in. We've got the pedestrian bridge out. Oh, you've done a lot.",
        "start": 362.193,
        "end": 390.196
    },
    {
        "text": " We've got the budget in pretty good control. We're holding the line on millage rates and fire departments getting new fire engines and new firehouses. So I think on the capital improvement side, we're doing pretty well. I was happy the way the Tourist Development Council's been going. I do the disadvantaged public bus transportation. We've got a bunch of brand-new buses for that. We're still trying to make that better. And overall, I think the Board of County Commissioners is doing a pretty good job.",
        "start": 390.196,
        "end": 420.196
    },
    {
        "text": " Well, I'm going to say it right now. You, by far, has been my favorite commissioner. Okay. That's because I'm here, probably. No, I haven't said that to anyone. It's because, you know, every time you're very informed, I can call you and ask you any question. You tell me everything that's going on. Whether we agree with everything or not, it doesn't matter. You always read the paperwork. You've always been informed. You've been great. So with that being said, might I ask you, over your eight years, who's been your favorite county commissioner?",
        "start": 420.196,
        "end": 446.101
    },
    {
        "text": " My favorite county commissioner. Other than you. Yeah, that's a difficult. I don't want to. I'm still on the county commission, so I have to be careful. We'll have to wait until you come back. I think we have a good variety of people on the commission right now. And wait until I get out of office. Maybe that's an easier question to ask. But I think we've had a pretty good set of people, and we're doing pretty good right now. Okay. Well, you're on the canvassing board. Let's talk about the canvassing board, what it is, and why.",
        "start": 446.459,
        "end": 474.77
    },
    {
        "text": " What's the facts about it? OK, I am very proud of my time on the canvassing board. And as I start, the first thing I want to say is the canvassing board, if there's anything apolitical and neutral, it has to be the canvassing board. So everything I'm going to say from here on concerning the canvassing board is totally not political. Right. It's a very important function that the government here serves. And I know you take it very seriously.",
        "start": 475.145,
        "end": 499.258
    },
    {
        "text": " Right. And just just for information, it'll be the third time every two years we have either statewide elections. And then every fourth year we have a presidential election. This year's presidential election and running of the election office. Katie Lenhart does a great job. We have a wonderful, wonderful supervisor of elections and.",
        "start": 499.258,
        "end": 520.691
    },
    {
        "text": " A great group of people who work there to make sure that we carry out those elections fairly. And every vote that should be counted gets counted. And every vote that shouldn't be counted is not counted. That our voters are our citizens of the county here and citizens of the United States. And they only get to vote once in our county. So I'm just messing with you. Go ahead.",
        "start": 520.691,
        "end": 542.585
    },
    {
        "text": " And so the canvassing board is made up – when you have an election in the state of Florida, every county has a three-member – it doesn't matter how big or how small the county is. It has a three-member county board. And it's made up of the supervisor of elections, one of the county judges or the county judge if we only have one. In our case, we have a couple.",
        "start": 542.585,
        "end": 572.585
    },
    {
        "text": " You know, for some reason, they're not able to do that. Normally, it's the chairman of the Board of County Commission. In this case, it would have been Andy Dance, but he's running for office. If you're running for office, obviously you're in a in a political battle. So you're not allowed to be on the canvassing board. So I've done it three times in 2018, 2022 and now in 2024.",
        "start": 572.585,
        "end": 594.633
    },
    {
        "text": " And just for information, we've already had one full session of the canvassing board, which basically involves at least 12 meetings. Some of them go half a day. And that was for the presidential primary in March. That's done. And by the way, President Biden and Donald Trump were the winners. And that's kind of interesting. Now, we actually in that election in March, that was the presidential primary. And those delegates from Florida are dedicated to now President Biden.",
        "start": 594.633,
        "end": 624.258
    },
    {
        "text": " and former President Trump. So that's kind of interesting right now because that's getting to be a big issue, what happens with all those delegates and so on. So it's one of those functions we do, and we certify the elections. We're there to count the mail-in ballots, and I can go through in detail a lot about that, but anyway, there are three. So coming up, the next canvassing board starts here. Actually, it starts...",
        "start": 624.258,
        "end": 650.469
    },
    {
        "text": " July 22nd, next Monday, when we do what's called a logic and accuracy testing, where we bring out, we randomly pick voting machines, voting counting machines. We bring them out. We test them, make sure that they're zero. We seal them. And so when the election starts, we know that the machines are back to zero. They've been certified and sealed and ready to go. And that starts July 22nd. And we'll be actually counting the first mail-in ballots. We count them as they come in. We don't wait till the end.",
        "start": 650.469,
        "end": 678.558
    },
    {
        "text": " And that'll happen on July 26th. And all those canvassing board meetings are held in the supervisor of elections office. And the public is invited to attend. If you want to come in and see how we actually do the job, you don't have to make a reservation. Just come in. You'll have to sign in and you'll have to be as quiet as possible because we'll be counting counting votes. Now, when you say that this is open to everyone, is this open to even non-registered voters?",
        "start": 678.558,
        "end": 703.933
    },
    {
        "text": " Well, I mean, that's a good question. I think probably we'd say, well, why are you here? Right. But because you do have to sign in and give your address. But and there's not that much room, but there is room and we'll accommodate people as best we can. If we if we got if we had a big crowd, which I don't think is going to happen. But if we had a big crowd, we'd probably take turns, you know, give and say you can be in for an hour and somebody else for an hour. You can watch what we do. You can't.",
        "start": 704.531,
        "end": 729.445
    },
    {
        "text": " participate in the actual canvassing because what happens is sometimes the ballots that come in, the mail-in ballots that we watch being opened, and then they're brought forward and they're put through the machine. And once in a while, the ballots are spoiled or somebody spilled coffee on them or something like that. So one of the jobs of the canvassing board would be in that case if it's a spoiled ballot,",
        "start": 729.445,
        "end": 752.363
    },
    {
        "text": " and the machines kick them out, or we obviously see it can't go through the machine. We'll sit there, the three of us, we'll agree on the selections, and one of us will actually fill out a new ballot, and then that will go forward.",
        "start": 752.363,
        "end": 767.381
    },
    {
        "text": " We tape all this and it's taped and it's recorded on paper so that when we add that extra ballot, we don't count it twice. But it's a very fair process. If you've never or you're interested in it, a lot of people seem to be interested in talking about elections and how the votes are counted. Well, you can come and see how they're counted here in our county. And I guarantee that we are very careful about who votes.",
        "start": 767.381,
        "end": 793.729
    },
    {
        "text": " They are citizens of the county. They vote in the proper place, and their vote is counted, and only once. Once you vote, whether you have a mail-in ballot or you show up on Election Day, you only get to vote once because as soon as you vote, that stops you from voting again. So you can't send in a mail-in ballot after you voted in person, that kind of thing. All right. Well, we've got to take a break. Don't go anywhere. Don't touch that dial. You are listening to Today with Pastor Jay.",
        "start": 793.729,
        "end": 820.077
    },
    {
        "text": " Good morning, everyone. I'm Dave Brannon, Chief of Police for the City of Pinell. Like you, I'm listening to Today with Pastor Jay.",
        "start": 820.52,
        "end": 827.295
    },
    {
        "text": " NMLS number 228111. CHL NMLS number 15622. Hi, this is Steve Verrier, your proven local source for residential home financing needs. We can often say yes when others say no. So if you're having trouble, please let us take a look. You can find me online at thefloridamortgagecenter.com or call direct at 386-866-1112.",
        "start": 831.408,
        "end": 851.51
    },
    {
        "text": " We're proud to be a sponsor of Today with Pastor Jay. My name is Leslie Jiskum, and I am with the African American Entrepreneurs Association. And we are delighted to be a sponsor of Today with Pastor Jay. We have a free nationwide business directory listing. You can pick that up on AAEAassociation.org. Our 800 number is 1-800-671-1397.",
        "start": 851.51,
        "end": 874.616
    },
    {
        "text": " Hey, y'all, it's Christy B. Come to my comedy club here in Palm Coast at City Marketplace Fridays and Saturdays at 6.30 or 9 p.m. Coming up shows Jill Kimmel and Jimmy J.J. Walker. Find me on Facebook, Christy B. Comedy, The Club.",
        "start": 874.616,
        "end": 889.292
    },
    {
        "text": " Welcome back. Welcome back. You are listening to Today with Pastor Jay, and I have Commissioner David Sullivan, who's serving on the canvassing board here in Flagler County. And, you know, this is a lot to deal with, a lot to go through, especially now. Well, in the...",
        "start": 890.452,
        "end": 905.708
    },
    {
        "text": " heated passions of every election since 2020. People say, you know, the election is stolen. You guys are allowing people to vote more than once. And now I just found out before the break that if there's a ballot that you're not exactly sure about, that",
        "start": 905.708,
        "end": 921.971
    },
    {
        "text": " The three of you get together and figure it out, and you fill out a whole new ballot. Well, what happens, it's more complicated than that, Pastor Jay. Number one on the mail-in ballots, because a lot of people have questions about the mail-in ballots, and there's a lot of things that can happen there.",
        "start": 922.619,
        "end": 939.462
    },
    {
        "text": " If you get a mail-in ballot, you send it in and either drop it off at the election office. And by at the election office, in the drop box, there'll be a human being there to make sure you're only dropping in one ballot at a time. Not 50. Right. And so that's the first safeguard. They're opened up on a daily basis. And the first thing that happens on the outside of the ballot, they haven't opened up the ballot yet, but on the outside, you have to sign the ballot.",
        "start": 939.462,
        "end": 965.401
    },
    {
        "text": " And with your address. So that's checked right away. Does that match the signature we have on file? Do you do you look at that? Yes. And I just pulled up my course for all of us who are on the canvassing board. We have to go through a class where we learn. It's a very professional class and it teaches us about handwriting expertise.",
        "start": 965.401,
        "end": 987.346
    },
    {
        "text": " Really? I didn't know that. So signature verification for the 2024 election cycle. And it's the course that people in the police work and all that take. So we all take that. And I also do one just on the rules because the legislature has passed. So have you taken that course three times? Yes, I have. Each time that you're on the canvassing board?",
        "start": 987.346,
        "end": 1006.254
    },
    {
        "text": " Yeah, and it's gotten more and more complicated over since 2018 when I first was on the canvassing board, the state legislature, and there's been more and more rules put into effect. So I want to say this before I go on. Katie Lenhardt, our supervisor of election, runs a wonderful office. She's responsible for running the office, and if you go to the website –",
        "start": 1006.254,
        "end": 1028.712
    },
    {
        "text": " for the supervisor elections office all this information is there such as you know security election security fact sheet things like that i'm not going to go through all of that with you here because there just isn't time and to be you know kind of uh redundant to do that but uh",
        "start": 1028.712,
        "end": 1046.681
    },
    {
        "text": " There are a lot of procedures that have been improved. We have television cameras there, but the signature verification is important. So the example you gave, a ballot comes in. It's opened up. We watch the canvassing board watches the we have people there helping us. There are thousands of these to come in.",
        "start": 1047.278,
        "end": 1067.363
    },
    {
        "text": " When you say they're helping, are they helping to open the ballots? They help us to open the ballots. And as they open them up, we put them in a pile. We don't necessarily look at them. You could look at them. And, for instance, the people who are there watching don't get to stand over our shoulder and say, oh, I see that that ballot went for this or that candidate. That doesn't happen. But they can be there watching us do the process. Those ballots then go directly into the counting machine. And what happens if the ballot can't be counted –",
        "start": 1067.363,
        "end": 1097.244
    },
    {
        "text": " It's called it comes back to us. And then we look at it. There are three of us there. Remember, Katie, the judge and myself. And as long as two of us agree, most of the time, all three of us agree. We fill out. We call that ballot a spoiled ballot. You fill out a new ballot, put it in. The other ballot is registered, put in an envelope and verified. So we don't get any double counting or anything like that. And then that ballot is counted. If we didn't do that.",
        "start": 1097.773,
        "end": 1122.585
    },
    {
        "text": " That ballot wouldn't be counted. That'd be unfair to the person who sent the ballot in. Make sure that everyone who's checked in, their ballot accepted, it gets counted. Now, this is for the mail-in ballots. If you go at the precincts or early voting, those ballots are counted directly at that point. And remember, we have paper ballots here. People go, oh, paper ballots. We have paper ballots.",
        "start": 1122.585,
        "end": 1144.855
    },
    {
        "text": " And they're collected. We have them. If there's a recount or anything like that, we have those available segregated by precinct. So we can go back and recount by precinct or we can recount the whole election. So over the past few canvassing boards that you've been a part, have you seen all the changes, the security changes over the years? Or would you say that it's been kind of somewhat the same?",
        "start": 1144.855,
        "end": 1169.633
    },
    {
        "text": " Well, no, no. It's much more – many more checks. For instance, we have dual counting machines now. So the ballots are counted twice by different machines. None of these are connected to the internet that you and I have, but that's an extra precaution that's in now. When we do that spoiled ballot redo –",
        "start": 1169.855,
        "end": 1189.036
    },
    {
        "text": " There's a camera over my shoulder. It's taking a picture of me filling that out. And the people who are observing the election can can see that on TV, that we're doing it correctly. We're not changing anything. So you have to trust those three people, though. I mean, I mean, it's it's it's it's Katie Lenhart, Judge Totten and myself and the alternates are our commissioner, Donald O'Brien and Judge Melissa.",
        "start": 1189.036,
        "end": 1215.077
    },
    {
        "text": " So if one of us is not there, it's one of the people looking at the ballots and that kind of thing. So once in a while, it's a two-to-one vote. Really? Yeah. So on the handwriting. On the handwriting. On the handwriting. I was just saying, on the handwriting. The handwriting is the one that's the toughest when there's a question of, is that the person who they say they are? How often does that happen, do you think? Well, I would say...",
        "start": 1215.077,
        "end": 1240.452
    },
    {
        "text": " It's hard to say. Two or three hundred times. Okay. That's a lot. I mean, that's not a lot, but that's a small percentage when it's thousands and thousands of votes. And then we have the provisional ballots, like somebody comes into early voting or the precinct and comes in and they go to the wrong precinct or they're not registered. Or there could be some question is, are they a valid citizen of the county? What happens in that case? Well, how do you check to see if they're a valid citizen? Is that a check for you?",
        "start": 1241.476,
        "end": 1270.828
    },
    {
        "text": " Here's what happens. Okay. At the precinct or at the early voting site, those ballots, you've probably seen this if you voted, are put in what's called a provisional envelope. Those, and if you look on our canvassing board thing, one of our meetings, canvas vote by mail ballots, provisional ballots, official results. In other words, there'll be some provisional ballots that haven't been determined to be valid or not, and that's another decision that goes to the canvassing board, us.",
        "start": 1270.828,
        "end": 1300.043
    },
    {
        "text": " So we open those up and say, should those votes have been counted? They're not counted yet because they're in the provisional envelope from each precinct and each early voting site. And so we make sure that that's handled correctly. We'll do a lot to check to make sure they're registered voter or they have the right to vote in this election. So there's a lot of things like that going on. Katie Lenhardt is the expert, the true expert on this. But all of us on the canvassing board have gone through the training.",
        "start": 1300.043,
        "end": 1326.613
    },
    {
        "text": " And you're equally responsible. Oh, yeah. It's three people, three votes. And you have to have two votes if there's a question on the handwriting or the way of the person. For instance, sometimes the person won't get the little dot in the hole correctly. When you think about it, and I want to encourage everyone, especially those that are aging.",
        "start": 1326.613,
        "end": 1345.52
    },
    {
        "text": " If you've had surgeries or anything like that on your hand or anything, a stroke, go and update your signature because it's going to change over time. It really is going to change over time with age, with sickness or whatever it is. So you may have signed this thing years ago and now you're coming in and trying to sign it and they're rejecting it.",
        "start": 1345.52,
        "end": 1366.476
    },
    {
        "text": " And another great thing that we do here at our office, I'm sure it's done around the state, is that once you vote, sometimes people say, you know, I mailed my ballot in. I wonder if it got counted. You can go to the election website, check your name. It'll tell you whether that vote was counted or not. All right. Well, we're going to take another break. Don't go anywhere. Don't touch that dial. You're listening to Today with Pastor Jim.",
        "start": 1366.544,
        "end": 1385.503
    },
    {
        "text": " Hey, this is James Bellino, pastor of Church on the Rock, and I want to personally invite you to our services on Sunday morning at 10 a.m. Our church is located at Route 1 in Bunnell, and we offer a service that seeks the Holy Spirit to be led and guide in the kingdom of God's people coming together to be trained and equipped, and then to be sent out into the community. Christ said to make disciples to go throughout the earth, and that's our call, and that's our belief at Church on the Rock. Visit our website at churchontherockpc.com.",
        "start": 1398.541,
        "end": 1427.483
    },
    {
        "text": " Immediately following today with Pastor Jay at 8.30 a.m., you'll go from hearing me on a talk show to hearing me in my church service. Join me, Gerilyn Ministries Reverse Church, by dialing in 904-701-7177. Listen, you don't have to get up to go to church now. You can just call in 904-701-7177. Dial in and listen to the Word of God today.",
        "start": 1427.619,
        "end": 1450.486
    },
    {
        "text": " I want to give a thank you and a shout out to Church on the Rock. Thank you so very much for sponsoring today with Pastor Jay and to Steve Berry at thefloridamortgagecenter.com. I also wanted to mention, let me see if I, I think it's August the 17th, if I'm not mistaken. August the 17th, I'm having my annual back to school bash. I want to invite everyone to come out August the 17th from, I want to say 11 to 2. Don't...",
        "start": 1451.63,
        "end": 1476.254
    },
    {
        "text": " I should know, right? But can you believe it's already back to school? Amazing. And every year, I think this is either the 11th year that I've had a back to school bash where we give away free school supplies and backpacks and whatever we can get. And I want to thank you again, Commissioner Sullivan, because you have supported that, I know, for probably six, seven years. So thank you so very much. It's amazing how time goes by. It is.",
        "start": 1476.254,
        "end": 1497.244
    },
    {
        "text": " Isn't it? So out of all the elections that you've been involved in, which has been the most exciting where people were like peeking through or coming to sit to see the work that you've done on the canvassing board?",
        "start": 1498.012,
        "end": 1509.923
    },
    {
        "text": " Well, obviously, I have not done a presidential election. I did two of the interim state elections. And usually they're not as high interest as others. But I did want to make a couple of points just to finish up. We've already – the primary that's coming up right now that you'll be getting your – the ballots are already being mailed out for the primary election, which is August 20th. Early voting starts, I guess, on the 10th.",
        "start": 1510.725,
        "end": 1539.275
    },
    {
        "text": " But I want to say 12 elections have already been determined. Are you serious? All five of our constitutional officers. They are. They didn't have anybody running against them. Judge Judge Dissler and and some of the cities in Bonnell are in Flagler Beach and not Bonnell. Those elections are already decided. And so in the primary coming up before we get to November 5th, the primary, which will be August 20th.",
        "start": 1539.275,
        "end": 1568.729
    },
    {
        "text": " That's when a lot of the local elections will be determined. I know. We want to encourage everyone to get out and vote. That's why it's so important to get out and vote. And I wanted to make sure before we go that, again, we start the canvassing board meetings on July 22nd, which is next week.",
        "start": 1569.206,
        "end": 1586.186
    },
    {
        "text": " And and then we'll be and that's for the logic and testing when we actually look at the equipment, make sure it's all zero, that kind of thing. Very technical. And then we start counting the the ballots coming in for all you candidates out there. Are you looking forward to this presidential election being able to be on the canvas? Yes, I am.",
        "start": 1586.186,
        "end": 1603.609
    },
    {
        "text": " I think that exciting and I think it's an important public service, again, that the county government provides. And it's of the things we do. It's one of the more things we do as elected officials is be involved in the elections and make sure they're carried out fairly and that everybody gets to vote. But they only get to vote once and they are eligible to vote. And we make sure that everything adds up correctly. I know for the primary we just did. We can't.",
        "start": 1603.609,
        "end": 1630.555
    },
    {
        "text": " Exactly. All the thousands of votes that came in when we added up at the end, there were no extraneous votes or anything like that. Every single vote got counted, and it all added up at the end. All right. Well, thank you so very much for your service to the community. All right, guys, you know what I say. Yesterday's gone. Tomorrow's not promised. What are you going to do today? Today, get involved. Stop listening to all these conspiracy theories and stuff. Go and check out the canvassing board. Go on the website, the Supervisor of Election website, and find out when you can show up.",
        "start": 1630.555,
        "end": 1660.555
    },
    {
        "text": " Wonderful day.",
        "start": 1660.555,
        "end": 1661.152
    },
    {
        "text": " Hurricane season is here and now is the time to call SmartGuard shutters for a free estimate. 386-227-6295. A mixture of clouds and sunshine. Scattered showers and storms likely to flare up through the afternoon. Temperature into the low 90s tonight. Showers linger into the evening and then partly cloudy mid to upper 70s. Tomorrow, Tuesday both days. Those are showers and storms around mainly afternoon. More likely Monday. Let's go around Tuesday low 90s both days. This is Precision Weather Meteorologist Phil Spivak for WNZF.",
        "start": 1670.043,
        "end": 1697.602
    },
    {
        "text": " Can your IRA stand up to the next financial crisis that our top economists are saying is at our doorsteps? By allocating a percentage of your IRA into physical gold and silver with a tax-free rollover, you can diversify and safeguard your holdings from turbulent markets and economic downturns by putting your IRA back on the gold standard. Find out how to safeguard your assets with a tax-free rollover with a Genesis Gold IRA.",
        "start": 1697.602,
        "end": 1725.145
    },
    {
        "text": " the only IRA that can hold physical precious metals. Call now for your free gold and silver report. Protect your IRA today with one simple phone call and learn how to qualify for up to $10,000 in free silver. Call Genesis Gold Group, empowering faith-driven stewardship.",
        "start": 1725.145,
        "end": 1743.37
    },
    {
        "text": " 800-361-1289. 800-361-1289. 800-361-1289. That's 800-361-1289. Do you have a fundraiser or charity event you need everybody to know about? The Craig Flagler Palms Community Calendar can help you. Send the details of your community event to community at flaglerbroadcasting.com. That's community at flaglerbroadcasting.com.",
        "start": 1743.37,
        "end": 1772.654
    },
    {
        "text": " Chardani Roofing is the most trusted roofer in Volusia and Flagler counties for more than a decade. Chardani Roofing. Call and schedule an appointment today. Give us a call. 386-338-7926. So don't wait for an emergency. Get to know the Chardani Roofing family now. We're Chardani Roofing.",
        "start": 1772.739,
        "end": 1787.739
    },
    {
        "text": " Get ready for the 7th Annual Flagler Broadcasting Senior Health and Wellness Expo presented by AdventHealth. It's a fun day with all kinds of local businesses, free prizes and exhibits to make your golden years platinum. Everything under the sun, home improvements, health screenings, insurance, Medicare, plus valuable financial and legal advice. Bring your friends and enjoy a delicious breakfast buffet. It all happens starting at 8 a.m. going until 2 at the Palm Coast VFW.",
        "start": 1787.739,
        "end": 1811.988
    }
]