[
    {
        "text": " From NPR News in Washington, D.C., this is Week in Edition. I'm Aisha Roscoe. Good morning. Florida is being hit hard by climate change, but some Republican leaders aren't focused on the issue. We traveled to the Sunshine State where one mayor had this message for Donald Trump.",
        "start": 16.067,
        "end": 40.606
    },
    {
        "text": " I'd say, Mr. President, we welcome you to come and tour the Keys. I'll show you firsthand what's going on in my community. Also, Vice President Harris went to the Essence Festival in New Orleans to shore up support with a key demographic, black women. And while U.S. military aid finally reached Ukraine, the delay had consequences. We'll tell you more. It's Sunday, July 7th. News is next.",
        "start": 40.794,
        "end": 64.804
    },
    {
        "text": " Live from NPR News in Washington, I'm Windsor Johnston. President Biden is using a campaign swing through Pennsylvania today to recharge his bid for re-election. The president spoke just a short time ago at a predominantly black church in Philadelphia. I've always felt the power of your faith in good times and in tough times.",
        "start": 66.084,
        "end": 91.135
    },
    {
        "text": " fact is the scripture says all things work together for good are now called according to his purpose our purpose is to serve others",
        "start": 92.295,
        "end": 106.374
    },
    {
        "text": " From Philadelphia, Biden will travel to Harrisburg for a campaign event. Later tonight, the president will return to Washington, D.C., where leaders from NATO countries will gather for a three-day summit this week to mark the 75th anniversary of the alliance.",
        "start": 106.578,
        "end": 123.148
    },
    {
        "text": " Republican lawmakers and state election officials are ramping up attacks on a three-year-old executive order by President Biden. The order calls for federal agencies to promote voter registration among eligible voters. But as NPR's Hansi Lowong reports, Republican officials are making it a partisan flashpoint.",
        "start": 123.797,
        "end": 145.828
    },
    {
        "text": " Some Republican critics, including Mississippi Secretary of State Michael Watson, have linked the order to worries about the rare and illegal practice of non-U.S. citizens voting in federal elections. Watson wrote a letter against the program that notifies prisoners in the custody of the U.S. Marshals of the right to ask for voter registration information. He cited concerns, backed with no evidence, that unauthorized immigrants could end up getting registered.",
        "start": 146.015,
        "end": 167.705
    },
    {
        "text": " Brendan Fisher of the investigative watchdog group documented says Biden's order has become a blank slate for claims at risk undermining faith in elections. The messaging has shifted as the November 2024 election becomes closer and as immigration continues to be a major issue in the campaign. All available evidence shows non-citizens vote in exceedingly small numbers. Hansi Luang, NPR News.",
        "start": 167.705,
        "end": 188.985
    },
    {
        "text": " Hurricane warnings have been posted along parts of the Texas coastline ahead of Tropical Storm Beryl. Houston Public Media's Dominic Anthony Walsh has more.",
        "start": 189.189,
        "end": 199.753
    },
    {
        "text": " Beryl is still expected to strengthen into a Category 1 hurricane before it makes landfall in between Corpus Christi and Galveston. The governor's office issued disaster declarations for 121 counties, and local officials are encouraging people to leave low-lying, flood-prone areas along the Texas coast.",
        "start": 199.923,
        "end": 220.845
    },
    {
        "text": " That includes Corpus Christi Bay, Matagorda Bay, and West Galveston Bay, where the National Hurricane Center warns of a life-threatening storm surge late Sunday and Monday. The state of Texas has called up more than 2,000 first responders, and residents are encouraged to stock up on a seven-day supply of food. I'm Dominic Anthony Walsh in Houston. This is NPR.",
        "start": 220.845,
        "end": 244.087
    },
    {
        "text": " Support for NPR and the Tiny Desk Contest comes from Capital One, offering their premium travel card, Venture X. Capital One is proud to support NPR Music and the Tiny Desk Contest. Capital One, what's in your wallet? And the listeners who support this NPR station.",
        "start": 244.787,
        "end": 262.841
    },
    {
        "text": " And the time is 7.04. You're listening to member-supported Hawaii Public Radio. Hope you're having a relaxing Sunday. I'm Jackie Young with a look at the latest local news. Hawaii's primary election is a little more than a month away. In advance of that, local elections officials, along with volunteer observers, went through the process of ensuring the integrity and security of the system.",
        "start": 263.063,
        "end": 286.135
    },
    {
        "text": " Last week, officials and volunteer observers from various political parties conducted what is called a logic and accuracy test of the voting equipment. Scott Nago, chief election officer, told KHUN official observers will mark a test ballot and run it through the system to make sure the system is counting accurately. That test will be repeated in each county in the coming week. That same equipment will be used at voter service centers across the state on Election Day.",
        "start": 286.135,
        "end": 315.776
    },
    {
        "text": " Voters should be receiving their primary election mail ballots at the end of July. If you don't, please contact the elections office. New for this year, voters can track their ballots by signing through the elections website to receive a text, email, or phone call to track their ballot.",
        "start": 315.776,
        "end": 333.49
    },
    {
        "text": " And Governor Greene signed a flurry of bills on Friday, including one for House Bill 2526, which increases penalties for unsafe and unlicensed drivers. The new law beefs up penalties for driving without a license and unsafe driving, making a third conviction within five years a Class C felony, and the penalty a maximum of five years in prison.",
        "start": 333.49,
        "end": 356.476
    },
    {
        "text": " House Speaker Scott Saiki introduced that bill after McKinley High School student Sarah Yara was killed by a repeat traffic offender whose offenses included repeatedly driving without a license. Saiki says there are 9,000 citations each year on Oahu for driving without a license as far as those who are caught.",
        "start": 356.476,
        "end": 377.278
    },
    {
        "text": " The governor also signed Senate Bill 2347, which establishes a three-strikes rule for violent crime, turning three misdemeanor convictions into a felony. Also, in new laws, red light cameras will enforce speed limits with existing red light cameras set up at 10 intersections around town. These new laws take effect in January. In weather, today and tonight, mostly clear, some windward and Malka showers.",
        "start": 377.278,
        "end": 403.626
    },
    {
        "text": " This is Week in Edition from NPR News. I'm Aisha Roscoe. This hour, we're starting in Florida. Climate change is already unleashing havoc on the state. The sea level is rising, the ocean is getting warmer, and hurricanes are getting stronger. But over the years, Florida has gone from a purple state politically to one that's solidly red. And the state's Republicans aren't focused on reducing carbon emissions.",
        "start": 403.797,
        "end": 430.196
    },
    {
        "text": " So how is a place on the front lines of climate change embracing a party that puts the issue at the back of the agenda? I took a trip last month to find out. I started in the Florida Keys. So these tanks are full and ready to go out on the next dive trip. So this is a small gauge that we can connect. That's Ladd Atkins. He's a researcher, conservationist, and scuba diving tour guide.",
        "start": 430.606,
        "end": 455.964
    },
    {
        "text": " Hey, Luke, we're just going to poke out in the bay for a few minutes. All right, sounds good. The one and two are on their way. Feels good to be out here. Look at all these beautiful houses. The water's so clear. Atkins has been looking at the coral reef off the Florida Keys for a long time, but saw a big change last year.",
        "start": 460.418,
        "end": 481.271
    },
    {
        "text": " Last year, the water got so hot, like off the charts. So corals are very complicated organisms. They have algae that lives inside their tissues. And when it gets too hot, they kick that algae out. And it leaves behind the coral tissue without any color. And there were areas of the reef last year when it was so hot that looked completely white. You know, some people may say, well, I just want to worry about human beings. I don't care about the fish. I want to worry about human beings, too.",
        "start": 481.493,
        "end": 511.323
    },
    {
        "text": " As a human being, myself, I know that we rely on that coral reef for many reasons. I mean, my local economy, my friends and neighbors rely on it, whether they're commercial fishing or whether they're in the tourism business or whether they're in banking. That reef has an impact and effect on all of us.",
        "start": 511.323,
        "end": 530.845
    },
    {
        "text": " The destruction of the coral reef is a huge issue, but an even more visible one is the water coming up on shore. And this is from a small rainstorm. I mean, this puddle, it's at least a few, I think two inches? Yes, and right now we're in one of the lower parts of the islands.",
        "start": 531.084,
        "end": 548.046
    },
    {
        "text": " I spent some time walking in Key Largo with Holly Rashine, mayor of Monroe County. Now, if you were to come back in October, November, when we're experiencing extreme high tides, it can be severe. This is underwater. And the water will sometimes...",
        "start": 548.046,
        "end": 564.838
    },
    {
        "text": " sit here for what seems like months on end. She wants to raise the roads in this neighborhood. It's the first item on a long wish list of resiliency projects that will cost $5 billion. A lot of money just for the Florida Keys, especially considering that Rashine is a Republican. She doesn't want to get into how to slow down climate change. As a mayor, she says her focus is on protecting her constituents from the effects of rising temperatures.",
        "start": 564.838,
        "end": 593.08
    },
    {
        "text": " Donald Trump is going to be the Republican nominee. He's very noncommittal when it comes to climate change. What do you think of that? He is the leader of the Republican Party, and that's his approach when it comes to environmental issues. I'd say, Mr. President, we welcome you to come and tour the Keys. I'll show you firsthand what's going on in my community. With the rain coming down pretty hard in some spots.",
        "start": 593.08,
        "end": 617.415
    },
    {
        "text": " While I'm driving around the Florida Keys, I hear this on a Miami radio station. Key Largo's gray and cloudy weather was just an appetizer. I was on my way to getting a full taste of the impact of a lot of water on a low-lying city. But first, let's talk about how Florida became so Republican even as the state became more vulnerable to climate change.",
        "start": 617.415,
        "end": 643.49
    },
    {
        "text": " Florida was Democratic. The state legislature was Democratic up until the early to mid 1990s. That's Aubrey Jewett. He's a professor of political science at the University of Central Florida. And most of the time we had Democratic governors through that period as well.",
        "start": 643.592,
        "end": 660.06
    },
    {
        "text": " And even after that, registered Democrats outnumbered Republicans. Then over the past three years, that flipped. Under Republican Governor Ron DeSantis, there are now nearly a million more Republicans than Democrats. A lot of those were newcomers. So we just had a surge of people, disproportionately Republican, many of them coming because they liked the idea of what DeSantis called the free state of Florida in terms of reopening after COVID.",
        "start": 660.06,
        "end": 688.712
    },
    {
        "text": " And Florida Republicans are much less likely to believe humans are causing climate change than Democrats. That's according to a recent poll from Florida Atlantic University. And it matters because if you don't believe climate change is man-made, you don't believe anything you do will slow it down.",
        "start": 688.797,
        "end": 705.759
    },
    {
        "text": " And Jewett said even for voters who do believe in man-made climate change, it's still not a top election issue. I heard this firsthand at a Winn-Dixie grocery store in Key Largo, where I asked local shoppers how they view climate threats.",
        "start": 705.759,
        "end": 720.265
    },
    {
        "text": " Do you believe in man-made climate change? Incrementally. That's Christine Daly. She's a Republican and a schoolteacher. But to say that it can happen in one person's lifetime, I just, I don't, yeah. What do you think about when it comes to politics? Does it affect at all who you vote for, like in the presidential election? Yeah, for me it does. I mean, this is going to sound brutally honest, but if you really believe in one person's 80-year-old lifetime, you can seriously see climate change,",
        "start": 720.998,
        "end": 748.575
    },
    {
        "text": " That's just not scientifically there. So if someone's talking a lot about climate change, you don't... That would turn me off. Daley is voting for Trump. And to be clear, there is a strong consensus from climate scientists that the Earth is getting hotter much too fast to be part of a natural cycle. And that carbon dioxide from burning fossil fuels is largely to blame. We also talked to Pedro Maldonado, who works at the Winn-Dixie.",
        "start": 748.575,
        "end": 775.401
    },
    {
        "text": " I don't think that a human being can stop nature. We can help. You know, we can be better, but what's going to happen is going to happen anyway. If you don't mind me asking, who do you plan to vote for in the presidential election? I can tell you because my guy is having trouble right now. He's having trouble? Who is he? I mean, that could be anybody.",
        "start": 775.469,
        "end": 795.162
    },
    {
        "text": " Who wants to make America great again? I want to make my supermarket great again. Environmentalism has not always been such a partisan issue. The landmark Clean Air and Endangered Species Acts were passed with overwhelming bipartisan support. But over time, the climate issue became associated with Democrats. Bob Inglis, the founder of the Energy and Enterprise Initiative, is one Republican who wants to change that. This is not all about doom and gloom.",
        "start": 795.162,
        "end": 823.797
    },
    {
        "text": " He says most people talk about climate in the language of the left, fairness, equity. To speak to Republicans, he says you have to speak conservative. This is about exciting opportunity. We can make a lot of money by serving customers around the world, lighting up the world with more energy, more mobility and more freedom. In Florida, I was on my way to some doom and gloom.",
        "start": 823.797,
        "end": 847.892
    },
    {
        "text": " We're heading back to Miami. It's raining cats and dogs and more cats and more dogs. It's just pouring. We're not getting no sunshine in the Sunshine State. While it's unclear how much climate change had to do with the storm, it showed just how susceptible Miami is to flooding. Up to two feet of rain fell in parts of Miami-Dade County that week.",
        "start": 848.882,
        "end": 878.302
    },
    {
        "text": " The roads became rivers. Some drivers had to be rescued from their cars. The next day, I went to see someone very familiar with the city's weather problems. Hairstylist Gustavo Briand. Highlights and haircuts, you know, that's my specialty. I was trained by Vidal Sassoon in London. So a nice bob. Do you do a lot of bobs? Yeah, geometrical and all that stuff. We're standing in what will be Briand's new salon. Workers are finishing it up.",
        "start": 878.302,
        "end": 907.449
    },
    {
        "text": " He moved from his old place because it constantly flooded. He got tired of working in flip-flops with water up to his ankles, and it was getting worse. Would they be complaining to you when they came in? Like, oh my goodness, I got to get my hair done, and I'm in this water, standing water. They literally, they're really, more than me per se, they were more attached to the precision haircut. That's dedication.",
        "start": 907.449,
        "end": 932.261
    },
    {
        "text": " Florida's Republican leaders have funded resilience projects, but just this spring they went backwards on limiting emissions. The state's climate policy used to encourage renewable energy. Now it's focused on expanding the natural gas supply. It even prohibits wind turbines near the coasts.",
        "start": 932.261,
        "end": 950.776
    },
    {
        "text": " Governor DeSantis declined our request for an interview, but a few days after the torrential rain, he held a press conference promising disaster relief, and he defended the new energy policy. We need to get the lights back on. We don't want our energy policy driven by climate ideology. When that happens, people pay more and the energy is less reliable.",
        "start": 950.776,
        "end": 973.063
    },
    {
        "text": " My last stop in Florida is to meet Harold Wanless. You've had a wet trip. Yes, a very wet trip. He's a professor at the University of Miami and a sea level rise expert. For decades, he's been warning about the future of Florida, a future that now has the 82-year-old considering leaving his beloved home in Coral Gables and moving to higher ground.",
        "start": 973.063,
        "end": 994.309
    },
    {
        "text": " We've had over a foot of sea level rise in the last 90 years here. Nine or 90? 90. But people don't seem to be that concerned about it. Well, unfortunately, there's going to come a time when the water levels are going to rise a foot or two quickly. What do you think about resilience and this idea of... I think it's a horrible misuse of a word. Okay. Everybody wants...",
        "start": 994.309,
        "end": 1023.268
    },
    {
        "text": " I'm going to be elected so I can make your life resilient and make your community resilient. Well, you think Florida's in big trouble? No, I think the world's in big trouble. You think the world's in big trouble. By the time we met with Wanlis, the rain had slowed to a damp drizzle. The worst of the storm was over. But Wanlis made clear that there will be much more to come, whether the politics catch up or not.",
        "start": 1024.701,
        "end": 1047.756
    },
    {
        "text": " This piece was produced by Martin Patience and edited by Matthew Sherman. You're listening to NPR News. Support for HPR comes from Maui Ocean Center, featuring Kama'aina Weekends for Hawaii residents to experience exhibits and educational programs on weekends at mauoceancenter.com slash reservations.",
        "start": 1077.858,
        "end": 1098.575
    },
    {
        "text": " Aloha. I'm Umbreen Khan, the host of Inspired by Interfaith Voices. Each week, we go beyond the headlines to explore the beliefs shaping our world, our culture, and our politics. And I am so excited to join you on Sunday mornings at 10 a.m. here on HPR1.",
        "start": 1102.705,
        "end": 1122.91
    },
    {
        "text": " Member supported HPR1. Streaming and more at hawaiipublicradio.org.",
        "start": 1130.179,
        "end": 1136.305
    },
    {
        "text": " I'm Windsor Johnston with these headlines. Tropical storm Beryl is regaining strength as it makes its way toward the coast of Texas. Forecasters say the storm is expected to become a hurricane by the time it makes landfall. Voting is coming to an end in today's parliamentary runoff election in France.",
        "start": 1145.93,
        "end": 1166.067
    },
    {
        "text": " The country's far-right party won historic gains in the first round a week ago. Since then, centrist and leftist parties joined forces to keep the far-right from achieving a majority. Demonstrators are holding protests across Israel today. They're calling on Prime Minister Benjamin Netanyahu to step down and pushing for a ceasefire deal. Talks are expected to resume this week. I'm Windsor Johnston, NPR News in Washington.",
        "start": 1166.067,
        "end": 1193.848
    },
    {
        "text": " Support for NPR comes from the station and from Smart Mouth, committed to the prevention of bad breath for 24 hours. Smart Mouth mouthwash, toothpaste, and more can be found nationwide at stores or at smartmouth.com. From the Lemelson Foundation, dedicated to improving lives through invention, innovation, and climate action.",
        "start": 1205.486,
        "end": 1226.203
    },
    {
        "text": " and from Imaginable Futures, celebrating the hard work, commitment, and achievements of the one in five college students who are parents. More at imaginablefutures.com.",
        "start": 1226.408,
        "end": 1237.824
    },
    {
        "text": " This is Week in Edition from NPR News. I'm Ayesha Roscoe. While President Joe Biden insists he's staying in the race, there are still calls for him to step down from some within his own party who think another Democrat would have a better chance of beating Donald Trump. This has put Vice President Kamala Harris in the spotlight. Yesterday, she was on stage at the Essence Festival in New Orleans, which celebrates black culture.",
        "start": 1240.589,
        "end": 1265.845
    },
    {
        "text": " NPR White House correspondent Deepa Shivaram has been covering Harris and she joins us now. Good morning, Deepa. Hey, Aisha. So tell us what Harris had to say last night. Well, her event was honestly really a bit of storytelling. Harris's remarks yesterday and in a lot of her speeches recently have been more biographic.",
        "start": 1265.845,
        "end": 1284.991
    },
    {
        "text": " There's more explanations in her speeches about her own life, growing up going to protests, how that impacts how she thinks about issues in a certain way, particularly issues of reproductive rights, which is something she's been the lead on for this campaign. And at Essence yesterday, at the end of her remarks, I thought it was really interesting that she actually reiterated a lot of her stump speech from 2019 when she herself was running for president. Here she is in conversation with Essence editor Caroline Wenga.",
        "start": 1284.991,
        "end": 1313.336
    },
    {
        "text": " People in your life will tell you, oh, it's not your time. It's not your turn. Nobody like you has done it before. One of the things I love is they'll say, oh, it's going to be a lot of hard work. Don't you ever listen to that. I like to say I eat no for breakfast. I don't hear no.",
        "start": 1313.336,
        "end": 1330.009
    },
    {
        "text": " And she was saying that yesterday as advice for young black women in the crowd. But it stood out to me, given the conversations swirling around the Democratic Party on Joe Biden staying in the race and if Harris would be ready and able to take on former President Donald Trump. And what did the vice president have to say about Biden or the debate?",
        "start": 1330.111,
        "end": 1347.722
    },
    {
        "text": " You know, she said nothing. She wasn't asked about it. She didn't say anything about the state of the campaign at this point or speak to any of the doubts about Biden remaining in the race. Her remarks were really focused and honestly on a lot of the things Biden was supposed to say on the debate stage the other week. But, you know, he he flubbed doing it.",
        "start": 1347.722,
        "end": 1365.606
    },
    {
        "text": " Well, speaking about that, Biden has been adamant about staying in the race. He did an interview on Friday with ABC where he repeatedly emphasized that. What's Harris been saying this past week, especially when it comes to calls from some Democrats for her to take the number one spot? Well, you know, as consistently as Biden has been saying he's going to stay in the race, Harris has been just as consistent in saying that Joe Biden is the nominee and that she supports him. You know, this was her speaking to CBS News last week.",
        "start": 1365.606,
        "end": 1395.401
    },
    {
        "text": " Joe Biden is our nominee. We beat Trump once and we're going to beat him again, period. So we've heard that from her over and over again. She's also ignored the comments from leaders in the Democratic Party who have said that they would support her if Biden were to step aside. And that includes Congressman Jim Clyburn from South Carolina, who is a close Biden ally. And Harris has been traveling a lot and that will keep going into this week. She's doing events with Asian-American voters in Las Vegas and more engagements with black voters later this month.",
        "start": 1395.401,
        "end": 1422.534
    },
    {
        "text": " And it's not just Democrats who are pointing to Harris lately, like Republicans are talking about her a lot more, too. What have they been saying? Yeah. You know, with all these questions about Biden's age and fitness for office, Republicans have started running ads, making Harris the focus.",
        "start": 1422.534,
        "end": 1438.49
    },
    {
        "text": " essentially saying that a vote for Biden is actually a vote for Harris. But I will note, Aisha, the strategy from Republicans isn't exactly new. You know, when former South Carolina Governor Nikki Haley was in the race in the GOP primary, she really made Harris a center point with that same exact argument. So this rhetoric isn't entirely new, but it is, you know, kind of coming back in fuller force since the debate and since questions over Biden's age have picked back up.",
        "start": 1438.49,
        "end": 1462.875
    },
    {
        "text": " That's NPR White House correspondent Deepa Shivaram. Deepa, thank you so much for joining us. Thanks for having me. While much of the world's attention is focused on the war in Gaza, Russia is relentlessly pursuing its offensive in Ukraine. Renewed Western military aid has helped stall Russian advances. But as NPR's Joanna Kakisis reports from northeastern Ukraine, the cost of delayed supplies is deeply felt in one small community.",
        "start": 1462.875,
        "end": 1490.947
    },
    {
        "text": " The town of Ovchansk lies just five miles from the Russian border.",
        "start": 1492.551,
        "end": 1496.869
    },
    {
        "text": " Police officer Oleksiy Harkivsky grew up in town, fishing in the woodland ponds. And he says he helped evacuate his neighbors through those woods when Russian forces occupied Vovchansk in February 2022. A few months later, Ukraine recaptured the town. Only a quarter of its residents returned, and then they faced daily Russian shelling.",
        "start": 1496.937,
        "end": 1525.828
    },
    {
        "text": " We, as the police force, were there to try to give people confidence to stay, Harkivsky says. I got to know everyone personally. Then in May of this year, Russian forces stormed into Vovchansk again.",
        "start": 1525.828,
        "end": 1542.551
    },
    {
        "text": " Once more, Kharkivsky found himself evacuating his neighbors, including this 65-year-old grandmother who wept as she left everything behind. Kharkivsky filmed the evacuations and posted the videos to Facebook. The battle for Vovchansk continues.",
        "start": 1542.551,
        "end": 1564.565
    },
    {
        "text": " We drive deep into the woods, not far from town, to the command center of the 57th Brigade. The commander is Yuri Lunov. He said provisions to the front line were blocked because Russian fighter jets were dropping so many guided bombs in and around town. These bombs have pop-out wings and satellite navigation. Here we have internet, here we have radio.",
        "start": 1566.715,
        "end": 1593.097
    },
    {
        "text": " A soldier who gave his name as Rodion monitored a screen showing street fighting in Vovchansk. We are rationing ammunition, he said, but the Russians have the resources to drop countless bombs, even on very small targets, like on three soldiers. The bombs are not the only challenge. Russia sends waves and waves of infantry. The brigade's artillery unit is trying to hold them back.",
        "start": 1593.097,
        "end": 1620.742
    },
    {
        "text": " We walk along a dirt road into the forest to meet the unit's wiry commander named Nur. For security reasons, he declines to give his last name. Nur explains that the unit lacks long-range shells. If we had these, he said, we could have fired at Russian troops before they reached Vovchansk.",
        "start": 1622.363,
        "end": 1646.817
    },
    {
        "text": " Some Western military aid has now arrived on the front line. It's helped Ukrainian troops stop the Russian advance here. But there's not much left of the town of Ovchansk beyond ruins and rubble.",
        "start": 1646.817,
        "end": 1660.725
    },
    {
        "text": " Roughly 30 miles away in the city of Kharkiv, hundreds of people mourned a police officer killed during the Vovchansk evacuations. The service is held in a basement. Air raid sirens blaring outside.",
        "start": 1664.07,
        "end": 1679.224
    },
    {
        "text": " The wartime administrator of Vovchansk, Tomas Gombarsvili, limped as he walked behind the coffin. The enemy struck a place where we had set up evacuation headquarters, he said. I got a shrapnel wound in my left thigh.",
        "start": 1682.705,
        "end": 1699.599
    },
    {
        "text": " Gombarsvili is in charge of relocating evacuees from Vovchansk, like 79-year-old Lyudmila Kuznetsova. She now lives in what used to be a student dorm in Kharkiv. We tried so hard to stay in our home in Vovchansk, she says. Whenever the doors and windows were blown off, we would just repair them. But she ran out of supplies, and Vovchansk ran out of time.",
        "start": 1700.998,
        "end": 1730.486
    },
    {
        "text": " She left at night with only the clothes on her back as her hometown burned. Joanna Kakisis, NPR News, northeastern Ukraine.",
        "start": 1731.527,
        "end": 1743.029
    },
    {
        "text": " Some conservatives, including high profile commentators and Republican state lawmakers, have set their sights on ending or restricting no fault divorce laws. These laws are on the books in all 50 states. No fault divorce allows anyone who wants to end their marriage to do so without blaming their spouse for doing anything wrong, like adultery or domestic abuse.",
        "start": 1745.52,
        "end": 1770.299
    },
    {
        "text": " But critics of no-fault divorce say it undermines the sanctity of marriage and hurts men. We're joined now by Joanna Grossman. She's a law professor who specializes in family law at Southern Methodist University's Dedman School of Law. Professor Grossman, welcome to the program. Thank you for having me.",
        "start": 1770.299,
        "end": 1789.36
    },
    {
        "text": " So can you start by reminding our listeners of the history of no-fault divorce? Sure. So for most of history in the U.S., we had something called fault-based divorce, right? The opposite. And that was basically the state decided whether a marriage was bad enough to justify a divorce.",
        "start": 1789.36,
        "end": 1809.445
    }
]