[
    {
        "text": " Who's gonna drive you home?",
        "start": 0.009,
        "end": 5.794
    },
    {
        "text": " Welcome back. Ron Manning, The Car Doctor. And you know what's fun about older cars? Now that I've convinced you that you can't keep your older car because there's no parts, let me tell you why they're fun and great to have. All right? We just added a 2002 Thunderbird, a Ford Thunderbird, to the family fleet. Had to make some repairs. Took forever to find parts. Really, really a tough gig. And, you know, kind of tooling around in that as a...",
        "start": 18.046,
        "end": 42.978
    },
    {
        "text": " My God, what a basic car. You know, it's got a radio that's only a radio. It's not an entertainment system. It's not a television set. It doesn't launch missiles. It doesn't have a backup camera built into it. It doesn't warn you when anybody's near you. It's a radio, and it's got these funny little buttons. You push it on, it turns it on. You push it again, it turns it off. It has these little sticky buttons called presets. You go ding, ding, ding, ding, ding.",
        "start": 42.978,
        "end": 67.927
    },
    {
        "text": " I think the most high-tech option on this car is you can lock the trunk with a switch. You put the key in and you turn it and the button won't go down. That's high-tech on a 2002 Ford Thunderbird. It's really kind of hilarious. You're just not used to any of this. New cars have spoiled us, I will tell you that. And sometimes it's just fun to get into something like that and just go for a ride because it's very, very mechanical. So that's one thing I will always enjoy about older vehicles.",
        "start": 67.927,
        "end": 95.111
    },
    {
        "text": " Let's go to Tom in Florida with some general battery questions. Tom, welcome to The Car Doctor, sir. How can I help? Hey, Ron. Good morning. Yes, sir. What's going on? Before I start, I think your website might be under that meltdown there because it's not working, the live thing on there. The stream? Okay. All right. Good to know. We'll take a look at that. Not a problem. Yes. But last year, I bought a battery for my daughter's Audi. It was...",
        "start": 95.111,
        "end": 123.097
    },
    {
        "text": " Yeah, it was just about a year ago, and it died last week. And we were looking at the battery, and it was dated two years when we bought it. It was dated two years ago. So are you saying the battery is three years old, or it was a year old when you bought it? Yep, it was two years old when we bought it, and now it's three, and it's dead. Okay, and what's the warranty on it?",
        "start": 123.763,
        "end": 151.783
    },
    {
        "text": " They actually covered it 100%. They gave us a new battery. We checked the data. It was fine. My question is, and maybe to warn other people, can they sell it forever?",
        "start": 152.995,
        "end": 165.145
    },
    {
        "text": " You know, it's a great question, Tom. It really is, and it is a concern. I will answer it like this, if I can, with a little story. So, you know, we stock batteries at the shop. And, you know, we just stock, I think, 10 or 12 of the common popular numbers and some of the not-so-common popular numbers. And I count on the battery truck to come around every couple of weeks, and he'll look at the date code on the battery and say, yeah, this one's got to go, this one's got to go, and they rotate your stock around.",
        "start": 165.776,
        "end": 192.961
    },
    {
        "text": " You know, it took me a while, but after so many years in the business, I finally asked the question one day. I said, so when you take these batteries out of here, if the battery is sitting longer than 120 days, they'll pull it from my inventory. And, you know, where does it go? You know, I kind of wanted to know that question. I'm just curious by nature. And to your point.",
        "start": 193.763,
        "end": 214.138
    },
    {
        "text": " They'll take that battery, and depending upon the part number, they will either put it at a location that has high recorded instances of using a 26R or a 34G or something like that, or they'll sell it off to other vendors. And I said, what do you mean other vendors?",
        "start": 214.138,
        "end": 231.032
    },
    {
        "text": " And the battery guy explained to me, and I've seen this a couple of times, so I believe it to be true. They will sell it off to bidders, road service companies, you know, the towing companies of the world, to say it calmly, that will buy that battery, recondition it. By recondition it, I mean they will put it through a recharging process.",
        "start": 231.886,
        "end": 253.541
    },
    {
        "text": " where they'll desulfate the battery, make sure it's up to charge, give it some load testing, make sure it passes, and then put their own label on it, their private brand label. So Tom's Battery Company, right? And they'll sell that as a new battery. Why? Because it's never been used, but it's old. Wow.",
        "start": 253.541,
        "end": 271.749
    },
    {
        "text": " All right. Yeah. And I see this a lot. And as convenient as roadside battery installation is and it isn't anymore because battery installation is getting to be a chore unto itself. You know, if somebody wants to if somebody wants to put a battery in their late model Ford Escape going up to about model year 2018, I'd pay to see that because it's it's a chore doing a battery. Half the car's got to come apart on that driver's side.",
        "start": 271.749,
        "end": 298.404
    },
    {
        "text": " So, you know, yeah, it's an issue. You know, if you're looking for battery information too, Tom, just to give it a real quick shout out, go out to autobatteries.com. Excellent resource, how batteries work, things to be concerned with, how to find a good battery, that kind of thing. But autobatteries.com can probably help you. And, you know, it's sort of like the online resource we use in the shop all the time. But it's not unusual. You know, is the car all right now?",
        "start": 298.575,
        "end": 325.162
    },
    {
        "text": " Yeah, yeah. I mean, put the new battery in, it works fine now. Right. Yeah, it's, you know, and the funny thing is, and I'm not sure why, but about five years ago, the industry changed. They used to prorate batteries.",
        "start": 326.015,
        "end": 341.067
    },
    {
        "text": " where you would use it so many months and get back so many dollars against it and such. They don't do that anymore. Most batteries today have a three. At max, I've seen a four-year warranty, maybe three and a half. And then after that, you're done.",
        "start": 341.254,
        "end": 358.422
    },
    {
        "text": " Yeah, there's no warning or anything. There's no warning or anything. You know, it's funny. I still see batteries as having a four- to five-year life cycle. You know, the online people are going to generate so much mail over this comment because everybody's going to write me and tell me, well, I got nine years out of my battery. Good, lucky you. The industry says, you know, listen.",
        "start": 358.422,
        "end": 381.647
    },
    {
        "text": " You're the guy stuck on the side of the road or in the parking lot at 2 o'clock in the morning when it won't start. The industry says four to five years. And AGM batteries, AGM batteries are a funny duck, right? They're a completely different type of battery in a sense. I've seen certain models gobble up batteries every three and a half years, and I've seen certain models go six years. But beyond six years, I'm putting a battery in it. And if I'm changing...",
        "start": 381.647,
        "end": 409.019
    },
    {
        "text": " If I'm changing the battery in a vehicle and it has a separate start-stop battery, I'm doing that as well because that battery is generally the same material, and obviously it's the same age. So if one went, the other went. Batteries are a very complicated conversation to have these days. They really are. And on a newer car, do you have to get start-stop now on a gas engine? No.",
        "start": 409.019,
        "end": 433.899
    },
    {
        "text": " You don't have a choice. It'll depend on what the manufacturer is trying to achieve from emissions values. The reason there's start-stop, let me answer it this way. The reason there's start-stop is manufacturers are trying to hit a certain fuel economy.",
        "start": 434.036,
        "end": 448.609
    },
    {
        "text": " Because how many cars they sell that get 40 miles to the gallon versus how many cars they sell that get 20 miles to the gallon, they get emissions credits and different compensation from the government because they're trying to clean up the environment. And, you know, that's really where all that start-stop technology came from. They're worried about emissions and gasoline. You know, there are ways to get around start-stop. There are some vehicles that come with a button that you can turn it off. You know, if the vehicle has a fault code in it, the start-stop will not work.",
        "start": 448.797,
        "end": 478.797
    },
    {
        "text": " in most experiences that I've had. If I get to a traffic light and I want to see if start-stop doesn't work, pop it into neutral. Just got to remember to hold your foot on the brake so the car doesn't roll. But, you know, sometimes popping it in neutral will take it away. I personally have an issue with start-stop real quick because I just worry that on an older vehicle,",
        "start": 478.797,
        "end": 498.677
    },
    {
        "text": " the abuse I'm putting on the starter, the, the, how, how good is that battery? Um, I don't want to find out, you know, late at night in a bad part of town, right. That my stop start battery isn't working. Um, you know, to me, I'd like to know once the car started, I'm coming home late at night, et cetera. I'm going to get there. Uh, you know, but shame on me. I try to think logically. Um,",
        "start": 499.599,
        "end": 524.718
    },
    {
        "text": " And, you know, I did an experiment, Ron, last year. I just bought a brand new car. I left it on. I didn't touch anything for six months. It said I saved a total of 0.97 gallons of gas. Well, listen, I can show you that the government's crazy.",
        "start": 524.718,
        "end": 542.108
    },
    {
        "text": " All right. You know, it's it's listen, move to New Jersey, move to move to New Jersey and go get a vehicle titled in North Jersey. I had to travel an hour and five minutes a week ago to go get a vehicle titled. But the agency that does registration is six minutes from the house.",
        "start": 542.108,
        "end": 555.316
    },
    {
        "text": " So, you know, but we're trying to clean up the environment and save gasoline. I want to know who makes up these things. Who thinks of this? Somebody that rides a bicycle, I bet. Yeah, if it wasn't for the government, the post office would be out of business. Right. Exactly right. We wouldn't need it. Yeah. It's crazy. All right, sir. I've got to run. Thanks for the info about the website, Tom. You have a great time. Get out to autobatteries.com, and that'll help you in the future, and you be well, and thanks for being part of the Car Doctor family.",
        "start": 555.759,
        "end": 582.841
    },
    {
        "text": " I'm Ron Ananian, The Car Doctor, 855-560-9900. I'll return right after this.",
        "start": 582.841,
        "end": 588.012
    },
    {
        "text": " Ronananian, the car doctor, is brought to you in part by Dorman Products, featuring the largest selection of direct replacements for failure-prone turbocharger system parts in the business. Learn more at DormanProducts.com. Clean, correct coolant is vital to the life cycle and operation of your vehicle's cooling system and engine.",
        "start": 608.592,
        "end": 626.152
    },
    {
        "text": " Peak Antifreeze Plus Coolant is specially engineered to deliver guaranteed superior lifetime protection. It's compatible for use with any color or type of antifreeze in your vehicle system. And with robust organic additives, Peak Antifreeze Plus Coolant will fight against the damaging effects of scale deposits and corrosion.",
        "start": 626.152,
        "end": 645.128
    },
    {
        "text": " You can learn more at peakauto.com. That's peakauto.com. Clarios is a global leader in energy storage solutions, powering one in three of the world's vehicles today. They offer the most advanced battery technologies for virtually every type of vehicle. We recently talked with Clarios Vice President of Technology, Craig Rigby. Craig touched on the future of electric and hybrid vehicles. Well, new vehicle production is definitely shifting towards hybrids, and in particular, electric vehicles at a very rapid pace.",
        "start": 645.128,
        "end": 673.524
    },
    {
        "text": " Claris estimates that out of the 1.7 billion cars expected to be on the road by 2040, up to 50% of those will be some combination of full, mild hybrids and electric vehicles. This shift will require a lot of change, not the least of which is having enough charging stations to make both daily driving and long trips practical. As different and complex as these vehicles have become,",
        "start": 673.916,
        "end": 695.623
    },
    {
        "text": " The basic things we do to maintain them won't really change, and that includes maintaining your 12-volt battery and changing it out when necessary. Learn more about AGM batteries at Autobatteries.com. That's Autobatteries.com. As a professional, you've got 1,001 things to track in your shop and zero minutes to slow down. AutoZone understands that and is here to help you keep your business moving. AutoZone has original equipment quality or better parts from brands you can trust. Leading in stock coverage.",
        "start": 695.828,
        "end": 725.179
    },
    {
        "text": " Fast hot shot delivery and easy to track online ordering so that you can get the right parts right when you need them. Keep it moving with AutoZone's professional edge. When it comes to making plans, you are the best. What about those round trips that you plan in advance, which are perfect on your way there and perfect on your way back?",
        "start": 725.179,
        "end": 753.012
    },
    {
        "text": " Or those meetings with friends for which you make a group chat three months before so that nobody or anything is missing. Or your daughter's first birthday party. You planned it with such dedication that instead of the first, it felt like our kinses. The same way you plan each detail for those moments. Start planning to protect you and your loved ones from a natural disaster.",
        "start": 753.695,
        "end": 779.599
    },
    {
        "text": " Hello? Hello?",
        "start": 780.026,
        "end": 805.316
    },
    {
        "text": " Ooh, I can't. I'm in bed with the flu. The flu? You didn't get a flu shot? I wish I did. I can't believe I'm missing out on Greg's wedding. Whoa, whoa, whoa. Grandma's about to crowd surf. Grandma's about to what? What?",
        "start": 809.565,
        "end": 827.415
    },
    {
        "text": " Sounds like another case of flu FOMO. Don't get stuck at home with the flu. A flu shot is safe, effective, and you can get it at the same time as your COVID-19 vaccine. A flu shot is the best way to prevent the flu and its potentially serious complications. It keeps you protected and also protects your loved ones. Protecting our community can't wait. So why get stuck inside with a flu? Don't get flu FOMO. Learn more at GetMyFluShot.org. Brought to you by the AMA, CDC, and the Ad Council.",
        "start": 833.49,
        "end": 861.237
    },
    {
        "text": " Hold my place before we get out of line. Take my license and call that guy. I can't ride. Fifty-five. Welcome back. Ron and Amy in the car, doctor, here to answer your questions at 855-560-9900. Let's go over to Travis up in Canada and see what's going on here. Travis, welcome to the car, doctor, sir. How can I help? Hi, Ron. Thanks for having me. How are you doing? You're welcome, sir. Good. What's going on?",
        "start": 867.346,
        "end": 896.22
    },
    {
        "text": " I got a 2003 Mitsubishi Eclipse. It's got 131,000 miles on it, and it's got the 2.4 liter motor in there. Right, yep. And I've been fighting a P0171 for, oh, I don't know, about eight or nine months. Right. And it's been off the road for a while just as I'm trying to diagnose and fix the darn thing.",
        "start": 897.671,
        "end": 919.394
    },
    {
        "text": " And yeah, I've kind of gone through the service manual and I'm kind of stuck. I don't know where else to go. I've checked for vacuum leaks, exhaust leaks, and I've fixed a few of those. And it's still throwing the code. The vacuum leaks I fixed have brought the short-term fuel trim back.",
        "start": 919.753,
        "end": 938.575
    },
    {
        "text": " down at idle which at first i thought that was oh hey maybe that was the problem but my long-term fuel trims driving and at idle and under load are stuck at 12.5 all the time okay so it's it's it's always got high fuel trims are the fuel trims high at idle or even going down the road",
        "start": 938.916,
        "end": 958.985
    },
    {
        "text": " Both. The long-term is just pegged out at positive 12.5 and at idle they were low 20s consistently before I fixed the vacuum leaks. And then now they seem to be long-term stuck at 12.5 and short-term is anywhere from plus, I'd say plus 7 to plus 10 all the time. Okay. So have you tried making this richer? Do you have any propane?",
        "start": 960.401,
        "end": 988.473
    },
    {
        "text": " I have, yeah, and immediately when I throw that in the intake, the trims come down. Okay, good. So that shows us DO2s are working, right? Yeah. It's able to respond. So sitting there at idle, warmed-up engine, have you looked at mass airflow grams per second? Yeah, I'm sitting at about 2.8. That's about right. That's about right. And then as you accelerate down the road, it increases, right?",
        "start": 989.804,
        "end": 1017.398
    },
    {
        "text": " Yeah, absolutely. Yeah. Okay. And have you poked around with propane? For like looking for leaks you mean? Yeah, just looking for a vacuum leak. I've smoke tested. I bought a smoke machine off Amazon and that's been great. That helped me find my other leaks. So now when I go into the brake booster or another line, the only minor leak that I have is",
        "start": 1018.575,
        "end": 1046.254
    },
    {
        "text": " It's almost like it has a mechanical throttle body with a throttle cable. Right. And it's coming out. There's a bit of smoke coming out where the spring is on the throttle body. I don't know if it's the throttle body shaft seal maybe. Okay. But I don't know if that's normal as the smoke machine builds up pressure, but that's the only spot I got smoke coming out in the intake side. Okay.",
        "start": 1046.783,
        "end": 1069.155
    },
    {
        "text": " And smoke's a great way to go and good initiative, right? I like your thinking. So a smoke machine generates about a half a PSI in most cases, depends on what yours is. But a smoke machine test is only half the equation, all right? I'd still like to do it with propane. So what sort of propane setup do you have?",
        "start": 1069.155,
        "end": 1090.35
    },
    {
        "text": " Oh, it's just a generic camping, like, yeah, like a torch. Oh, okay. Tell you what, sit tight, Trevor. Let me pull over and take the pause. When we come back, we'll finish up. I'm Ron Ananian, The Car Doctor. We'll be back right after this.",
        "start": 1092.073,
        "end": 1103.592
    },
    {
        "text": " Hi, we're the Goo Goo Dolls. We're fortunate that we can give our daughters everything they need to grow and learn, but not every child can focus on classes and play dates. Nearly 13 million kids in the U.S. face hunger. That's one in six. School lunch might be their only meal each day, and it's heartbreaking to imagine any child going to bed hungry. We're dreaming of a perfect day when kids can smile, play, and just be kids without worrying about where their next meal will come from.",
        "start": 1129.343,
        "end": 1155.845
    },
    {
        "text": " Feeding America is working to make that perfect day a reality. Each year, the Feeding America network of food banks rescues billions of pounds of good food that would have gone to waste. That food is given to families and children in need. Being a kid should be about doing things that make an ordinary day extraordinary. Learning to play an instrument, building a sandcastle, hosting tea parties. Hunger should never be an obstacle to growing up. You can help end childhood hunger in your community by visiting feedingamerica.org.",
        "start": 1155.845,
        "end": 1183.78
    },
    {
        "text": " Brought to you by Feeding America and the Ad Council. What I know about courage, I learned from my adoptive mom. She said sometimes you just got to hold on and know we'll get through this. Mom, we are so high up. Hold my hand. No, you hold my hand. Here we go. Woo!",
        "start": 1184.326,
        "end": 1204.787
    },
    {
        "text": " Learn about adopting a teen from foster care. You can't imagine the reward. Visit AdoptUSKids.org to find out more. I learned patience from my adoptive dad. All he had to say was, Hey, you got this. Just breathe. Hey, we're pretty good. Yeah. Might have to start a band.",
        "start": 1206.937,
        "end": 1232.551
    },
    {
        "text": " I heard the call to serve, so I answered. I earned a title and discovered my purpose. I found belonging.",
        "start": 1233.797,
        "end": 1258.848
    },
    {
        "text": " An unbreakable bond with my fellow Marines. We fought to overcome adversity together in defense of our nation and its people. I've lived a full life, rich with meaning. And even though I no longer wear the uniform, I am still a Marine. My service has come full circle.",
        "start": 1259.65,
        "end": 1283.848
    },
    {
        "text": " I will always look after those around me. I will always uplift and support my country and my community. Because that is the promise I made. That is what it means to be a Marine. Semper Fidelis. Always faithful. Always Marine.",
        "start": 1284.94,
        "end": 1306.254
    },
    {
        "text": " Hey, we're back. Ron and Amy in the Car Doctor at 855-560-9900. The Car Doctor's 24-7 hotline. Travis, you're there.",
        "start": 1324.019,
        "end": 1330.64
    },
    {
        "text": " I am, sir. Okay. I want you to take your propane bottle. All right. And you've probably got like the little crank on black knob that turns on and off. Like if you're going to light it to do plumbing work or light up a camping lantern, that kind of a thing. Right. Okay. So somehow you've got to nick that on. You've got to attach a black rubber hose or some sort of rubber hose to that. And then on the other end of that rubber hose, I want you to get a small piece of steel brake line, three sixteenths.",
        "start": 1331.766,
        "end": 1357.483
    },
    {
        "text": " And I want you to peen one end of that brake line down so it's just a point. So crush it flat. Typically what I'll do is I'll put it in a vice and I will peen it shut except for one little corner. I'm trying to make a pinpoint opening in the end of the brake line.",
        "start": 1357.483,
        "end": 1374.804
    },
    {
        "text": " All right. Now, when I open up the propane and I'm going to open it up slow, realizing that if something backfires, I've got a hand grenade in my hand. Right. OK. The dangers of auto repair, brother. All right. And I'm going to use that pinpoint like a wand and I'm going to direct it at specific things. And I can control the flow with the knob. I don't have to turn on a full just a little bit of a flow. Right.",
        "start": 1375.742,
        "end": 1397.602
    },
    {
        "text": " If you were to look at the O2 sensor by scan tool or voltmeter, whatever way you want to do it, can we agree that if you were able to get propane directly in that throttle shaft and it made a difference on how the O2 read, that it's making a difference on fuel trim?",
        "start": 1397.602,
        "end": 1411.681
    },
    {
        "text": " It should, yeah. Yeah? Right? Fuel trim is fuel trim. I mean, it doesn't know where the fuel or the air is coming from. So, you know, I want you to do that. That's the whole purpose of propane. Propane is not just in that big globular. If we were going to do massive amounts of propane like that, we might as well use carb clean from the 70s. All right? Right. The idea is, you know, propane can make a very pinpoint accurate diagnostic tool. All right?",
        "start": 1413.148,
        "end": 1438.353
    },
    {
        "text": " I want you to get a yellow notepad and just eliminate things. I want you to check fuel pressure, if you can. I've done that, yep. Good. You wrote down your results? Yeah, it was one PSI at curb idle over the spec. Okay. So I figured that was good enough. Take a look at the map sensor. Key on, engine off, you should see four to four and a half volts. Start it up, you should see a volt, volt and a half, something like that. But just be specific. Propane, the throttle body.",
        "start": 1438.353,
        "end": 1467.841
    },
    {
        "text": " Just make sure there are no vacuum leaks elsewhere. Leave the brake booster disconnected. All right. And then last, look around in the area of the O2 sensor. Any exhaust leaks, any exhaust leaks will skew that O2 and will contribute to a lean code. Do those things. Call me back. Until the next time, I'm Ron Ananian, The Car Doctor. Good mechanics aren't expensive. They're priceless. See ya.",
        "start": 1467.841,
        "end": 1489.94
    },
    {
        "text": " What is a number story? My number story started with fear and a lack of support, and it has led me to be there for others. A number story begins in our childhood with ACEs, Adverse Childhood Experiences. My number story begins with the separation from my father and the emotional abandonment from my mother and leads to me being a role model to not only myself, but those around me by becoming the person that wasn't there for me. ACEs are so common, two-thirds of us have one.",
        "start": 1497.346,
        "end": 1526.067
    },
    {
        "text": " My number story begins with drug abuse and homelessness and leads to realizing that I can live life by my own standards. A study found the more ACEs, the more likely we may experience a host of serious health effects, physical and mental, but that doesn't need to be the case. Your ACE number is simply an entry point to your own story. Where it leads is up to you. My number story begins with years of emotional abuse and leads to peace, clarity, and security in my self-worth.",
        "start": 1526.118,
        "end": 1554.514
    },
    {
        "text": " Take control of where your number story leads at numberstory.org. WZXI Lancaster, 1280 AM and simulcasting on 94.1 and 95.5.",
        "start": 1554.565,
        "end": 1567.824
    },
    {
        "text": " News this hour from townhall.com. I'm Jason Walker. Donald Trump and J.D. Vance holding a post-convention rally later today in Michigan. Riding a wave of momentum after leaving the GOP convention here in Wisconsin, Trump and Vance will hold their first campaign rally after accepting the Republican nominations for president and vice president.",
        "start": 1572.892,
        "end": 1594.121
    },
    {
        "text": " It will also be the first Trump rally since last weekend's assassination attempt at an outdoor event in Pennsylvania. The GOP nominees will address voters in Grand Rapids, with Michigan viewed as one of the most important battlegrounds in the 2024 election. Greg Clugston, Milwaukee.",
        "start": 1594.121,
        "end": 1611.186
    },
    {
        "text": " Also at townhall.com, the Democrats will soon be getting their turn in convention in the Windy City. Milwaukee, which hosted the Republican National Convention, has wrapped up its week in the national spotlight with Lessons for Chicago, which hosts the Democratic National Convention next month. The crowds in Chicago are expected to be much bigger, about 50,000 visitors. Activists predict tens of thousands of people will show up at demonstrations.",
        "start": 1611.186,
        "end": 1639.104
    },
    {
        "text": " Chicago police have been getting additional training. Milwaukee Police Chief Jeffrey Norman has some advice. Get lots of sleep, drink lots of water, make sure you understand your roles. The Democratic National Convention begins August 19th in Chicago.",
        "start": 1639.104,
        "end": 1655.572
    },
    {
        "text": " I'm Rita Foley. Israeli army today striking several Houthi targets in western Yemen following a fatal drone attack by the terrorist group in Tel Aviv earlier. Today's strikes appear to be the first by Israel on Yemeni soil since the war began in October. That global technology outage, grounding flights, knocking banks offline and some media outlets off the air yesterday after a faulty software update",
        "start": 1655.572,
        "end": 1683.575
    },
    {
        "text": " apparently disrupted companies and services all around the globe. More on these stories, townhall.com.",
        "start": 1683.575,
        "end": 1689.77
    },
    {
        "text": " Government debt is now exploding by an unprecedented $1 trillion every 90 days. Think of that. It's a clear sign that our nation's finances are spinning out of control, and it's putting the savings of every one of you at risk. Hello, I'm Lance Wallnau, a news analyst and best-selling author and an evangelical leader. I'm deeply concerned about the impact this runaway debt is going to have on Christians like you who have worked hard to build your own nest egg for your family.",
        "start": 1691.271,
        "end": 1716.647
    },
    {
        "text": " To protect your financial future in these uncertain times, you need to diversify with something tangible and proven, like physical gold. That's why I recommend a gold IRA. To learn more, text FAITH to the number 989898. And my friends at Birch Gold Group will rush you a free info kit on how to move your IRA or 401k to physical precious metals tax.",
        "start": 1716.647,
        "end": 1735.179
    },
    {
        "text": " and penalty-free. So don't wait. Just text the word FAITH to 989898 to get your free info kit on gold IRAs. Birch Gold Group is the only company I trust. There's no obligation. So text FAITH to 989898, and I pray this information helps you achieve prosperity and peace of mind.",
        "start": 1735.179,
        "end": 1751.084
    },
    {
        "text": " Wall Street Journal reporter Evan Gershkovich has been convicted of espionage that his employer and the U.S. vehemently reject. Gershkovich was sentenced to 16 years in prison after a secretive and rapid trial in Russia's highly politicized legal system. The conclusion of the trial could potentially clear the way for a prisoner swap between Moscow and Washington. The publisher of the journal called it a, quote, disgraceful sham conviction.",
        "start": 1752.278,
        "end": 1779.48
    },
    {
        "text": " That is correspondent Jeremy House reporting. Plane crash in northeastern Ohio has killed all three people on board. FAA says the twin-engine Beechcraft 60 went down near the Youngstown-Morn Regional Airport while attempting to make an emergency landing. Mail carrier has been shot and killed working in Chicago. U.S. Postal Service says Octavia Redmond had delivered mail for more than",
        "start": 1779.48,
        "end": 1805.759
    }
]