[
    {
        "text": " Over 25 years experience in construction projects, clearing land, site preparation, demolition, gravel, topsoil, foundation dirt. Taylor Dozer has it all and does it all quickly. For a free estimate, call Bruce Taylor at Taylor Dozer in Backhoe today, 318-508-1600. That number again, 318-508-1600.",
        "start": 0.009,
        "end": 21.237
    },
    {
        "text": " Remember the last time the power went out, the family sitting in the dark, maybe a few hours, so maybe even days sometimes. Are you ready to solve that problem? Briggs & Stratton has a variety of technologies, configurations, and capacities to keep your power on for as long as you need. Dex Outdoor Power in Anacoka, 337-263-3389. Call them for a free evaluation of your needs and for a free estimate. Next time when the power goes out, the lights come on and everything else stays on. Call today, 337-263-3389.",
        "start": 21.988,
        "end": 51.783
    },
    {
        "text": " There's a child in Kenya or Sierra Leone or India or Bolivia who you could connect with. And through ChildFund, it's possible. We may be thousands of miles apart, but we can still connect with each other. And when we do, we make things better. We connect children all around the world with what they need to grow up healthy, educated, and safe.",
        "start": 52.875,
        "end": 78.302
    },
    {
        "text": " That's what Child Fund is about. Together, we co-create, support, and sustain connections that lead to greater well-being for millions of children who live in poverty worldwide. In their families, in their communities, in their countries, and you. Join us. Together, we can make the world a better place. Two small worlds at a time. His and yours.",
        "start": 78.609,
        "end": 105.35
    },
    {
        "text": " Visit childfund.org to learn more. When a child is diagnosed with cancer, the last thing parents should have to worry about is how to pay for it. This is a St. Jude moment. Calvin got diagnosed June 10th of 2018. He has Rhabdomyosarcoma, a soft tissue cancer.",
        "start": 106.203,
        "end": 128.336
    },
    {
        "text": " One oncologist told us, if it was my son, we'd go to St. Jude. And within 24 hours, we were on a plane headed here. It's hard to fathom what St. Jude has done for us. They've really given our family hope. For the donors out there,",
        "start": 128.336,
        "end": 147.312
    },
    {
        "text": " It's just amazing. I never thought we would be in this place. And it's people like you that help us and help St. Jude provide for a family like ours. St. Jude is like the gold at the end of a rainbow. And we are so grateful and thankful for everything. Finding cures, saving children. Learn more at stjude.org.",
        "start": 147.312,
        "end": 170.691
    },
    {
        "text": " People do some pretty cool things in their 40s and 50s. Why should saving for retirement be any different? I mean, they go back to college. Learn new instruments. Start skateboarding.",
        "start": 171.8,
        "end": 187.193
    },
    {
        "text": " Okay, maybe that one's not for everybody, but saving for retirement is. With aceyourretirement.org, you can get on track with your retirement savings no matter your age. Just have a three-minute chat with Avo, the friendly digital retirement coach from AARP. You'll get personalized recommendations based on your input that are easy to understand and work with your lifestyle. It's quick, easy, and free. Plus, it's sponsored by AARP, so you know they got your back.",
        "start": 188.609,
        "end": 215.845
    },
    {
        "text": " Snarly move, Dad. Thanks, sweetie. So wherever you are in your retirement savings journey, head to aceyourretirement.org and start chatting with Avo today. That's aceyourretirement.org. A message from AARP and the Ad Council. At first glance, Terrence and Shania have nothing in common. Terrence is a musician. He's constantly traveling. He's 32 years old, single with no kids, and started smoking when he was 16.",
        "start": 216.271,
        "end": 243.643
    },
    {
        "text": " Shania, on the other hand, just turned 45. She owns a coffee shop. She is married with two kids and has never smoked. What makes Terrence and Shania similar is that they both have been diagnosed with small cell lung cancer, and it was caught early. That's right. Small cell lung cancer can affect anyone.",
        "start": 245.759,
        "end": 264.753
    },
    {
        "text": " The good news is early lung cancer screenings can detect small cell lung cancer before it spreads when the disease is most treatable. Join Stand Up To Cancer and Jazz Pharmaceuticals to raise awareness of small cell lung cancer and accelerate the pace of research. Ask your healthcare provider about screening options that might be right for you or a loved one. Visit standuptocancer.org slash lung to learn more.",
        "start": 265.111,
        "end": 289.565
    },
    {
        "text": " Great to have you along for the ride. Thanks a lot for stopping by. Glad to have this young lady on. Her name is Caroline Sunshine, who I think we probably have appeared on a television show or two together, but we've never met. Caroline, how are you? Good to see you.",
        "start": 301.288,
        "end": 311.561
    },
    {
        "text": " I am great, thank you. Like I said, better than Joe Biden outside the hours of 7 and 4 p.m. Great to be on your show. Well, I agree with you that you are better than Joe Biden, and you are great. She's the Deputy Communications Director for Trump 2024, which is awfully exciting. Now, I think that when we were probably on the same air at the same time, you weren't with the Trump campaign yet. How does something like that happen? Do they notice how excellent you are on these hits and how you communicate very well? How does that even come to fruition?",
        "start": 312.039,
        "end": 338.302
    },
    {
        "text": " I'd love to take that much credit. I've been an enthusiastic supporter of President Trump for a long time. I actually had the honor of serving in his White House. I was an intern in his White House press office, then had the honor of serving in his press office. And they always kind of say all roads can, you know, lead back to President Trump. And I'm so grateful to be on this team. I just think the stakes couldn't be higher for this country. And I've always thought ever since President Trump came down that escalator in 2015, that he was just the singular force in American politics. And it's truly my honor to get to play some role in",
        "start": 339.326,
        "end": 368.746
    },
    {
        "text": " this movement that he leads so so beautifully i don't want to go to memory lane too much but were you an intern in 2017 i was yes so i think we met at the white house because i was one of five shows that was invited there and my daughter sam is my executive producer we went to the white house and interviewed the president about the tax cuts that were coming up we felt very very honored i know that i've seen you somewhere i'll bet you might have been there when we were there",
        "start": 369.036,
        "end": 393.183
    },
    {
        "text": " You are taking me back. Oh, my gosh. I have such fond memories of our time in the White House. You know, just everything that President Trump was able to accomplish and the great American patriots. Just such a, what an honor. What an honor. That is so great. You're taking me down memory lane. Well, good. I'm glad that we went there for a second. Now let's talk about the future.",
        "start": 393.643,
        "end": 411.391
    },
    {
        "text": " I think Trump was going to do great anyway. I think he was going to win by a landslide anyway. And then all of a sudden, holy mackerel, not only is Joe Biden gone like you and I and like Donald Trump knew already, now the media and the Democrat Party is forced to face it. Do you shift gears at all in the campaign for Trump, knowing that everybody now knows that Joe Biden is no longer there? Or do you just keep on doing what you were doing?",
        "start": 411.391,
        "end": 436.817
    },
    {
        "text": " Yeah, well, like you said, I mean, President Trump didn't just win that debate. He absolutely dominated it. I mean, it's like watching a UFC fighter take down just three opponents in one. You know, it's like the takedown of Joe Biden, the liberal mainstream media, and the Democrat Party, all of whom, as you have said, this isn't just the story of Joe Biden's decline. It's the story of the liberal mainstream media and Democrat Party concealing the truth from the American people. These people have known for years.",
        "start": 438.097,
        "end": 463.251
    },
    {
        "text": " that joe biden was weak and incompetent in decline as of the american people except the liberal mainstream media and democrat party have concealed that truth saying no no joe's fine he sharpens attack he's doing cartwheels those same people now do not get to wake up and say let's go brandon if you know what i mean but no we have known the truth of joe biden for the last four years",
        "start": 463.251,
        "end": 484.377
    },
    {
        "text": " As has President Trump. We couldn't be prouder to have President Trump as the leader of our party and movement. And we are full steam ahead because long before the debate to end all debates, as I call it, President Trump was already winning and winning big. And that's because he's always been on the right side of the issues most important to the American people. And the American people have known about, yes, Joe Biden's decline for years, but they've also come to trust President Trump's strength and command.",
        "start": 484.377,
        "end": 510.486
    },
    {
        "text": " and his knowledge of the issues. And the debate was just simply another point to highlight that contrast. But we've been waiting big long before the debate to end all debates. Caroline Sunshine, she is the Deputy Communications Director for President Trump, Trump 2024. I guess what I meant by that was, was there a definitive shift",
        "start": 510.674,
        "end": 534.957
    },
    {
        "text": " from the president when he said, holy crap, you saw what just happened last night. I knocked it out of the park. He's gone. Instead of this, let's do this. Or is he full steam ahead, as you said, rally after rally after rally, 20, 30, 40,000 people showing up, standing room only. What's working was working. Why change it, I guess. So was there any definitive change after that night? Or no, let's just keep going.",
        "start": 534.957,
        "end": 557.039
    },
    {
        "text": " Absolutely. Let's keep going. Let's keep the Trump train going. You just saw President Trump last night in Miami. I thought that was a particularly excellent rally. President Trump always brings his best, but a lot of his family members were there last night, and I think President Trump is such a family man. That's something that never gets highlighted in the liberal mainstream media, but exactly. President Trump was winning big long before what ended up really being the death of Joe Biden's presidency and candidacy. And by the way, as we've seen, it doesn't matter who the Democrats put up. It doesn't matter if they end up with",
        "start": 558.268,
        "end": 588.148
    },
    {
        "text": " Sleepy Joe or with somebody more active outside of the hours of 10 and 4 p.m., nobody that they can put up can beat President Trump. So at this point, I just say to the Democrat Party, save yourself millions of dollars, you know, do the right thing for the country. Maybe just sit this presidential election cycle out because it's very clear who people want. And that's President Donald J. Trump.",
        "start": 588.336,
        "end": 605.896
    },
    {
        "text": " Exactly right. Caroline Sunshine, Trump 2024 deputy communications director. Are you guys trolling us? And let me tell you what I mean. I'm on the air yesterday and all the news comes out. He's going to announce his VP tonight. And I know that Donald Trump didn't say he was going to announce the VP. I know that you didn't say it. I know Liz Harrington didn't say it. I know that others didn't say it. So I know that Caroline Leavitt didn't say it.",
        "start": 605.947,
        "end": 626.237
    },
    {
        "text": " Are you guys leaking that out? Are you trolling us? Because everybody who's watching, when I tuned in during my show, he's talking about a million dollars to play golf against Joe Biden. So how do you think that happens? Is somebody in the media planting that seed? Is there anything to the fact that we might find out who the VP choice is before the convention or no? The liberal mainstream media planting seeds and being responsible? Joe, they would never. I'm shocked. Never.",
        "start": 626.237,
        "end": 654.48
    },
    {
        "text": " Well, since we're just among friends, I would tell you. No, I'm just kidding. Of course, the only person who knows who President Trump is going to pick as his vice president is President Trump. He's also the only one, by the way, who knows when he will announce it. But as you and I both know, he has a talent for making news. He does. Everybody will most certainly know. But you know what? I'll say this about his VP pick. Again, it couldn't be a further point of contrast. We're fielding endless questions and speculation of",
        "start": 654.821,
        "end": 682.671
    },
    {
        "text": " Who is President Trump going to select as his vice president? Just endless media speculation over it. You contrast that with the Democrat Party. Are there questions or is their VP nominee going to have to replace their nominee? And no matter who President Trump picks, he's certainly not going to select a DEI hire. He's going to select somebody who is going to be an excellent partner in helping him make America great, safe, strong, wealthy again, because he knows how high the stakes are for our country.",
        "start": 682.892,
        "end": 707.875
    },
    {
        "text": " You know, George Clooney called the White House today. I don't know if you heard about this. George Clooney, of course, this leftist actor from Hollywood, I guess he was mad that the Biden administration said something about some organization that his wife is involved in. But allegedly, he's calling for Biden to drop out of the race. Carolyn, are you surprised, as I am, that some of these staunch...",
        "start": 709.053,
        "end": 727.637
    },
    {
        "text": " boots dug into the into the dirt liberals are backing away from this guy because again they all knew it we just mentioned this they all knew it before the debate but now that the debate is out there and people that are soccer moms are working all day or doing whatever got to pay attention for an hour and a half they're all jumping ship are you surprised by some of the names that are backing their support away from joe biden",
        "start": 728.029,
        "end": 747.961
    },
    {
        "text": " not shocked because these people love power than they more than they love the country and they always have but certainly when you see i mean just about everybody jumping ship everybody from george stephanopoulos to to george clooney these people a month ago were some of the most ardent supporters of joe biden right i mean i think george clooney should have to explain well if you knew back then that joe biden was the man in decline that we all saw on the debate stage",
        "start": 749.377,
        "end": 775.213
    },
    {
        "text": " Why did you give him $14 million? And by the way, the fundraiser that George, since we're on the topic of that fundraiser, the fundraiser that George Clooney mentioned",
        "start": 775.213,
        "end": 784.599
    },
    {
        "text": " There's another person who was in attendance at that fundraiser who's had a front-row seat to Joe Biden's decline and who has been silent. But that's President Barack Obama, who babysat Joe Biden on that stage. So like I said, they've all known. There's nothing shocking about this. I think the only thing that is shocking is that these people have been willing to let this country go to hell in a handbasket before they have ever lifted a finger to tell the truth. And the only time they've told the truth is when it was about power, not about love of country.",
        "start": 785.316,
        "end": 810.725
    },
    {
        "text": " Well, yeah, we were supposed to watch that video of Biden frozen and Obama grabbing him by the wrist and taking him out and patting him on the back. Come on, Joe, let's go as he sashays or shuffles off the stage. We were supposed to believe that was a cheap fake. And it was a cheap fake when Biden froze at the Juneteenth celebration amidst all these people dancing and he just was lost. I mean, we were supposed to believe none of that was true. You and I made fake videos about it. And then they, for some reason, they put him on a stage for an hour and a half.",
        "start": 810.725,
        "end": 837.278
    },
    {
        "text": " Was President Trump, were you, was the campaign surprised that Joe Biden said he would debate? I was stunned.",
        "start": 837.278,
        "end": 843.08
    },
    {
        "text": " Well, President Trump said he would debate him anytime, anyplace, anywhere, and he certainly made good on that promise. I guess also, you know, you saw President Trump invite him to, maybe if Joe doesn't want to debate, he'll join him in a round of golf. And I would say this, President Trump very much proved that he'll debate anytime, anyplace, anywhere. He also proved he can win anytime, anyplace, anywhere, and that includes the golf course.",
        "start": 845.213,
        "end": 867.483
    },
    {
        "text": " According to the latest polls, Caroline, and you know this is Caroline Sunshine from the Trump campaign. According to the latest polls, President Trump's leading in every battleground state. Every one. Rather easily in some. And in fact, some historically blue states. I think New York is in play. Maybe it's my heart speaking. Maybe I'm being biased. But when he was able to, because they were dumb, they left him in New York City for six weeks.",
        "start": 867.517,
        "end": 889.633
    },
    {
        "text": " He was able to go to Harlem every day and take selfies. He was able to go to the local, you know, sandwich shop, local pizza place, local ice cream shop, and really get to know people. You had people show up when you were allowed 3,500, I think, at the rally in the Bronx or whatever it was. And then, you know, they had to turn away 20,000 or something. Go to New Jersey and get a million or not a million, 100,000 people show up to a rally. He might flip some blue states that we haven't seen go red since Reagan. Is that the feeling inside the campaign that you can do that?",
        "start": 889.633,
        "end": 915.828
    },
    {
        "text": " Absolutely. I mean, you know, you look at President Trump actually said this really eloquently when he was in Philadelphia. He was asked, he said, you know, sir, why are you coming here? This isn't a place where traditional Republicans go. This was long before the debate to end all debates. And he said, you know what? It's because I've realized there is so much love out here and people really need hope.",
        "start": 917.585,
        "end": 937.159
    },
    {
        "text": " And that's what I'm here to do. And so you've seen President Trump go to the deep blue Bronx. You've seen him go to Detroit. You've seen him go to parts of Philadelphia that traditional Republicans don't go to. Where has Joe Biden been? Has Joe Biden been to any of those places? No. He was having to be babysat on stage at a fundraiser by Barack Obama and sequestered away at Camp David, none of which made a difference, I might add. So everybody who is abandoning Joe Biden is flocking to President Trump. And we are seeing states that are in play, blue states that are in play for the first time in decades.",
        "start": 937.159,
        "end": 966.169
    },
    {
        "text": " That's really a credit to President Trump and his message. He's on the right side of the issues that are most important to the American people. He was just intricately involved in putting together our party's platform. And I love that that platform at the top of it says, this platform is dedicated to the forgotten men and women of America.",
        "start": 966.288,
        "end": 983.131
    },
    {
        "text": " And President Trump has always said, he hasn't said, I'm going to make the Republican Party great again. He has always said, I'm going to make America great again. He's going to be president for all Americans. And when you look at the things that he stands for, like securing our border, stopping the invasion that is occurring at our southern border, helping to protect our women and children from being killed by violent, illegal immigrants.",
        "start": 983.131,
        "end": 1001.186
    },
    {
        "text": " restoring our manufacturing base, restoring our standing on the world stage, a country we can be proud of, a country that is respected and feared. Those are things that resonate with all Americans. I also might add, you look at Joe Biden, what he's been able to do to the U.S. economy. My goodness, he makes Jimmy Carter look like a lightweight. Whether you're black, white, or brown in this country, everybody's money's green, and nobody has enough under Joe Biden. So that's why we're seeing all these groups who are traditionally part of Joe Biden's voter base, African Americans, union workers, independents, young people, women, flock to President Trump.",
        "start": 1001.186,
        "end": 1030.64
    },
    {
        "text": " You know what the weirdest thing is about the economic debate, Caroline, is that the left really is looking at the camera and saying something like this. They just don't realize how good they have it. They don't realize the economic improvement they've had. And people in America are going, it doesn't matter what my race is, like you said, or what my orientation is or what my gender is or my ancestry. What matters is I can't pay my bills. What matters is my bank account has been decimated by this president.",
        "start": 1030.913,
        "end": 1054.309
    },
    {
        "text": " Why do you think, and I don't want you to get into the brains of the other side's campaign because that might hurt your head, but why would they ever look at the camera and say, don't believe what you're actually living through, believe what we're saying?",
        "start": 1054.804,
        "end": 1065.708
    },
    {
        "text": " Well, these people are wildly out of touch with the American people. They always have been. These are limousine liberals. I know we all know that Joe Biden is a few French fries short of a happy meal, but these people couldn't tell you the cost of a happy meal. And by the way, a Big Mac today costs $7.49, which is an 87.7% increase from just five years ago. You go to the grocery store, try to buy a bag of barbecue chips, $6.19. You go to fill up your gas tank, $4 or $5, depending on where you are in the United States.",
        "start": 1067.176,
        "end": 1096.442
    },
    {
        "text": " But these people are so out of touch. It's always rules for thee, never for me. It's the same reason they're so out of touch on any of the issues that are important to the American people, like what's going on at the southern border. These people live in gated communities. They have no idea that every town has become a border town. They are so out of touch with the American people. And it's why they really don't have, not only do they appear as not to have a candidate viable who can run, they don't have a viable platform to run. They cannot offer the American people solutions to their problems",
        "start": 1096.596,
        "end": 1124.428
    },
    {
        "text": " chiefly because they are so out of touch with what the problems are to begin with. These people think that Americans want electric vehicle mandates. No, no, no. Americans don't want that. They also don't want free flights and free housing for illegal immigrants. They want those illegal immigrants that Joe Biden has welcomed into our country by the millions, and who, by the way, he wants to give them the right to vote, right, as we just saw in Congress.",
        "start": 1124.428,
        "end": 1143.183
    },
    {
        "text": " They want mass deportations for illegal immigrants. 62% of Americans want that. So these people have always been out of touch. They have their heads in the sand. They do not live the reality that the American people live. And it's why not only Joe Biden is unfit to serve, it's why the Democrat Party is unfit to serve.",
        "start": 1143.183,
        "end": 1157.551
    },
    {
        "text": " It's Caroline Sunshine, Deputy Communications Director, Trump 2024. I appreciate the time and the access. You brought up immigration a lot, and you should, because that is the most important stateside, the most important issue, period, for Americans. But the left has done a very good job through big academia, big Hollywood, big music, big sports, big television news media. These people, academia, they all have been saying it's not that it's abortion.",
        "start": 1157.858,
        "end": 1182.568
    },
    {
        "text": " it's not that it's some other you know issue that they think they have an upper hand on trump as somebody in the campaign do you have to see what they're doing and react or just as i said earlier keep on doing what you're doing you're right immigration is the most it's the existential threat if you if you don't mind they always say that that word but it's the biggest threat to our democracy to our representative republic it's the biggest threat to our future it's the biggest threat to our way of life western culture all of that stuff it is the most important issue they've done a really good job though carolina trying to change the topic",
        "start": 1182.568,
        "end": 1212.329
    },
    {
        "text": " Do you have to adjust to that as a campaign or not? Well, I would say if we don't have a border, we don't have a nation. And if they want to talk about being pro-life or pro-choice, I'm happy to talk about being pro-life all day long. You cannot be pro-open border and be pro-life and be pro-women and be pro-children. As we have seen, millions of illegal immigrants come across our southern border. Look at who the victims of most of those violent crimes have been.",
        "start": 1212.329,
        "end": 1236.067
    },
    {
        "text": " they've been very vulnerable women and children. So if we wanna talk about empowering women, protecting women, protecting life, we absolutely have to talk about securing our border. And I think that's what women want. Women don't like weak men. They want a strong leader like President Trump. Women understand that weakness invites chaos and danger. And once again, that's why, like you said, immigration is the number one issue for a reason. And it's an issue that has long been overlooked and intentionally ignored",
        "start": 1236.357,
        "end": 1263.114
    },
    {
        "text": " by the Democrat Party, who once again is so out of touch with where millions of Americans are at on a host of issues, not just that one.",
        "start": 1263.2,
        "end": 1270.06
    },
    {
        "text": " Go follow her on social media. It's Caroline Sunshine with the Trump campaign. Last question, sort of tongue-in-cheek. Again, I saw the president yesterday vamping away from the teleprompter, which I love when he does that. And he offered up a million dollars to Joe Biden's favorite charity should Biden beat him in a golf match. I mean, Trump is not playing. He's a real golfer. He's a very good golfer. And Biden, of course, lied about a sex handicap or a nine handicap or something. Trump said he'd give him 20 strokes. I mean, would it freak you out if somebody from the Biden campaign said, yeah, let's do it?",
        "start": 1270.333,
        "end": 1298.695
    },
    {
        "text": " Look at my face, Joe. Does it look like it would pick me up? Come on. Give me a break. President Trump checked Joe Biden in real-time on the database. He said, Joe, you have told so many lies tonight, but the biggest one is that you have a six handicap in golf. Give me a break. I mean, if Joe Biden has a six handicap in golf, I'm a Democrat, okay? So give me a break, Joe. Well, then it's guaranteed that he doesn't have a six handicap then. It's Caroline Sunshine, Deputy Communications Director, Trump 2024. Love having you on. Come back again soon, would you?",
        "start": 1301.203,
        "end": 1330.503
    },
    {
        "text": " Thank you so much. Thank you. I will. You're very welcome. We're back after this at the Joe Pag Show. Stay here. This is the Joe Pag Show.",
        "start": 1331.34,
        "end": 1347.142
    },
    {
        "text": " Oh, no. Stomach issues again? Stomach issues? Who are you? Your pancreas. I could be the real reason for your diarrhea, gas, bloating, stomach pain, or loose oily stools. I thought it was my stomach. People often do. But any of these symptoms could mean having a condition called exocrine pancreatic insufficiency, or EPI. With EPI, the pancreas doesn't release enough enzymes to break down food. But EPI is manageable.",
        "start": 1355.35,
        "end": 1377.517
    },
    {
        "text": " Use the symptom checker on identifyepi.com and speak with your doctor. That's identifyepi.com. Sponsored by AbbVie. Hi, I'm Angie Hicks, co-founder of Angie. When you use Angie for your home projects, you know all your jobs will be done well. Roof repair, done well.",
        "start": 1377.517,
        "end": 1394.275
    },
    {
        "text": " Kitchen sink install? Done well. Deck upgrades? Done well. Electrical upgrade? Done well. Angie's been connecting homeowners with skilled pros for nearly 30 years, so we know the difference between done and done well. Hire high-quality, certified pros at Angie.com. Getting quality employees to fill positions in your company is essential.",
        "start": 1394.275,
        "end": 1417.432
    },
    {
        "text": " But finding those people can be a major hassle unless you use ZipRecruiter. ZipRecruiter makes finding quality people a breeze. And right now you can try it for free at ZipRecruiter.com slash free. With ZipRecruiter, one click sends your job to hundreds of top job sites. But more than that, ZipRecruiter's advanced technology identifies the candidates with the skills you need.",
        "start": 1417.756,
        "end": 1438.558
    },
    {
        "text": " sends you a list of great matches to review, then actively invites them to apply for your job. And the results speak for themselves. Four out of five employers who post on ZipRecruiter get a quality candidate within the first day. That's right, the first day. Now you can focus on your business and let ZipRecruiter do the work finding the best people for you. See for yourself.",
        "start": 1438.558,
        "end": 1460.162
    },
    {
        "text": " Experience the ease, efficiency, and power of ZipRecruiter for free. Just go to ZipRecruiter.com slash free. That's ZipRecruiter.com slash free. ZipRecruiter.com slash free.",
        "start": 1460.162,
        "end": 1472.756
    },
    {
        "text": " Mowing your yard can be something you look forward to with a new Bobcat or Redmac zero-turn mower. Dex Enterprises in Anacoco, Louisiana has a large selection in stock. Come in and see which one fits your yard today. Dex Enterprises also has a great selection of Bobcat tractors and a variety of implements, such as Armstrong, AG, Bushhug, and more. Dex is your authorized Kawasaki dealer. Dex provides small engine repairs on all brands. Dex Enterprises, 171 Anacoco, phone 337-263-3389.",
        "start": 1475.162,
        "end": 1503.456
    },
    {
        "text": " Hillpatrick's Roseneath Funeral Home and Cemeteries Incorporated has been serving northwest Louisiana since 1932 with dignified, thoughtful, and personal service. The staff of Roseneath invite you to visit our facility. We offer a complete line of funeral services. Our staff helps make a very difficult time a little easier for you. Please come by or call for information on prearranged services, funeral costs, and any other questions you may have. Roseneath Funeral Home, located 9891 Texas Highway in Manning. Phone 256-0690.",
        "start": 1505.282,
        "end": 1533.302
    },
    {
        "text": " Do your computers bring your business down, stress you out, cost you time and money? SATCOM and Computers is here to help. Let our managed services work for you. One partner, one fixed price, one unbeatable solution. Call SATCOM and Computers today at 318-256-1213. That's 318-256-1213.",
        "start": 1537.278,
        "end": 1562.363
    },
    {
        "text": " Looking to turn your old gold jewelry and coins into cash? Look no further than Robert Gentry. Robert offers the best prices around. Call him at 318-332-8653 to schedule an appointment to visit his office at 605 San Antonio Avenue in downtown Manning. Turn your treasures into cash with Robert Gentry, your trusted gold buyer. Call 318-332-8653 today.",
        "start": 1566.22,
        "end": 1593.37
    },
    {
        "text": " We appreciate Caroline Sunshine coming on from the Trump campaign. I did not realize this. I guess she used to be an actress on Disney or something. My daughter Gabby used to watch. Sam, you were mentioning she used to be on a show. I looked it up, or you sent me a link, and she was on with Zendaya. So I guess she was kind of a big deal. I don't know. I guess so. Did you ever watch it?",
        "start": 1601.459,
        "end": 1621.527
    },
    {
        "text": " I'm a little older than that, but I believe that Gabby probably really enjoyed it. Well, she did. I mean, I texted Gabby during it. She said, oh, yeah, of course I know her. So very nice to talk to her. Very nice to meet Caroline. We'll have her back on again. Certainly tomorrow, a big show coming your way. Carrie Lake, Rick Grinnell. We've got Matt Gates on tomorrow. There's a lot going on heading into the into the RNC where I'm not going to go to the RNC.",
        "start": 1622.449,
        "end": 1643.183
    },
    {
        "text": " We're going to have our friend and reporter Brianna Morello will be there. She'll be doing reports from there. But we're leading up to that. We're going to have all the big players. Do not miss a second of the Joe Pag Show. That's Sam. That's Polo. That's Kerry. I'm Joe. We'll see you tomorrow. Have a good night. This is the Joe Pag Show.",
        "start": 1643.183,
        "end": 1659.633
    },
    {
        "text": " Do you hear that? Asthma triggers are everywhere, from dust mites, pet dander, and pollen, to smog and smoke. An asthma attack can strike anywhere, anytime. Be prepared with quick-acting primatine mist, clinically proven to open airways quickly.",
        "start": 1664.104,
        "end": 1681.527
    },
    {
        "text": " It's the number one FDA-approved asthma inhaler available over the counter. Primatine Mist. Breathe easy again. Use as directed. Hi, I'm Angie Hicks, co-founder of Angie. And one thing I've learned is that you buy a house, but you make it a home.",
        "start": 1682.875,
        "end": 1698.217
    },
    {
        "text": " Because with every fix, update, and renovation, it becomes a little more your own. So you need all your jobs done well. For nearly 30 years, Angie has helped millions of homeowners hire skilled pros for the projects that matter. From plumbing to electrical, roof repair to deck upgrades. So leave it to the pros who will get your jobs done well. Hire high-quality certified pros at Angie.com.",
        "start": 1698.217,
        "end": 1721.101
    },
    {
        "text": " No airfare, no traffic jams. A vacation that you will remember is waiting at Cypress Bend Resort, your hospitality hideaway. Located on the shores of Toledobin Lake, fishing capital of the south, newly renovated 18-hole championship golf course, unmatched service on the on-site Cypress Bend Spa, plus state-of-the-art conference center for meetings and events. Cypress Bend Resort with gorgeous outdoor venues for special events. The best days of your life await you at Cypress Bend Resort on Toledobin Lake.",
        "start": 1722.483,
        "end": 1750.077
    },
    {
        "text": " If you're ready to add a swimming pool, lots of things to consider. What type? What size? What color? What price? Maybe the most important decision is who do you trust to install that pool for you? In this area, Phillip Pitt has gained trust as a contractor that will get it done correctly, professionally, and at a great price. Phillip Pitt has been at Pleasure Pools in Hagewood on Highway 6 for over 20 years. You want it done right. You want someone close that can provide the service. You want to call Phillip at 318-357-9000.",
        "start": 1752.09,
        "end": 1781.937
    },
    {
        "text": " Hey there, it's Robert with Foy Chevrolet, GMC, and Manny. Have you noticed all the new GMC Sierras we have? Well, to make a long story short, it's a bunch, and we have the deals to send them home to you. If you own a 2010 or newer GMC or Buick, you don't have to trade it in, but you will save $82.50 on in-stock 2024 Sierra half-ton AT4s or Denali half-tons equipped with either the 6.2-liter V8 or 3-liter Duramax diesel. Come see our great selection of Sierras as well as our complete lineup of professional-grade GMCs",
        "start": 1784.718,
        "end": 1812.995
    },
    {
        "text": " at the corner of Church and San Antonio or shop on",
        "start": 1813.234,
        "end": 1815.896
    }
]