[
    {
        "text": " that he saw that he had been shot. What was your reaction? Not really pretty. I was really upset. Yeah, it was really, really shocking and upsetting. I was out getting food. I was waiting in the car for my husband to get back from picking up food, and my phone started blowing up because people started texting me. A lot of people...",
        "start": 0.009,
        "end": 27.739
    },
    {
        "text": " and media i guess still thinks that i work for him too so they were trying to get some reaction or figure out what was going on so i went straight to twitter which thankfully we have honestly yeah shout out to elon boy did he say that right i mean it's it's a resource you know to get unfiltered news immediately when you're not you know in front of the tv um my parents were",
        "start": 27.739,
        "end": 53.814
    },
    {
        "text": " in the kitchen but at home and they actually had the rally on and were able to you know run in and rewind it and see it live i mean so many people saw it live um so yeah it was it was really upsetting um",
        "start": 53.814,
        "end": 68.08
    },
    {
        "text": " And it was it's kind of one of these things that is so shocking. But in the back of your mind, you you kind of knew that this would happen. I think we've all felt like he was really at risk. And you don't want to voice that. You don't want to bring it to any thought because it's so horrible. But.",
        "start": 69.394,
        "end": 90.316
    },
    {
        "text": " You know, logically, you know, they're very desperate. These are very evil people, very desperate. They stole the last election. They've tried to bankrupt him. They have tried to imprison him. And it's all falling apart. It's not working. It's only made him stronger. And just by literally the grace of God, Jesus Christ saved him.",
        "start": 90.776,
        "end": 118.456
    },
    {
        "text": " him. I mean, there's no doubt about it. I think that's something that after being able to digest it first being like realizing, okay, it looks like he's okay. So there was some relief. There's a lot of anger though, too, because none of this should be happening, right? None of it should be happening. None. Uh, this man should be in the white house.",
        "start": 118.456,
        "end": 143.404
    },
    {
        "text": " Our country should not be going through any of this. Yeah, he should have been there in 2020. Yeah, but after being able to kind of, you know, see, you know, what happened and that he was okay, and tragically, but it's just so not okay.",
        "start": 143.404,
        "end": 160.674
    },
    {
        "text": " A man was killed, two other really critically wounded. It's just, it's sick. Well, and the thing that's so stunning is we all have heard the sound clips from Maxine Waters and Madonna and Rachel Maddow and who else?",
        "start": 160.879,
        "end": 180.213
    },
    {
        "text": " Others, Schumer, you know, you know, against the judge, you know, they've all threatened us. And when they threaten President Trump, make no mistake, they're threatening us. I take it personally because I am aligned with what he says. So if he's threatening him, if they're threatening him for his ideals, they're threatening me. It's very personal and that they have gotten away with this.",
        "start": 180.213,
        "end": 209.65
    },
    {
        "text": " with no accountability, no ramifications, no go to jail for six months for saying, you know, I just have this thought about blowing up the White House, as Madonna did. I mean, if I said such things, they'd be pounding on my door. And they should. So it's stunning to me how...",
        "start": 210.606,
        "end": 238.951
    },
    {
        "text": " Out of sorts we are as a nation. And, you know, we'll move on to, you know, how do we go forward. But I think we have to reconcile that this is so broken. And to your point, it's so evil. It's so driven by power and corruption.",
        "start": 240.316,
        "end": 259.309
    },
    {
        "text": " I mean, by the way, we want to also mention that his case with Jack Smith was thrown out, which it should have been, never should have been brought, but they threw it out.",
        "start": 261.22,
        "end": 274.531
    },
    {
        "text": " You know, the DOJ is starting to, I think, have an accounting for their behavior, you know, because they've been weaponized against President Trump and Jay Sixers and other innocent people who have stood up for what they believe was the right thing.",
        "start": 276.442,
        "end": 293.404
    },
    {
        "text": " You know, think about Georgia. I'm traveling a bit. But the point is, in Georgia, with that series of cases against those people who said, wait, we don't think this is a fair election. We think we need to double check this. Just look, because I think you might find an extra number of votes there because, you know, as President Trump said on that call, right? They're saying, look, something isn't right.",
        "start": 293.797,
        "end": 321.032
    },
    {
        "text": " We have the right to challenge, don't we? Corruption?",
        "start": 322.176,
        "end": 326.237
    },
    {
        "text": " But they made it illegal, and they put us on the defense. I think that shifted this week. And I think people have finally said, I said it a while ago because I'm not afraid. I'm not afraid. But many people were because they don't want their lives disrupted, and I get it. They don't want to be thrown in jail like a Jay Sixer with a key thrown away because they show up at a rally. Right.",
        "start": 327.108,
        "end": 353.968
    },
    {
        "text": " So or get shot like that man got shot. I mean, it's so sad. But I think we've all said, you know what? I'm ready. I'm standing up and I'm not afraid. And I think that's what this week is. What do you think? Yeah, I think it's.",
        "start": 353.968,
        "end": 369.172
    },
    {
        "text": " Really, it's another opportunity that really this country doesn't deserve. But this nation is on the brink, and it's so close to just completely being catastrophic. I mean, if God had not intervened, I mean, we might not be even having a show today, right? Because you don't know how quickly...",
        "start": 369.974,
        "end": 395.128
    },
    {
        "text": " And the crackdowns could start. I mean, who knows what would happen? But things would get really ugly really fast. And that this nation has just been on the brink. And I think God is really giving us a chance to turn back to him. And I mean, because you look at that and it's a choice.",
        "start": 395.128,
        "end": 415.93
    },
    {
        "text": " to make you see there's no way there's no way uh it's funny that you bring up georgia and these things too because a lot of the narrative coming out which is not working is that sudden somehow this is just incompetence right all these things it's just incompetent and well if you think about fulton county that was the excuse too right in georgia for their election so it's just incompetence well if it's just incompetence",
        "start": 415.93,
        "end": 445.316
    },
    {
        "text": " How did they arrest you for speaking out about their incompetence?",
        "start": 445.674,
        "end": 450.196
    },
    {
        "text": " It's not incompetence. It wouldn't be threatening. Incompetence is a cover for corruption. And I think it always has been. And people are seeing through that now. And we're not going to be lied to any longer. And we're seeing things so much more clearly. And no one's going to buy it. No one's going to buy whatever excuse they give. A sloped roof.",
        "start": 450.333,
        "end": 475.93
    },
    {
        "text": " too dangerous oh but uh right it's i mean people just are are not they have a choice now and they're able to wake up or just i guess bury your head in the sand but i think it's a real opportunity for our country to just turn back to god that's what's wrong with our country",
        "start": 475.93,
        "end": 496.63
    },
    {
        "text": " That's why we don't have justice. That's why we don't have things going well. It's because we've turned away and corrupt evil people have just totally taken over. And I think so many...",
        "start": 496.63,
        "end": 515.589
    },
    {
        "text": " know that's wrong and don't want that to be the case. And the more we we turn to what's good and righteous, that's what we need to do. I just really think and there's a I think President Trump thinks that I think I'm so excited about the convention and his speech he gave. I just think it's it's really powerful and it's a real opportunity for this nation to",
        "start": 515.589,
        "end": 543.933
    },
    {
        "text": " To really be great again, right? And how do we become great again? That's how we become great. To become good again. And that's only through God. Well, and we say in God we trust. And if we're not living that, well, we say this in transformational work. If you're not true to what's authentic for you, and if in God we trust is our mission, that's what we say we are. If we're not true to that,",
        "start": 543.933,
        "end": 569.155
    },
    {
        "text": " Immediately things go awry. I mean, as soon as you go off course like that and you lose sight of that fundamental exchange, that intersection of God and country and family and faith and freedom.",
        "start": 570.367,
        "end": 591.186
    },
    {
        "text": " And all that goes with in our daily lives, as soon as you lose sight of that, you can no longer have a country that is sound because you've lost track of your fundamental purpose and mission and doctrine, which is in God we trust. And the reciprocal has to be true. Like he's got to trust in us, too. Right. It's a two way street.",
        "start": 591.186,
        "end": 616.698
    },
    {
        "text": " Right. Yeah. And I mean, you were kind of getting to the question of can we have a fair election? Well, I mean, will it be actually fair? Probably not. But can President Trump insist on having immigration stats on the jumbotron for the first time in a really long time at a rally that makes him move his head so slightly that",
        "start": 617.125,
        "end": 646.101
    },
    {
        "text": " I mean, so many decisions and things had to happen for that exact moment. Gives me goosebumps, really. It is possible to have, you know, righteousness win. It is possible. It absolutely is possible.",
        "start": 646.101,
        "end": 663.558
    },
    {
        "text": " Well, and we have to do our part and we keep saying that, right? Like each and every one of us has to say, when you're at the polls or you're at a ballot box and you see somebody dumping 50 in there, take a picture, get his face or her face, know who they are, hold them to account, call the authorities. This accountability and documentation...",
        "start": 663.558,
        "end": 687.022
    },
    {
        "text": " And just think how hard it's going to be for them to sell it now. I mean, now they've tried to kill him and they failed. I mean, is anyone going to believe no matter who, what Democrat they put up that they will win? No one's going to believe it.",
        "start": 687.022,
        "end": 703.097
    },
    {
        "text": " They're really not. It's going to be interesting. So when we come back, what I'd like to do is take a quick break, and then when we come back, we're going to have my guest share his thoughts as a business owner, and then we'll talk some more about this. You're listening to The Jen Charlton Show. I have with me today Liz Harrington, and Liz worked closely in the past with President Trump, and she's now a civilian mom. Yes.",
        "start": 703.097,
        "end": 726.886
    },
    {
        "text": " Not a soccer mom, a civilian mom. They're too young for soccer. They'll get there. All right, everybody, we'll be right back. This is 930 WFMD and WFMD.com.",
        "start": 728.473,
        "end": 740.503
    },
    {
        "text": " WFMD News.",
        "start": 743.183,
        "end": 762.022
    },
    {
        "text": " He was also ordered to pay $2,000 in restitution. Federal prosecutors say Cook violently participated in the attack on the Capitol on January 6th, which delayed the certification by Congress of the Electoral College votes from the 2020 election. That included assaults on police officers. In one instance, prosecutors say Cook took a Metropolitan Police officer's baton and punched another officer.",
        "start": 762.022,
        "end": 785.981
    },
    {
        "text": " What Frederick police officers do on the streets each day is being featured on national TV. Some local police officers made appearances on the program on Patrol Live last Friday and Saturday nights on Reels. It was a live program as opposed to prerecorded, showing officers doing the job they do every day. Speaking recently on WFMD's Morning News Express, Chief Jason Lando said this program shows the many interactions officers have with the public. Every day our officers are out there doing great work.",
        "start": 785.981,
        "end": 815.947
    },
    {
        "text": " and they treat people really well, and we don't get to tell that story very often. Sometimes all you see is a 10-second clip that someone films on a street corner when we do have to use force, and this is going to tell the whole story about our officers and how they come to work every day, how they show up, and how they take care of people.",
        "start": 815.947,
        "end": 833.729
    },
    {
        "text": " And Hagerstown police continue to investigate a fatal shooting from Thursday afternoon. DC News Now says just after 1 p.m., officers were dispatched to the 200 block of East Washington Street. In an update Friday, police say they're investigating this incident as a homicide. I'm Kevin McManus, WFMD News.",
        "start": 834.087,
        "end": 852.142
    },
    {
        "text": " Fox News. I'm Paul Stevens. Republican presidential nominee Donald Trump and his running mate J.D. Vance campaign together today. The first stop in Grand Rapids, Michigan today with a focus on the economy, border security and crime. All amid what we're told will be unprecedented security in the wake of the assassination attack in Pennsylvania.",
        "start": 853.148,
        "end": 872.705
    },
    {
        "text": " Fox's Jeff Manasso, that failed assassination attempt one week ago. 34 Democrats now calling on President Biden to end his campaign for another term. Republican National Committee Chair Michael Watley on Fox. You have the Democrats are in complete disarray. It really just shows you that only one candidate right now is in a position to unify this country.",
        "start": 872.705,
        "end": 893.217
    },
    {
        "text": " President Biden remains in the race, and Representative Sheila Jackson Lee of Texas has passed away, dying at the age of 74 after battling pancreatic cancer. America's listening to Fox News.",
        "start": 893.217,
        "end": 905.538
    },
    {
        "text": " The 930 WFND sky scan forecast for Frederick and surrounding counties. As we head into the day, we'll have a 40% chance of showers and thunderstorms after 2 p.m., otherwise mostly cloudy with a high near 85 and light south wind. Saturday night, we'll have a 30% chance of showers and thunderstorms before 8 p.m., otherwise mostly cloudy with a lower end 68 and light south wind. Sunday, mostly sunny with a high near 92. PJ's Roofing. When it comes to your roof, they've got you covered. Visit PJsRoofing.com. I'm Dan Sutton.",
        "start": 911.135,
        "end": 941.135
    },
    {
        "text": " The following program does not necessarily reflect the views of the staff or management of WFMD. Free Talk, 930 WFMD.",
        "start": 941.135,
        "end": 961.527
    },
    {
        "text": " Welcome back. This is Jen, and I have with me today Liz Harrington, and we're talking about the events of the week, particularly the safety of President Trump and, frankly, the safety of our nation and where we're going to go from here. The Republican National Convention has been absolutely extraordinary. If you have an opportunity, go on to Right Side Broadcasting. You can see it in its entirety there.",
        "start": 962.858,
        "end": 985.572
    },
    {
        "text": " They're doing reruns throughout. That's a good place to look. Also, we found our clip on PBS Broadcasting. So shout out to PBS that they're covering this. I'd like to bring on William Powers. And William is a friend and actually has done some business for us and respect his opinion. And we were chatting the other day. And so I thought it'd be an opportunity for him to give his thoughts today.",
        "start": 985.572,
        "end": 1009.838
    },
    {
        "text": " And many of you may find yourselves aligned with what he shares. Good morning, William. Good morning. It's great to have you here. So, William, tell me a little bit about your thoughts. What has this week been like for you since you heard that President Trump had been shot?",
        "start": 1009.838,
        "end": 1032.278
    },
    {
        "text": " Well, my wife got a text message, and the first thing when she said Trump got shot is I said, of course. I mean, I was about to start crying, but, I mean, my first thoughts were, like, of course that's what they're going to do. I mean, they couldn't beat him in court. They couldn't beat him anywhere else. This is what's just going to happen.",
        "start": 1033.2,
        "end": 1052.005
    },
    {
        "text": " So when you look at what's been going on with the country and how it's affected you and your family, can you share a little bit about the effects of this Biden administration on you? Well, I mean, just as a small business owner, people's disposable income is just not what it was. I mean, there's still some people out there with money, but there's a lot of people struggling. And I've noticed a lot more people taking out loans and",
        "start": 1053.37,
        "end": 1081.271
    },
    {
        "text": " Obviously, their dollar doesn't go as far. So, I mean, I'm poorer today than I was, you know, three years ago. If you look at my retirement funds or anything like that. So I feel for them as well. So it's really put a squeeze on being a small business owner. I've just had to cut costs where I can stay afloat.",
        "start": 1081.869,
        "end": 1102.824
    },
    {
        "text": " So when you talk to people you do business with, what do they tell you? So you have a window company, not an inexpensive service. So to your point, and we're using you, so I'm very pleased to be doing business with you, but it takes something to incur that kind of expense. What are you finding? Are they delaying their purchase? You said they're taking out loans.",
        "start": 1104.531,
        "end": 1131.476
    },
    {
        "text": " What do you feel as the business owner talking to clients they're going through? Well, the amount of prioritizing I haven't seen before. I mean, we're doing it this year. We're doing what we can this year, splitting up the project into just smaller amounts just because they're small.",
        "start": 1131.476,
        "end": 1152.244
    },
    {
        "text": " Their disposable income isn't where it was. So I've worked in Texas and I've worked here. And this is the time period where I've never seen so many people delay it a year or two years. And it seems like a lot of people are delaying it until after the election. And I should probably ask them more questions and dig into why they're delaying it. But I feel for people who say, okay, no rush on our end. But, yeah, I've never had this many people delaying it.",
        "start": 1152.841,
        "end": 1181.067
    },
    {
        "text": " And usually the time period is they're like, hey, I just want to wait one more year. What do you think would happen if Biden wins or whoever they assign into that slot? And because nobody believes Biden's running things, he's an idiot. So so whoever's running things in the background, if they get reinstalled, what do you think will happen to our country? Can you speculate?",
        "start": 1181.237,
        "end": 1206.203
    },
    {
        "text": " Well, it's not going to be good for the dollar, and that's just internationally. I think it's going to cause inflation and just break down the dollar so that it's not the world reserve, which will just hurt us more than people even realize. Yet, if Biden's reelected, I just think our freedoms...",
        "start": 1207.159,
        "end": 1229.275
    },
    {
        "text": " We'll be in jeopardy because, I mean, the things that they say about, you know, Trump, about taking away, you know, he's going to get rid of democracy. I mean, he's trying to get rid of regulation. And even the Supreme Court justices that he got in have made some of the best decisions. I mean, even the Chevron decision that was recently passed by the.",
        "start": 1229.616,
        "end": 1251.118
    },
    {
        "text": " The Supreme Court is going to help with regulation, deregulating the United States government, which has just been super overregulated. So if Biden stays in, I just think it'll just make businesses hard to do anything in the United States. It'll just be so much red tape. And I think that's what they want to do is just.",
        "start": 1251.749,
        "end": 1270.657
    },
    {
        "text": " Slow down the dollar on the international scale and just make it hard to do small business. Interesting. So if you look at a product that you sold during the Trump era and you were to sell that product today, can you tell me what the approximate inflation cost is? What's the differential? How much is it? Not even worth it.",
        "start": 1271.084,
        "end": 1298.217
    },
    {
        "text": " All of our products are made in the United States, and just the manufacturing costs alone, not including labor and materials, just the manufacturing costs have gone up about 60%, which has been fantastic.",
        "start": 1298.933,
        "end": 1311.647
    },
    {
        "text": " I mean, because these things are made in America, so they have to pay American employees and everybody's wages have had to go up just to get people back into the to work after COVID. So it's been about 60 percent. And then also, I haven't had so many problems up until recently in the last two years. You know, I haven't had.",
        "start": 1312.159,
        "end": 1335.589
    },
    {
        "text": " emails saying, hey, today we have to go up in price on all aluminum products. So even like the commodities like aluminum and some of the chemicals to make the products that we sell are just, they're changing on a weekly basis.",
        "start": 1335.589,
        "end": 1353.251
    },
    {
        "text": " which I've never had to deal with. For 10 years in the industry, you had a pretty set 2% to 3% price increase overall across the board every year at most, and then all of a sudden now you don't even know when the next price increase is coming. So you said 2% to 3% annually you would see as a cost increase. In the past year, what has the cost increase been comparatively? Oh, about 17%. Wow.",
        "start": 1353.251,
        "end": 1382.09
    },
    {
        "text": " Yeah. In the last 12 months. Yeah. Okay. So that's really good kind of like barometer of how it is out in business. And I really appreciate you coming on, William. Is there anything else you'd like to say or ask Liz?",
        "start": 1382.756,
        "end": 1395.981
    },
    {
        "text": " Oh, well, just wanted to point out, I mean, I've never watched the RNC convention before. Neither has my wife. And this is the first year where we're watching it. My wife's interested in it. I'm watching all the different states give their delegates out. It's just been really exciting. And I don't know if I'm just...",
        "start": 1397.705,
        "end": 1418.285
    },
    {
        "text": " you know, one person that's all of a sudden interested, but it just seems like a lot more people are talking about politics and paying attention that were just sleeping before. So I just wanted to know if she thought that was a general consensus or if that's just me and my family.",
        "start": 1418.285,
        "end": 1434.224
    },
    {
        "text": " No, I think that's something that is unique and is happening. And I think it's because of the events, the escalation, really, you know, because President Trump and the contrast. People remember what it was like when he was president.",
        "start": 1434.889,
        "end": 1451.698
    },
    {
        "text": " And then they see the realities now and just how everything is worse. Everything's more expensive. Everything, we have no border. It's more dangerous and life is just worse around the world. And so people have that contrast and then they see",
        "start": 1451.698,
        "end": 1469.48
    },
    {
        "text": " All the same escalation of just attacking him and trying to bankrupt him, trying to imprison him and now trying to kill him. It really is having the effect, I think, of waking people up to say, well, wait a minute. My life was better when he was running things. He doesn't need to do any of this. He certainly I mean, no one would really begrudge him of just quitting after that. Right. I mean, as we saw the other night.",
        "start": 1469.48,
        "end": 1498.012
    },
    {
        "text": " He has beautiful family and grandchildren. We had Kai Trump giving just such a sweet speech that really shows the real Donald Trump, the man he is. And no, he's not...",
        "start": 1498.012,
        "end": 1513.148
    },
    {
        "text": " If any, he's not quitting. If anything, he's more determined now because everyone sees this is not a battle against flesh and blood. This is a spiritual battle. This is good and evil. And I think it is. I don't think you're alone. I think people are really looking around and saying something's going on. Everything's being shaken. We need to start paying attention.",
        "start": 1513.148,
        "end": 1535.64
    },
    {
        "text": " Absolutely. Well, listen, William, thank you very much for sharing. I think your perspective is really helpful to look at, you know, how this is impacting small business. And that impacts all of us because, what, 80% of businesses in U.S. are small business, I think.",
        "start": 1535.64,
        "end": 1553.712
    },
    {
        "text": " The number is large, and you guys represent a good portion of our economy, and it's important to understand how you feel, not only in business, but how it affects you emotionally, personally, and in your family. So thank you. Oh, thank you. Okay, we'll talk soon. Keep up the good work. Thank you. Bye-bye.",
        "start": 1553.712,
        "end": 1572.329
    },
    {
        "text": " Okay, we're going to take a quick break. I have with me in studio Liz Harrington, and that was William on the phone, who's a small business owner. We appreciate his call in. I'd like to thank our sponsors, Sweeties on the Creek. We're scooping now. TotalWellFit.com, TotalWellFit.com. It's an online wellness boutique. And 7K Metals. We'll be right back.",
        "start": 1574.343,
        "end": 1593.933
    },
    {
        "text": " When was the last time you had freshly made ice cream or candy? Sweeties on the Creek offers a wide selection of fresh, creamy ice cream made with natural flavors. Stop in for a new fun flavor or a classic yummy favorite perched on a freshly made waffle cone. Just in, Sweeties has a huge assortment of candy, including freshly made, in-store delicious chocolates. Your young ones will love all the plush toys and fun gifts, too. Sweeties on the Creek, just up for Market Street. We're scooping now.",
        "start": 1594.599,
        "end": 1621.288
    },
    {
        "text": " It's all about your car. Call in with questions to Dave Serio beginning in less than 30 minutes right here on 930 WFMD. Because there ain't no doubt I love this land. God bless the U.S.A.",
        "start": 1624.07,
        "end": 1642.807
    },
    {
        "text": " Welcome back. This is Jen, and I have with me today Liz Harrington. And Liz, what are your thoughts after hearing William share about business and how it's impacting him and the people he serves?",
        "start": 1644.821,
        "end": 1656.544
    },
    {
        "text": " I think it's a reality for everyone and everyone feels it. It's just there's so much uncertainty, too. It's just no stability. And it's a complete it's it's so needless. That's why I kept thinking, you know, it's so needless because none of this.",
        "start": 1657.585,
        "end": 1677.927
    },
    {
        "text": " None of this has to be this way. I mean, as we saw, and I think J.D. Vance kind of pointed out in his speech, I heard a clip, was, you know, for decades, this corrupt ruling class have been making all these decisions and",
        "start": 1677.927,
        "end": 1695.674
    },
    {
        "text": " selling us out, and then how quickly when President Trump got in there the first time to just, you know, do things to put our country first and our people first, that people felt the difference almost immediately. And it's just, it's so needless what they do and to make it just so hurtful for everybody when it doesn't have to be that way at all. They've just chosen deliberately",
        "start": 1695.674,
        "end": 1722.961
    },
    {
        "text": " To open our borders, to cut off our energy. And it's clearly had devastating impact for everybody. But I mean, this crazy thing is, you know, this is like nothing yet. Right. It could get so much worse. And that's what we need to really kind of keep in mind and think about.",
        "start": 1723.439,
        "end": 1742.432
    },
    {
        "text": " Why it's so important for this country to get back on the right track, because, I mean, this nation was so special and precious and it can go away very quickly. And people just need to realize that. And I think they are. I think they're.",
        "start": 1742.432,
        "end": 1759.991
    },
    {
        "text": " How do we help people who are not of our mindset start to more people to understand, wake up to the reality rather than what they're told? I mean, you know, I think the black community is a great example of how they've said, wait a second here.",
        "start": 1759.991,
        "end": 1778.387
    },
    {
        "text": " Y'all have been selling us a bill of goods for years. We're not buying it anymore. We're not better off. Trump did more for us than you have. And in helping, it's just to me shocking that more people haven't seen it given the reality of their life. But here's the thing I was thinking about. And I come from a human services background. So with that lens on,",
        "start": 1778.387,
        "end": 1807.568
    },
    {
        "text": " The Democrats have a mission to, I'm going to say,",
        "start": 1808.712,
        "end": 1812.125
    }
]