[
    {
        "text": " Living in Jackson since 1940, the professionals at Collins Brothers have built the integrity and experience you can count on. From custom tile backsplashes and showers to mohawk carpet, hardwood floors, and waterproof luxury vinyl tile, Collins Brothers will find you the floor you love at a price that is just right. Go now to collinsbrothersfloorcovering.com or visit them at their showroom on West Pearl Street in beautiful downtown Jackson.",
        "start": 0.009,
        "end": 22.858
    },
    {
        "text": " Find so many great deals with one stop at Meijer. Like this Friday and Saturday only. Get a $10 coupon when you spend $75 or more in-store. Coupon printed at checkout. Start redeeming next week. Plus, this week's hottest deals on southern peaches for 99 cents per pound. Fresh from Meijer family-packed chicken breasts for $2.29 per pound. And select Meijer cheese 3 for $5. Meijer has all you need in just one stop. Exclusions apply. See all the deals in-store or in the Meijer app.",
        "start": 25.23,
        "end": 55.213
    },
    {
        "text": " Attention Jackson County residents. Do you have hazardous waste cluttering your space? The Jackson County Conservation District is hosting their hazardous waste collection July 25th from 1 to 6 p.m. at the Jackson County Department of Transportation lot on the corner of Channer and Elm. Cost is $20 per vehicle to safely dispose of your hazardous materials. Visit jacksoncd.org to register and view the list of accepted items. Clean up your space, protect the environment, and join us July 25th for the hazardous waste collection brought to you by the Jackson County Conservation District.",
        "start": 55.213,
        "end": 85.06
    },
    {
        "text": " WKHM Newstime 733. We're delighted to welcome to the program County Clerk, Sierra Soule, in the house. Good morning. Good morning. Thank you so much for having me. Welcome. She's going to talk about early voting, but she's on the ballot. Now, you replaced Amanda Kirkpatrick. Yes, I did. Right? Yes. So how did that, what happened there? Yeah. Because you weren't elected, right? Appointed, correct. You were appointed. Mm-hmm.",
        "start": 86.664,
        "end": 114.889
    },
    {
        "text": " By the county board? By the circuit court judges of Jackson County. Oh, okay. Yeah. So last April, Clerk Kirkpatrick decided she was going to retire. And the circuit court judges of Jackson County did decide that unanimously appoint me as county clerk and register of deeds. So I've been in this role since May 1st of 2023. But you've been...",
        "start": 115.179,
        "end": 140.043
    },
    {
        "text": " Bumming around the county for a long time, right? Yes, yes. So I've actually worked for the county for 17 years. I started in the Jackson County Prosecutor's Office as a high school intern, and I worked my way up to Chief Administrative Services. Throughout the years, I worked with Prosecutor Hank Zavaslak. You may remember him.",
        "start": 140.759,
        "end": 158.763
    },
    {
        "text": " Oh, I remember them quite well. Most people in Jackson do. Rest in peace. Yes. And then I worked for Prosecutor Jerry Jarzynka for a period of time as a Chief Administrative Services. And then Clerk Patrick reached out to me in 2021 and asked if I would be interested to replace her Chief Deputy County Clerk who was retiring.",
        "start": 158.763,
        "end": 177.039
    },
    {
        "text": " and I decided that was a good move. It was something different, and it was definitely a challenge, and it's been a delightful challenge ever since, fulfilling every possible need I need. Yeah, a lot of challenges in the clerk's office, especially with the way voting has seemed to now change, and there's new rules and regulations. You've got to be",
        "start": 177.039,
        "end": 203.148
    },
    {
        "text": " not only on top of it you almost have to be ahead of what's happening you really do the spotlight is really on um election officials and you know we do a great job at making sure that we're we're following the law and with these new changes that occurred because of proposal 22-2 in november of 2022 voters voted in this constitutional amendment",
        "start": 203.848,
        "end": 224.497
    },
    {
        "text": " which basically gives all voters the right to vote early in every statewide and federal election. And so municipalities can enter into an agreement with the county. They can enter into an agreement with another municipality, so do it as a joint, or they can do it on their own.",
        "start": 224.497,
        "end": 241.391
    },
    {
        "text": " And so here in Jackson County, what we have happening is 16 of the 20 jurisdictions in our county have went with the county coordinated sites. So what that means is only four, which are the City of Jackson, Columbia Charter Township, Sandstone Township, and Spring Arbor Township, those two have gone together, but the other two have gone alone. All other jurisdictions have gone with the countywide site.",
        "start": 241.391,
        "end": 268.951
    },
    {
        "text": " So, myself, my elections director, my team, we all prepare and host and coordinate two sites, one at Blackman Township and one at Summit Township, for any voter of those 16 jurisdictions to go and vote at. So, you're going grocery shopping, you are running an errand with your family. Now, this is the early voting, right? This is early voting. Okay.",
        "start": 268.951,
        "end": 290.725
    },
    {
        "text": " Yep. So nine days before every statewide and federal election show for August 6th, it's July 27th through August 4th. So you can go to Blackmon or Summit. Yes.",
        "start": 290.725,
        "end": 301.34
    },
    {
        "text": " Vote. Period. Yep. The entire ballot. Yes. Yada, yada, yada. Absolutely. And what's even more pleasant about this is that you could take your AV ballot, so your absentee ballot that you received at home through the mail. You could look at your ballot while you're drinking your coffee, eating your breakfast, and then you can come into an early voting site or even on election day and you can vote that absentee ballot in person through the tabulator. So people have taken the opportunity to do that as well.",
        "start": 302.022,
        "end": 330.947
    },
    {
        "text": " So can you fill it out at home and just bring it in? Yes, absolutely. No issues there? No issues. Obviously, the election inspectors will check you in and make sure that you are able to vote at that site. Now, you still have to have a...",
        "start": 331.254,
        "end": 347.688
    },
    {
        "text": " license or picture id right you don't have to bring a lawyer or anything no lawyer no not at all make sure you bring an id we also bodyguard no bodyguards okay fortunately in jackson county everyone has been very pleasant very nice so we don't have a lot of issues this is a nice nice county yes it truly is people ask all the time how is it in jackson county honestly we don't have very many issues with elections um people behave themselves appropriately and i'm thankful for that",
        "start": 348.336,
        "end": 374.718
    },
    {
        "text": " So take me to election night. How has it changed since you've come in there? Because some nights, I know I have to spend all night here waiting for those results. Some nights they get in early and sometimes...",
        "start": 375.367,
        "end": 390.333
    },
    {
        "text": " Let's just say the media is frustrated. I know you're frustrated. And I'm sure you're frustrated. I'm frustrated. Okay. There have been times where I don't leave the office until 3.45 a.m. And that could just be a variance of things needing to make sure that signatures are done and...",
        "start": 391.408,
        "end": 411.63
    },
    {
        "text": " things are closed appropriately and those sort of things. It can vary from being done very early, as you mentioned. So in a smaller election where we just have maybe one school proposal, that can be a really quick night for us. But if we have every single jurisdiction participating, that can take a little bit longer to get all those results in. Mm-hmm. Yeah, see that couch out there? That's where I end up usually. I may need a couch too. On election night. So...",
        "start": 411.63,
        "end": 440.572
    },
    {
        "text": " What are the issues you deal with, Sierra, on election night? I think on election night and in general, misinformation is a lot of the issues that we deal with or people that don't understand the process. They don't understand that elections are a bipartisan thing, it has to say. So you have Republicans and Democrats from each party looking at everything, doing everything as a team together.",
        "start": 441.135,
        "end": 467.415
    },
    {
        "text": " We do a lot of testing as well, right? I had public accuracy tests on Monday the 15th and we tested the equipment. We tested the equipment before the public accuracy test. We tested it before the test. So these machines go through a lot of testing and people don't understand that and aren't involved in that process.",
        "start": 467.415,
        "end": 485.896
    },
    {
        "text": " so i encourage everyone to look at the facebook page my facebook page you can follow me for updates we do post when we have these tests i would love to see the public there i would love to see people asking questions would love to see people at our canvas so the canvas always starts the thursday after the tuesday election at 9 a.m again these things are on my website they're on my facebook page please come familiarize yourself with the process get educated would love to to learn love to",
        "start": 485.896,
        "end": 514.462
    },
    {
        "text": " educate the entire public about this. Who makes sure the machines are correct or, I don't know, double check maybe? Yeah, a variety of people. Okay. A lot of people. A lot of people want to see that? Yes, yep. So how does that work? I mean, you don't let any, just... No, no. Joe Belota can't come in. No, don't touch the equipment. So, for example... I mean, you feel it's extremely reliable, right? I do, I do.",
        "start": 514.462,
        "end": 543.234
    },
    {
        "text": " For example, on Monday when we did the public accuracy test, we had our election commission. So our chief judge and our county treasurer, myself, we personally tested these machines, which means that we fed ballots into the machine, that we knew what the results were going to be because we had the predetermined chart of results in front of us.",
        "start": 543.234,
        "end": 564.48
    },
    {
        "text": " And what that means is we look at the results at the end and we compare it to what it should be and it matches perfectly every time. And if it weren't to match perfectly, we would make sure we figured that out before we went to election night or elections. Say it's 99.8%.",
        "start": 564.48,
        "end": 585.845
    },
    {
        "text": " Correct. Is there an oversight? No, that's never happened in my experience. Really? In my experience, that's never happened, especially when we do post-election audits, right? So I do audits. Well, we do audits. And we hand count the ballots to compare it to how the machine tabulated them, and it comes out exactly the same every time. Yeah, because when you say every vote counts, especially around here, we've had some –",
        "start": 586.101,
        "end": 616.015
    },
    {
        "text": " elections that are single digit differences. Some of the smaller races, really.",
        "start": 616.852,
        "end": 623.097
    },
    {
        "text": " Right. And so people have an opportunity per the law to do a recount. And we conducted one recently that I can recall. And the person that requested this recount, the results turned out exactly as tabulated. And again, this person had the opportunity to watch people hand count these ballots. And they were very satisfied with how it came out with a hand count because it was exactly as the tabulator had tabulated. So you take every...",
        "start": 623.353,
        "end": 651.323
    },
    {
        "text": " Every vote? Everything. Hand counting? We did. Is that? In an audit. Arduous? Or a recall. Yes. My eyes are usually crossed by the end.",
        "start": 651.8,
        "end": 661.169
    },
    {
        "text": " So you didn't sign up for this. What are your thoughts after, you know, a couple years of doing this? Yeah, so being a county clerk in registered deeds is a lot of work. It's very fulfilling. As far as elections, elections are a lot of work. And unless you work in them. Yeah, but you don't get, Sierra, you don't get any credit. You're behind the scenes. I am, yeah.",
        "start": 662.159,
        "end": 686.698
    },
    {
        "text": " I like helping people. That's my number one thing. And actually, I had a gentleman, I had just done a presentation. I'd gone down to the first floor of the tower building and this man looked like he didn't know where he was going or what was going on. And I asked, do you need help? And I always ask people, do you need help? How can I help you? And he said, I can't go up the elevator. I'm deathly afraid of the elevator. I said, well, what service are you trying to get? And it was one of my services.",
        "start": 686.698,
        "end": 714.292
    },
    {
        "text": " And so I took his paperwork, helped him out, took it upstairs, processed it, got him his change, brought it all back down. And he thanked me immensely because he could not go up the elevator. And I love helping people. So that's why I got into this is to help people. So you're on the ballot being challenged by Sabrina Brownlow on August 6th.",
        "start": 714.292,
        "end": 743.916
    },
    {
        "text": " My race is actually in November. Oh, okay. Yes. So you're the Republican. I am. And she's the Democrat. Yes. So you're not on...",
        "start": 744.394,
        "end": 753.353
    },
    {
        "text": " Well, thank goodness you're not on the August 6th. You will see my name and I would always appreciate the vote. Yeah. So you can vote for Clark. Yes. On August 6th. Yes. And you will see my signs out. And I've been working hard. I've been going to a lot of events and meeting a lot of public and honestly getting a lot of really good feedback. So I feel like I'm doing a really good job based on the feedback I'm getting. Mm hmm.",
        "start": 753.882,
        "end": 778.097
    },
    {
        "text": " So is this something you want to make a long career out of? Yes, I believe so. The clerk's job, like I said, is much more than I thought it would be. It's much more challenging than I thought it would be. When I see the word clerk or when other people see the word clerk, it's almost not as respected as it should be. Exactly. And I don't understand that because the job that I have is a large and vast amount of responsibilities.",
        "start": 778.575,
        "end": 806.749
    },
    {
        "text": " And so I oversee all four circuit court records. So I oversee all births, deaths, marriage, CPL, DBA, DD 214s, notaries, all elections, obviously. I oversee there. I am also the register of deeds, right? So I'm a dual role. What does that encompass? Just the register of deeds?",
        "start": 806.749,
        "end": 826.357
    },
    {
        "text": " Yeah, so it's land records. So registering all land records in Jackson County. Oh, and those can be a nightmare, can't they? Yes. Tricky? Yes, very tricky. And we also have to make sure everyone meets the Michigan recording requirements. So unfortunately, we do have to reject documents, just as we do at the courthouse, when they don't meet the minimum filing standards according to MCR 1.09D. So I know that went off the top of my head there. Okay.",
        "start": 826.357,
        "end": 850.435
    },
    {
        "text": " So how do you work with the judges? Very well. Very well. Like I said, I was appointed unanimously, so I get along very well. We work through issues. As you know, the court can be a long process to get a case through, work well with them in terms of there's an issue. Some of the judges will come right down to my office and talk about it, or I'll go right up to their office and we'll talk about it. So we get along very well.",
        "start": 851.015,
        "end": 874.394
    },
    {
        "text": " So if somebody wants like a court file or documents, they go through you, right? Yes, that is my office, correct. The Fourth Circuit Court Clerk. Constitutional, that is, requirement. How do you do it? My husband says, I don't see you very often.",
        "start": 874.394,
        "end": 890.145
    },
    {
        "text": " So you're a Vandy girl. I am. Yeah, I went to high school just down the street. I actually worked right over here at Polly's Country Market for a while. So, yeah, I'm from Jackson. I went to Spring Arbor University for my bachelor's degree in management and organizational development. And then I went on to pursue a master's in business administration from Spring Arbor University as well, all while working full time, of course, for the prosecutor's office. So that has really shaped who I am today.",
        "start": 891.323,
        "end": 917.125
    },
    {
        "text": " So do you take time to sleep before August 6th? No. No? No. Is that hectic going up to the date? Yes, it is very hectic. So we have to make sure we have enough ballots ordered. We have to make sure our equipment has been tested. We have to make sure that we have election inspectors. We have to make sure that their orientation, we have their I-9s, all the things that are done behind the scenes. It's quite a bit of work.",
        "start": 918.251,
        "end": 946.476
    },
    {
        "text": " And I'm glad that 16 of the 20 jurisdictions have gone with the countywide with trusting me to help coordinate this. But it's a significant impact on our workload. As you know, the county runs lean. The clerk's office runs very lean. Yeah.",
        "start": 946.476,
        "end": 965.06
    },
    {
        "text": " In February alone, I can account for my staff working just on early voting over 690 hours that I can account for. So there's plenty of hours that we can account for. So this is an immensely amount of work for our office.",
        "start": 965.06,
        "end": 980.538
    },
    {
        "text": " So do you need more help? Yes. You do? Yes. Okay. Like full-time? I would love additional full-time positions. Shotwell's usually listening. Well, here's my plug for that. There you go. We need more people. Need more people. Yes, always need more people.",
        "start": 981.459,
        "end": 999.275
    },
    {
        "text": " Now, will this get busier or crazier in November? Yes, I am anticipating these things to continue on. So between August and November, we have a lot of deadlines. In fact, we have deadlines beginning the day after the election for November.",
        "start": 999.275,
        "end": 1020.674
    },
    {
        "text": " So we're not even done with August because we have Canvas that starts on the Thursday after the August election. And we have deadlines starting that day after and then continuing on. So while we're conducting the Canvas, we are also still trying to prepare for November. So it is very, very tight for us to get this work done. Well, you better rest up because you got a couple.",
        "start": 1020.674,
        "end": 1047.142
    },
    {
        "text": " I'll rest in the end of November. Busy months coming up. Yes. Well, great to have you out. Well, thank you for having me. And I stole your phone number, so. You got it. If we need to get a hold of you. Anytime. No issue. Sierra Soule is a county clerk here in Jackson County, and she will be on the ballot but unchallenged on the August 6th and will be.",
        "start": 1047.585,
        "end": 1074.292
    },
    {
        "text": " I'm predicting my exit polling that you will win. You will pass the musker August 6th, so she'll be on the ballot in November as well. Good luck. Thanks. Thank you, Craig. See if Shotwell comes through for you.",
        "start": 1075.196,
        "end": 1093.336
    },
    {
        "text": " Attention boaters, lake season is here. Are you ready to elevate your summer? Thayer Marine is your one-stop destination for all things boating. Dive into savings at Thayer Marine on a premium selection of Bennington and Sylvan pontoons, Scarab jet boats, Four Winds and Bayliner sport boats. Whatever your lake plans are, we've got you covered. Shop and enjoy peace of mind with the best warranties in the industry. Visit Thayer Marine today and let's make waves together. Your next adventure starts here. Don't miss out. Visit us at thayermarine.com or stop by our showroom on 127 South.",
        "start": 1093.831,
        "end": 1123.592
    },
    {
        "text": " Collins Design Build is committed to hard work, dedication, and more importantly, they stand behind their quality work. They can help you meet the needs of space and functionality as well as an appearance that is just as unique as your business. Collins Design Build offers a full scope of services from design build to construction management, carpentry, and general contracting. They're completely at home taking you from planning and design right through the construction, working directly with you to get exactly what you need. Contact Collins Design Build at 529-0089 and let them partner with you on your next project.",
        "start": 1123.592,
        "end": 1153.592
    },
    {
        "text": " ABC News. I'm Sherry Preston. President Biden confirmed to have COVID taking Paxlovid, symptoms said to be mild. Division among the Democratic Party, however, about his reelection. Here's ABC's Perry Russom. According to ABC News contributor and political reporter Rachel Bade, former House Speaker Nancy Pelosi told Biden last week that she and other Democratic lawmakers worry he's dragging down the party.",
        "start": 1153.592,
        "end": 1178.097
    },
    {
        "text": " A Pelosi ally saying, the Speaker does not want to call on him to resign, but she will do everything in her power to make sure it happens. At the Republican National Convention, Vice Presidential nominee J.D. Vance delivered his acceptance speech last night. Donald Trump will do the same this evening. His wife Melania and daughter Ivanka will be in the audience.",
        "start": 1178.097,
        "end": 1195.998
    },
    {
        "text": " Many questions about the lapses in security at Trump's Pennsylvania rally. Officials say the man who tried to assassinate him and did kill a Trump supporter was spotted 20 minutes before he took his first shots. Head of the Secret Service has agreed to testify Monday as she faces growing calls to resign. This is ABC News.",
        "start": 1195.998,
        "end": 1213.097
    },
    {
        "text": " Right now, at this very moment, is your money making money? Because if it's just sitting in a checking or savings account, it may not be. If you'd like to chat about putting your money to work, give me a call. I'm Casey Sykes, a financial advisor at Morgan Stanley & Jackson. Look us up online at the Sykes Group at Morgan Stanley. After all, you work hard for your money. Let's make it work hard for you. Morgan Stanley Smith Barney, LLC. Member SIPC.",
        "start": 1218.712,
        "end": 1243.746
    },
    {
        "text": " what a forecast here for Bailey excavating the Bailey brothers good excavation day today sunny and 75 cleared tonight low 50s sunny Friday 78 sunny Saturday 80s sunny Sunday 82 and currently",
        "start": 1245.043,
        "end": 1269.036
    },
    {
        "text": " Zapata International, we're still right at 56 degrees. And at Bailey Excavating. Are you looking for a rewarding career that improves the lives of your neighbors and community? Bailey Excavating is a third-generation union excavating contractor that has been in business for over 50 years, taking pride in providing clean drinking water and smooth roads for the community. Bailey Excavating is currently looking for employees with asphalt paving experience. Employment benefits include competitive wages, vacation pay, retirement, and health insurance.",
        "start": 1271.135,
        "end": 1300.811
    },
    {
        "text": " and a family-friendly atmosphere, go to www.bailey-excavating.com to download a job application. Bailey Excavating is an equal opportunity employer.",
        "start": 1300.811,
        "end": 1310.179
    },
    {
        "text": " It's the Hot Air Jubilee at Elishart Park, July 19th through the 21st. Featuring the U.S. Women's National Hot Air Balloon Championship, July 15th through the 20th. K105.3 live on location Saturday, July 20th from 4 p.m. to 6 p.m. Keep your eyes to the skies. Hot air balloon flights scheduled daily, weather depending. And night glows at dusk. The kids will love the kids' kingdom. Everyone will love the car show, helicopter rides, vendors, and more.",
        "start": 1310.486,
        "end": 1334.275
    },
    {
        "text": " McKibbin Media Group, a proud sponsor of this year's Hot Air Jubilee. Details online at hotairjubilee.com.",
        "start": 1334.275,
        "end": 1341.015
    },
    {
        "text": " Hey guys, it's Amy from I've Been Framed. We've been serving Jackson since 1998 with exceptional quality in our custom framing. It's no surprise why customers keep coming back for more. Don't believe me? Take the word of a local artist. Laura Steenrod. I've been a customer at I've Been Framed for over 15 years. Just their beautiful assortment of frames and pre-framed art. And now I have my own art framed there. I don't consider anything finished until it's got a frame on it from I've Been Framed. The Purple Building on the corner of North and Wisner.",
        "start": 1341.971,
        "end": 1370.913
    },
    {
        "text": " Join Anytime Fitness to try their free fitness classes for seniors over 60 and ask how you can join the 21 Days Fitness Challenge. Call Anytime Fitness, 517-748-9351. Anytime Fitness in Jackson, Michigan Center, Chelsea, and Marshall.",
        "start": 1371.937,
        "end": 1387.466
    },
    {
        "text": " There's an issue cutting through the bipartisan bickering in Congress. It's AM radio. The overwhelming majority of legislators, Democrats and Republicans, support a bill to keep AM radio in cars. But time is running out. Text AM to 52886 and ask Congress to bring this bill to the floor for a vote now. AM radio is too important to let this moment pass us by. Message and data rates may apply. You may receive up to four messages a month, and you may text STOP to STOP.",
        "start": 1387.466,
        "end": 1414.019
    },
    {
        "text": " This message furnished by the National Association of Broadcasters. Hey, at Boers, they open up at 11 today for lunch tomorrow and Saturday. Marry Me Chicken weekend at Boers. Marry Me Chicken. Don't miss it. Call ahead for lunch today, 960-7419. Just through Vandercook on your way to Napoleon.",
        "start": 1414.019,
        "end": 1442.875
    },
    {
        "text": " Boers International Restaurant.",
        "start": 1443.933,
        "end": 1446.681
    },
    {
        "text": " Whether you're applying to college for the first time, continuing your education, or returning to school, you deserve an education that will prepare you for where you want to go. Jackson College offers in-person and online classes taught by experienced instructors at a cost that won't break the bank. Register now for fall classes, a better life, a rewarding career, peace of mind. At Jackson College, you can do it.",
        "start": 1450.725,
        "end": 1474.804
    },
    {
        "text": " Know a talented professional under 30 in Jackson? Nominate them for Jackson Magazine's 30 and Under Award. Join McKibbin Media Group, Michigan Works Southeast, Walton Insurance Group, Lifeways, and Incensio and Fisk in celebrating those making a difference. Visit JacksonMagazine.com by August 23rd to submit your nomination.",
        "start": 1482.022,
        "end": 1501.015
    },
    {
        "text": " Come to Boston for the springtime I'm staying here with some friends And they've got lots of room And you can sell your paintings on the sidewalk And buy a cafe where I hope to be working soon",
        "start": 1512.773,
        "end": 1538.882
    },
    {
        "text": " Please come to Boston. She said, no. Would you come home to me? And she said, hey, Rampin' Boy, now won't you settle down? Boston ain't your kind of town. There ain't no gold and there ain't nobody like me. I'm the number one fan of the man from Tennessee.",
        "start": 1541.186,
        "end": 1570.213
    },
    {
        "text": " Please come to Denver with the stove on We'll move up into the mountains so far that we can't be found And throw our love you echoes down the canyon And they lie awake at night till they come back around",
        "start": 1573.319,
        "end": 1600.367
    },
    {
        "text": " Please come to Denver, she said no. Boy, would you come home to me? And she said, hey, Ramblin' Boy, why don't you settle down? Denver ain't your home.",
        "start": 1601.493,
        "end": 1617.978
    },
    {
        "text": " Cause I'm the number one fan of the man from Tennessee.",
        "start": 1626.578,
        "end": 1644.053
    },
    {
        "text": " The information you need to start your day is right here on AM Jackson with Greg O'Connor. G-O-C. Broadcasting live from the County National Bank Studio on WKHM, Jackson's News Talk 970 AM and 101.5 FM. More local and state news is on the way from our award-winning news department. Stand by for sports, weather, and conversations with Jackson's newsmakers. It's 8 a.m.",
        "start": 1648.268,
        "end": 1677.466
    },
    {
        "text": " From ABC News, I'm Sherry Preston. The Republican Party's vice presidential nominee, Ohio Senator J.D. Vance, on stage at the GOP convention amid more questions about security and ahead of tonight's appearance by Donald Trump. I stand here humbled and I'm overwhelmed with gratitude to say I officially accept your nomination to be vice president of the United States of America.",
        "start": 1681.186,
        "end": 1705.555
    },
    {
        "text": " This is Jim Ryan at the RNC in Milwaukee. Donald Trump has spoken privately and in small groups about the assassination attempt, telling attendees Wednesday at the screening of a movie about his reelection bid. I got lucky. God was with me. In audio obtained by PBS News, Trump talked about the emotional impact of the shooting. Horrible thing, amazing thing.",
        "start": 1706.118,
        "end": 1724.855
    },
    {
        "text": " In many ways, it changes your attitude, your viewpoint on life. Trump has said the experience had him tearing up and rewriting the speech he'll deliver this evening. Jim Ryan, ABC News, Milwaukee. There have been growing calls for the head of the Secret Service to step down amid new information about the attempted assassination. Law enforcement officials confirmed that 20 minutes had passed between when the Secret Service snipers first noticed the shooter and when the shots were first fired.",
        "start": 1724.855,
        "end": 1750.299
    },
    {
        "text": " Why he went without being confronted by law enforcement for that period of time is going to be a key question as investigators move forward and as the Homeland Security review occurs of this incident. ABC Justice and Homeland Security reporter Jack Dante.",
        "start": 1750.299,
        "end": 1767.108
    },
    {
        "text": " Sideline by COVID, President Biden is off the campaign trail, but took a visit from Senate Majority Leader Chuck Schumer over the weekend, at which ABC News Chief Washington Correspondent Jonathan Carr reports Schumer told him directly it would be bad for Democrats if he stayed in the presidential race. It is a message that I am told has also been delivered by Hakeem Jeffries, the Democratic leader in the House, and also by Nancy Pelosi.",
        "start": 1767.108,
        "end": 1789.906
    },
    {
        "text": " In other news, Wall Street Journal reporter Evan Gershkovich pending a closed-door court hearing in Russia continuing to deny the espionage charges against him. This is ABC News. Getting quality employees to fill positions in your company is essential, but finding those people can be a major hassle, unless you use ZipRecruiter. ZipRecruiter makes finding quality people",
        "start": 1789.906,
        "end": 1809.343
    }
]