[
    {
        "text": " in Holly, Minnesota, and July 27th in Bowman, North Dakota. And Potato Warehouse Auctions, July 17th and the 24th in Wahala, North Dakota. View these auctions and many more land and equipment auctions at Pipers.com.",
        "start": 0.009,
        "end": 13.899
    },
    {
        "text": " He got a big ovation. I'm Dave Anthony, Fox News. Please welcome Donald J. Trump. That ovation then turned into chants of USA. It was an emotional first day at the Republican National Convention here in Milwaukee. Tens of thousands of attendees warmly welcomed former President Trump, cheering him on less than two days after he was nearly assassinated. Trump was formally nominated as the 2024 Republican nominee earlier in the day.",
        "start": 18.097,
        "end": 46.476
    },
    {
        "text": " That's Fox's Brooke Sigmund and the former president with a bandaged right ear stood side by side with his running mate last night. And Fox's Kristen Goodwin reports from Milwaukee. Senator J.D. Vance telling Fox News' Sean Hannity the former president called him earlier on Monday to break the news, calling it a moment he'll never forget.",
        "start": 46.476,
        "end": 64.07
    },
    {
        "text": " He just said, look, I think I'm going to go save this country. I think you're the guy who can help me in the best way. You can help me govern. You can help me win. Addressing being critical of the former president, then presidential candidate in 2016.",
        "start": 64.07,
        "end": 77.022
    },
    {
        "text": " I was certainly skeptical of Donald Trump in 2016, but President Trump was a great president and he changed my mind. I think he changed the minds of a lot of Americans. Now, President Biden calls Vance a Trump clone. And in an NBC News interview, he defended a remark before the assassination attempt that we need to put the former president in a bullseye, but he called it a mistake.",
        "start": 77.108,
        "end": 95.469
    },
    {
        "text": " The truth of the matter was, what I guess I was talking about at the time was, there was very little focus on Trump's agenda. Now the president again called his rival a threat to democracy. The head of Homeland Security calls the assassination attempt a security failure. And today some House lawmakers will get a secret service briefing before a hearing Monday. GOP Congressman Nancy Mace tells Fox...",
        "start": 95.469,
        "end": 117.346
    },
    {
        "text": " Police were alerted there was a suspicious person on the top of the building at the rally. How is this even possible? We've all seen the interviews of citizens on the ground, rally goers who saw it, reported it, and it seemed like nothing happened or didn't happen fast enough. As police are still trying to figure out the gunman's motive, America's listening to Fox News.",
        "start": 117.346,
        "end": 135.657
    },
    {
        "text": " Donald Trump Jr. here. Since January of 2021, the cost of living has increased by 17.9%. You can't get that money back, but you can stop your losses by diversifying into a gold IRA from my friends at Birch Gold Group. To learn more, get your free info kit on gold IRAs by texting the word SHELTER to 989898. That's SHELTER to the number 989898 to get your free info kit from Birch Gold now. Message and data rates may apply.",
        "start": 136.152,
        "end": 165.981
    },
    {
        "text": " Next time you drop off your prescription, check GoodRx. To start saving today, go to GoodRx.com. GoodRx is not insurance.",
        "start": 166.203,
        "end": 195.606
    },
    {
        "text": " Feeling trapped with your child's education? There is a choice with Grace School, your conservative Christian alternative located in the heart of the FM area. Grace School uses a traditional education style with classes for pre-K through 8th grade. Find out more at glsfargo.org and experience grace.",
        "start": 195.606,
        "end": 210.572
    },
    {
        "text": " Have a great time at Heritage Days from your friends at Lidgerwood Lumber J.D. They're your local friendly hometown one stop for lumber, building supplies, and so much more. Lidgerwood Lumber J.D. in Lidgerwood, North Dakota. Have a great time this year at Heritage Days.",
        "start": 211.015,
        "end": 226.152
    },
    {
        "text": " Border Plains Equipment in Williston, North Dakota is seeking a full-time service rider. If you excel in customer service, organization, and problem solving, they want you on the team. Enjoy competitive benefits including insurance, retirement plans, and more. Email your resume to hr at plainsag.com today. That's hr at plainsag.com. And join Border Plains Equipment, a 100% employee-owned company.",
        "start": 226.152,
        "end": 253.268
    },
    {
        "text": " you having transmission problems and struggling to find a place to work on it i've got some exciting news for you i'm matthew from fix it forward auto care and we're excited to announce that we're now offering full service transmission repair for automotive and light truck applications including repair rebuilding and replacement if your transmission is making unusual noises slips or is leaking stop by any of our four convenient fm locations so our skilled technicians can check it out fix it forward auto care the name you trust for car repair fix it forward auto care",
        "start": 257.654,
        "end": 286.152
    },
    {
        "text": " This is the Need to Know Morning Show, brought to you by the power of Zeus. Work smarter, not harder, with the power of Zeus Sales and Rentals. Find out more at ZeusRentals.net.",
        "start": 286.152,
        "end": 300.213
    },
    {
        "text": " Well, at least it's not Monday, so we're going with that. It's the Need to Know Morning Show on the flag. Happy Tuesday, 16 days into July. We're more than halfway through the month of July already, Alex Taylor. Yeah, but we have our VP pick. We do that. Yeah.",
        "start": 302.5,
        "end": 319.667
    },
    {
        "text": " Oh, man. Lots going on. Seven after six. Happy Tuesday. Kevin and Alex. Alex back from her three-day weekend, which was... Oh, busy. Yeah. Busy. Yeah, we went out to Dickinson. Put some miles on. Yeah, it's always fun out there. Looked at a lot of beautiful cars. I guess the rides crew. I didn't know they were coming along, too. So we filmed an episode of rides out there, too. And then...",
        "start": 319.667,
        "end": 343.456
    },
    {
        "text": " They went on the garage tour and got some really cool garages for the hangout segment. So, yeah, it was busy. And then we got back early Sunday afternoon and went to the fair Sunday night to the Riley Green concert. So, yeah, I had to take Monday off. Yeah, no, no doubt. Riley Green looked like a great time. A couple of friends were there. Yeah, it was a lot of fun. It's fun to go. It was the first concert we went to at the fair this year. So it's like we got to go. So we did. And it was it was a good time.",
        "start": 343.456,
        "end": 373.302
    },
    {
        "text": " And you didn't have to leave West Fargo, which works out nicely. That is my whole goal in life, to never leave West Fargo. There you go. 8 past 6, lots to do, need to know, morning show on the flag. What shall we do today? Let's chat with a couple of fine peeps. Bridget Riedel, just after 7. We'll talk agriculture just after 8 o'clock. We've got, I do believe, did I see we have a guest after 8 o'clock? Yes, it is the Kilbourne Group. Yeah, they're having a street fair thing.",
        "start": 373.439,
        "end": 399.684
    },
    {
        "text": " Right, the street fair is this weekend, so I believe we're talking to Randy to find out what's going on there. So, yeah, that's already street fair time, too. So, hufta. Oh, man. I know. Ticket. Unbelievable. Street fair, water carnival, moon dance, Wii Fest. Air show next week. I mean, wow. Yeah.",
        "start": 399.684,
        "end": 422.21
    },
    {
        "text": " Hey, speaking of the air show, we're going to be chatting with General Mike Haugen and a couple of my other friends, other committee members. Looking forward to that. And it's like every two years, right, that the air show comes to town? It usually is every other year. But this year it was a two-year break. Okay, okay. Because last year we just couldn't get a flight team. We couldn't get the Blue Angels or the Thunderbirds.",
        "start": 422.312,
        "end": 450.111
    },
    {
        "text": " The schedules were just, you know, it didn't work out. Well, that's the big draw is the Thunderbirds and the Blue Angels. Yeah, one or the other. The Blue Angels are a bigger draw than the T-Birds, but T-Birds are a wonderful show, too, amazing. We had them here, what, three years ago or whatever.",
        "start": 450.111,
        "end": 465.418
    },
    {
        "text": " But yeah, we're excited. The thing that I'm really pumped about is I bet I've seen the Blue Angels probably 20 times, which is fantastic. It never gets old. Never gets old. But the F-22 Raptor will be here. That is a next generation stealth fighter. And the demo that they put on is unreal.",
        "start": 465.418,
        "end": 487.739
    },
    {
        "text": " The cool thing, and I'll just tell you a quick note, a quick little inside flight, inside baseball stuff here. When you look at the two engines on the back end of an F-22 Raptor, there's a pair of dual engines right underneath the vertical in the back there. What those engines will do is they're not stationary.",
        "start": 487.739,
        "end": 510.367
    },
    {
        "text": " The thrust coming out of those is adjustable, so they can turn that thing on a dime. So you'll see it. When he pulls the jet up, you'll see him crank those engines up, and it's like an outboard motor that pushes the back end of the boat around. You won't believe how that F-22 can turn around. It's unreal when you see it. You're going to want to bring your earplugs, too. I'm just saying. Yeah, especially if you've got little kids, too.",
        "start": 510.367,
        "end": 538.729
    },
    {
        "text": " Yeah. Tebow's loaded, I see. Did you watch any of the convention coverage yesterday? Oh, it was on all day, so you could not miss it if you tried. But we've got Jesse Waters talking about the failed assassination attempt on Trump. And he was there all broadcasting from the convention, so...",
        "start": 538.899,
        "end": 559.855
    },
    {
        "text": " Some of the sound quality isn't that good because you're going to hear some of the convention noise in the background. But, I mean, he's talking about how this kid was there ahead of time and people were suspicious and calling and telling people, telling authorities, and nothing was being done until after the shots rang out.",
        "start": 559.855,
        "end": 582.329
    },
    {
        "text": " He's got Dan Bongino on there with what he found out, and it's just a whole lot of disturbing information that makes you wonder, was this thing set up? You know, I take nothing ever, ever, that I haven't for decades at face value, whatever the government says or whatever the news says, whatever happened, you know.",
        "start": 582.329,
        "end": 609.36
    },
    {
        "text": " And I always go, until I'm told differently, I always go with the path of least resistance. It's like, okay, what's the most viable story for this little crouton to get up there and whip up his crazy salad? You weren't here yesterday, but as I went into this thing, just thinking...",
        "start": 609.701,
        "end": 631.766
    },
    {
        "text": " You know, this is some little Antifa, you know, dip wad who, you know, who somehow got up there. And but then, you know, the more and maybe maybe he had on, you know, some clothing, whatever, that allowed him to get in there or whatever, that someone was noticing. They sign. They sign.",
        "start": 632.056,
        "end": 651.886
    },
    {
        "text": " Well, I know, but I'm saying this is what I had before. And I'm thinking, well, you know, maybe he had a costume or he had some sort of disguise on. We know that the Secret Service detail for Trump hasn't been added to because that was in the news a lot. Remember when Tom Benny Nutz wants to eliminate protections for Trump completely? Yeah. And he's been denied. He's a felon. You can't have protection.",
        "start": 651.886,
        "end": 676.169
    },
    {
        "text": " He's been denied numerous times, increases in his security detail. That's all documented and true. So I'm thinking, well, that lapse, plus just some crazy luck, that kid got up there. But as you hear more and more, and I really looked into it yesterday, I mean, really dug into it yesterday, and our buddy News Hound Nate shot me some texts last night, too, about some stuff.",
        "start": 676.288,
        "end": 697.773
    },
    {
        "text": " There is some stink to high heaven with this thing. Big time. It would seem to me, obviously local law enforcement was in charge of that perch and that facility. They were apparently using it for a staging area. No.",
        "start": 697.773,
        "end": 714.172
    },
    {
        "text": " The not local, the security detail, the national Trump security team. Secret Service. Secret Service. They're in charge of all of it. They are in charge. And they dictate to local law enforcement what to do.",
        "start": 714.599,
        "end": 730.145
    },
    {
        "text": " oh i i get that but i'm telling i'm telling you the local law enforcement had had operation control of that building i don't think so i know that's documented that's documented no they the secret service they're all blaming each other the secret that locals blame in the feds and the feds are blaming the locals and it's just watched bongino on this he did the the secret service swept it and everything else and then many times they hand off to either county state or uh city police",
        "start": 730.657,
        "end": 756.903
    },
    {
        "text": " that members of law enforcement, you guys have this. Nobody gets in or out of here. And then they're good with that because local law enforcement has it, and they go. And local law enforcement had that building. They were using it for a staging area. There was that water tower, too. They had nobody stationed on that water tower, either. There could have been someone up there, too. That was within firing range, as well.",
        "start": 756.903,
        "end": 777.671
    },
    {
        "text": " Here's the crazy thing, Alex Taylor, that this kid was 130 yards away from the president and somehow got a right. And thank God he was shooting a .22 and he shot it badly. Well, it was just a mere millimeter had Trump not turned his head. He was the one whose head would have exploded on national TV.",
        "start": 777.671,
        "end": 798.541
    },
    {
        "text": " Well, here's what boggles my mind. I've been to two presidential things. I told the story yesterday about Secret Service drawing a gun on me just because I didn't get in the press van and I was following the vans in my radio station vehicle in Sioux Falls. They cut me off and drew guns on me because I was in my car.",
        "start": 798.541,
        "end": 819.343
    },
    {
        "text": " And this thing, I mean, you think about guys like my brother-in-law. My brother-in-law would routinely, he was in a shooting club, they would routinely shoot 1,000, 1,200-yard shots, which is a half a mile, greater than a half a mile. You're 800 and what is it, 880 yards and a half mile? And he could put six out of six in a pie plate at 1,000 yards, my brother-in-law, every time. I mean, without...",
        "start": 820.247,
        "end": 845.111
    },
    {
        "text": " They'd hit that thing, and you'd hear they'd shoot the gun, and about a half second later, you'd hear the ting. So to say not only that that building wasn't secured, that that water tower wasn't secured, that every high point three-quarters of a mile out from that facility wasn't covered is an epic fail. Well, and it was like a half hour, too. There are civilians on the ground going, hey, there's a guy up there with a rifle.",
        "start": 846.664,
        "end": 871.852
    },
    {
        "text": " Yeah. And there was a stand down on it. They would not let him fire. Why was there a stand down? They had to supposedly had to wait until the shooter had to shoot at Trump first. Why was Trump even out there? They should have said, hey, there's a guy with a gun running around. You need to go backstage until we get this thing handled.",
        "start": 871.852,
        "end": 892.329
    },
    {
        "text": " Yeah, well, there you go. They needed to take him off stage. There you go. And keep in mind, this is the FBI and the Secret Service. Do we trust them? Do we believe what they're saying? Well, there you go. How do you have a 20-year-old cell phone and claim you can't open it up and you're the FBI? You can't open up a 20-year-old cell phone? His pass, is that secure?",
        "start": 892.329,
        "end": 915.179
    },
    {
        "text": " Give me a break on all this. I am not buying any of it. I bet you they were cleaning out his cell phone or whatever if they didn't do it ahead of time to find out who he was talking to.",
        "start": 915.179,
        "end": 925.026
    },
    {
        "text": " Yeah, the whole thing just stinks to high heaven. The whole thing. They want to have congressional hearings on this because the senators and everyone, they don't buy what's going on, what we're being told by the FBI either. They're saying they want to call people in and do hearings all over the TV on this so everybody can watch.",
        "start": 925.998,
        "end": 947.073
    },
    {
        "text": " Whether anything happens, probably not, because that FBI or the Secret Service gal in charge should resign. She goes, yeah, yeah, I screwed up. Well, what are you going to do about it? Well, I'm just going to do better. Yeah, okay. Yeah. Baloney. Yeah. There's all kinds of things about, again, the Secret Service, this woman who's the director and the DEI nonsense. DEI, yeah, yeah. Don't you want our finest covering these people? Yeah.",
        "start": 947.073,
        "end": 975.009
    },
    {
        "text": " There's videos of somebody on the Secret Service detail. One of the gals who was one of the shorter gals couldn't get her sidearm back in the holster. She kept trying to put it in her holster. Seriously. Don't you learn that day one. Shouldn't you have that skill? Who are you that you don't? And she's looking for it. Come on. And she's on the other side of her hip. And she's trying to find it. And she can't find it. And so she just leaves it. And she just stays a hold of her. That is not acceptable on this level. Who is this? Who is this? And it's like she almost didn't know how to put it in there. She was kind of like.",
        "start": 975.555,
        "end": 1005.452
    },
    {
        "text": " Anyway. So yeah, we've got Jesse covering a lot of that. And then we're going to move to the dismissal of the Trump's classified document case. We've got Andy McCarthy and Jonathan Turley discussing that. And then we have a clip from J.D. Vance talking to Hannity about how Trump asked him to be vice president. It's kind of a cute story. His son was in the room. So it's cute. You'll hear it.",
        "start": 1005.452,
        "end": 1035.418
    },
    {
        "text": " Here's the texter just shot in the point that I made yesterday that I 1,000% agree with. If this was a deep state, if this conspiracy, the texter says, was the deep state, the deep state wouldn't use a 20-year-old inexperienced punk kid. If the deep state rolls on something like this, they don't miss, number one. Number two, the setup would be much more... I think if anything, this is a couple of woke...",
        "start": 1035.418,
        "end": 1065.35
    },
    {
        "text": " Maybe even local cops will let this kid out. I don't know. I don't know. I'm a thousand percent down with that. The deep state would not use that pumpkin and they don't miss. I'm going with deep state on this thing. And they figured the shot would be so easy. This kid's been practicing and they figured he could make it because they weren't going to tell him to stand down. He got off six shots. He got off six shots before anyone put a bullet in his head.",
        "start": 1065.828,
        "end": 1095.247
    },
    {
        "text": " Yeah, unreal. Well, that doesn't take much to get off six. With a president speaking? Oh, yeah. Come on. It takes a lot. I mean, just on a normal day, you and I walking around town, you know, it wouldn't. But with security around the Trump team, I mean, it shouldn't have happened at all.",
        "start": 1096.118,
        "end": 1114.889
    },
    {
        "text": " Well, again, apparently, one of the CIA snipers, they were talking about the vectors that they... Think of a pie chart, okay? And you've got a piece of pie that when you're at the center of the pie, this is your purview.",
        "start": 1115.077,
        "end": 1133.336
    },
    {
        "text": " You cover from here to here. The next person covers from here to here, and you go around 360 all the way around the target. So you've got your purview. Somebody had that kid in their purview. One of the guys said they had him in his purview for 40-plus seconds. And I don't understand. I'm with you, Alex. What in the hell? I mean, we don't shoot unless fired upon in that scenario? No, no, no. We drop that kid the second we see he's got a weapon in his hand.",
        "start": 1133.336,
        "end": 1158.473
    },
    {
        "text": " But, you know, didn't happen. I don't know. There's so much. There always is. There always is. But you know what the bottom line is? These people can't win on policy. They can't win on debate. They can't win on anything. So they got to always, always, always go to violence. Not just this. Think back to George Floyd and all of it. Since this didn't work for them, what's next, Kev? Send in the pandemic.",
        "start": 1159.309,
        "end": 1185.486
    },
    {
        "text": " Yeah. Mark my words. Let's hope not. Send in the pandemic. Bird flu. 621. Got to get Ty Schoenert in here with the latest headlines. Good morning, Ty. Good morning. Two children killed, six others hurt in a rollover crash on I-94 Stutsman County just before 5 p.m. Monday afternoon, seven miles west of Jamestown.",
        "start": 1185.657,
        "end": 1207.79
    },
    {
        "text": " State Patrol says the driver of a Suburban lost control after passing a semi, rolling the vehicle into a water-filled slough. Two boys, ages 10 and 7, died at the scene. The driver, a 30-year-old woman from Cleveland, North Dakota, suffering serious injuries. Also, a 9-year-old girl did as well. Both taken to Sanford Hospital in Fargo. Four other children in the vehicle suffered minor injuries. The State Patrol is currently investigating. As of now, charges are not filed.",
        "start": 1207.79,
        "end": 1235.811
    },
    {
        "text": " North Dakota Governor Doug Burgum not going to be Donald Trump's pick for vice president. A person close to Burgum stated he received that confirmation of the news earlier today via phone call. He selected Ohio Senator J.D. Vance instead prior to Trump's official nomination as party nominee for president. In a statement, Burgum said he would continue to stump for Trump and campaign for them across the country. Lots of details on this by going to our website.",
        "start": 1236.152,
        "end": 1262.244
    },
    {
        "text": " up at am1100theflag.com. They call him Super Producer Chris Larson for a reason. He has a lot of stories and details on there. Yes. A West Fargo woman in custody is after authorities say she stabbed another man to death early Monday morning. Police say Robin Lee is in custody for her alleged role in the stabbing that occurred at 3.36 in the morning. Officers finding 38-year-old Alexander Anderson with a stab wound to the chest.",
        "start": 1262.244,
        "end": 1288.677
    },
    {
        "text": " He later died at the scene. The incident remains under investigation. Charges against Lee are possible. They're still trying to figure out the exact details on some of these things. Police say there's no indication of a threat to the public right now. Blue Earth County, Minnesota is testing its election equipment this week. The public accuracy test will be held at the elections office in Mankato Thursday morning.",
        "start": 1288.677,
        "end": 1311.22
    },
    {
        "text": " Optical scan counters and assistive voting devices also be tested as it's required by state law. Now, the public's invited to witness these testings. They're scheduled for 9 a.m. on Thursday. Good plan. Yes. Dickinson State University President Stephen Easton stepping down following the mass resignation of the university's nursing program staff. This resignation stemmed from concerns over unreasonable workloads and potential accreditation issues.",
        "start": 1311.22,
        "end": 1339.531
    },
    {
        "text": " Easton issuing a statement apologizing for, quote, any mistakes, errors, or shortcomings he made as well. And people are saying their final goodbye to the Mirage Las Vegas, which closes on Wednesday. The hotel and casino will be replaced by a new hard rock hotel, the guitar-shaped Hotel Tower. The Mirage must first give away $1.6 million in cash prizes, though, before it closes. So make your way down there. Yeah, I want to go. Yeah.",
        "start": 1339.531,
        "end": 1367.398
    },
    {
        "text": " So this includes $1.2 million in slot machine winnings and $400,000 in table game prizes and in U.S. dollars in table game prizes as well. We talked about that last week. We had a couple big ones over the weekend. The odds are good. The odds are in your favor. I think we should road trip. So what I'm hearing is Flag needs a no-morning show on the road. I think so. Sounds great. Yeah. More details on all these stories. Check the website out. That's am1100theflag.com.",
        "start": 1367.756,
        "end": 1397.227
    },
    {
        "text": " All right, thanks, Ty. Appreciate it. All right, 625. The Mirage is where we were in 1990 when we were in Vegas for a fight. Is that on the strip or is it downtown? It's on the strip. Okay, all right. And that's where we were for when I talk about the only time I ever was in the same room with Trump was at the Mirage, was at the fight. It was a pre-fight thing. And he was there. Marla Maples was there with him. I think it was Marla, yeah.",
        "start": 1397.312,
        "end": 1421.954
    },
    {
        "text": " That was in those days. In those days, yeah. But the Mirage, man, what a pool. But have you seen the rendering of the new Hard Rock? Yeah, the hotel. Oh, that's wild, isn't it? Oh, my goodness. Crazy. Yeah, I mean, this hotel is going to be huge in the shape of a guitar, like a mirrored guitar.",
        "start": 1421.954,
        "end": 1443.439
    },
    {
        "text": " Wow. I mean, okay. And I can imagine their pool will probably be a little bigger. Yeah. Have you seen some of these pools? I haven't even been to some of them, but man, some of the pools in Vegas are just crazy. I haven't been to Vegas in like 15 years. Yeah. It's...",
        "start": 1443.439,
        "end": 1460.009
    },
    {
        "text": " 6.26, need to know morning show. Dino on the weather desk. Looks like we're nicening things up a little bit here. Yeah, yeah. I mean, you know, we had a hot, humid weekend, and now we're going to kind of temper things down a little bit. But, I mean, hey, you know, it kind of gives you...",
        "start": 1460.452,
        "end": 1477.295
    },
    {
        "text": " You know, it gives you a break from the heat. Yeah, not too bad. We've got a few showers on radar out to the west of the valley moving southeastward. Most of us going to remain dry this morning. And we'll have partly cloudy skies as we head throughout the day. Can't rule out an isolated pop-up storm late afternoon into the evening hours. Let's say after about 4 or 5 o'clock.",
        "start": 1477.295,
        "end": 1495.265
    },
    {
        "text": " So if you have outdoor plans today, you should be good to go. Highs around 77 with a northwest wind of 10 to 20. Clear skies and pleasant overnight tonight. Temperatures in the low 50s and some areas will dip into the upper 40s tonight. That's good sleeping weather. Yeah, it is. And then tomorrow, plenty of sunshine both tomorrow and Thursday with highs around 74. Tomorrow, 80 on Thursday and into the low 80s as we head into Friday. So a pretty decent looking week.",
        "start": 1495.265,
        "end": 1522.705
    },
    {
        "text": " We scour out that heat and humidity and bring in a nice Canadian air mass. Will the warm weather hold into the weekend? Do we turn hot? Will it storm? I'll have all those million-dollar answers for you coming up after 6 a.m. Yeah, big tease. But it's a nice start to the morning. Temperature's down in the northern valley in the low 50s. We're a little warmer here in the FM area, right around 60. So a nice start to the day, not too bad. Yeah, I opened up the windows this morning, turned the air off. Right? Yeah, give it a break for a couple days anyway, right? Yeah, no doubt about it.",
        "start": 1522.705,
        "end": 1552.705
    },
    {
        "text": " Hey, weather brought to you by Vision Banks in Fargo. The bank with the dogs is the bank with vision. That means they have the vision to know their customers, and more importantly, have their customers know them. Have a relationship with your banker. How about that? That's banking with vision, visionbanks.com, if you need more info there. Text us. I didn't give the – you probably got it.",
        "start": 1552.705,
        "end": 1572.927
    },
    {
        "text": " 701-237-1590, studio at flagfamily.com, or the Consolidated Communications Studio line, 701-271-1100. The incompetency of Secret Service, FBI, and DOJ is another issue, says the...",
        "start": 1572.927,
        "end": 1589.002
    },
    {
        "text": " Well, I don't know. Are they incompetent, or was it by design? Yeah, I don't know. You've got to ask that question, too. They said they're all completely incompetent because they opened up the border. Well, we know that that wasn't incompetence. That was 1,000% part of the plan. So I don't know.",
        "start": 1589.155,
        "end": 1606.118
    },
    {
        "text": " Hey, guys, it's a miracle Trump that Trump survived. Why was the only building with a perfect line of sight to Trump left unsecured? Doesn't pass the smell test. Oh, not at all. Not at all. And I'm not saying it does. You know, I just the matter is. But yeah, I just hope we can get to the truth on this someday. But I have my doubts. It'll be like the Kennedy thing. You know, we'll never know. Nothing will ever be released. And there's all these stories going out there.",
        "start": 1606.118,
        "end": 1632.637
    },
    {
        "text": " I mean, even if the smell test is that some little moron somehow got in there and up there without anybody seeing him or, you know, all the way to was, you know, Mayorkas knew about it. I mean, I don't know. There's somewhere in between. You and I with no experience, if we were hired to do security, we would look at that and go, yeah, we need to get a team up there just to make sure.",
        "start": 1633.456,
        "end": 1656.015
    },
    {
        "text": " I mean, it wouldn't even be a. Yeah, I mean, it would just be OK. Yeah, we need some guys up there. They can overlook the situation. And there's a great vantage point to see what's going on in the whole thing. Yeah. I mean, come on. We would do that with no experience whatsoever.",
        "start": 1656.852,
        "end": 1672.671
    },
    {
        "text": " I'd look for every high point inside of three-quarters of a mile away that had any kind of line of sight. And get a guy in there, get a guy up there, get two up there. I want people at this store, at this thing. And you know there's somebody that's the lead of the Secret Service. In fact, I know there is. There's usually one or two guys, people, that will be the head of the detail. And they say this, that, bum, bum, bum, here, there, one, two, six, yeah, everybody go.",
        "start": 1672.671,
        "end": 1699.548
    },
    {
        "text": " And they come in weeks in advance. Okay. Right. Good morning, gang. Tobiah here. Welcome back, Alex. You were missed. Thanks, guys. The Dems have tried everything now. Assassination attempt included. Yet Trump cannot be knocked down with the shooting. Vance's VP, Trump, is going to win in a landslide. As always, great show. Love you too, man. Yeah, we'll see. I don't know. I don't know either. They cheat too. So I don't know what's going on. We've got a ways to go yet. Yeah. The war is not over.",
        "start": 1699.548,
        "end": 1728.831
    },
    {
        "text": " On that story, we've got to get a quick check of sports here. But on that story about Blue Earth County in Minnesota, it's going to show how the machines aren't connected. And they're going to do that in July. I don't care that you have it open to the public.",
        "start": 1729.121,
        "end": 1745.35
    },
    {
        "text": " You know, four months, five months before the election. How about, you know... How about a week before? We're going to have some poll watchers watch it all, y'all. Yeah. We'll see how that all rolls. I can check a couple of things for the sports page for you since Big Game James is not joining us at this moment. The Redhawks fell to the Kane County Cougars handily 10-2 last night. Ouch.",
        "start": 1745.35,
        "end": 1770.384
    },
    {
        "text": " They will continue the series. Kane County tonight. Newman Outdoor Field, 7-0-2 first pitch. MLB All-Star Game. Globe Life Field, Arlington, Texas. Home of the Rangers. We'll get off tonight. Midsummer Classic, 6 p.m. Fox has it. The American League All-Stars will, of course, square off with the National League All-Stars. The American League, I think the AL won it last year. Team USA men's basketball team beat Australia 98-92 in exhibition yesterday. You know...",
        "start": 1770.384,
        "end": 1797.363
    },
    {
        "text": " Devin Booker, Anthony Edwards, Anthony Davis. No one's going to beat these guys. I mean, they'll walk through the whole thing. They'll hang another gold medal on these guys, guarantee you.",
        "start": 1797.363,
        "end": 1809.991
    }
]