[
    {
        "text": " and discussion. This is the Pulse of New Hampshire. From ABC News, I'm Brian Clark. President Biden campaigning in Philadelphia called for unity among Democrats. He received a warm reception at a church where Bishop J. Lewis Felton said, You've been through trouble before. You've lost a wife. You've lost children. But God has never left you alone.",
        "start": 0.009,
        "end": 28.183
    },
    {
        "text": " He also enjoyed the support of Senator John Fetterman of Pennsylvania. The two stopped at a Philadelphia campaign office. If it wasn't for Joe Biden, Trump would be at the White House and he'd be campaigning for his third term. But the week ahead could be significant. Today, House Democratic Leader Hakeem Jeffries expected to meet with other ranking members. The president's future could be a topic. Meanwhile, House Republicans on the Oversight Committee want to interview the president's doctor.",
        "start": 28.183,
        "end": 54.957
    },
    {
        "text": " In a letter to President Biden's doctor, Republican Congressman James Comer writes the committee is concerned Dr. Kevin O'Connor's medical assessments have been influenced by alleged financial ties with the Biden family. Comer cites reports Dr. O'Connor has not recommended the president to take a cognitive test. The committee is looking to interview Dr. O'Connor and is requesting documents from him. He has until July 14th to respond. Perry Russom, ABC News, Washington.",
        "start": 54.957,
        "end": 81.22
    },
    {
        "text": " First exit polls in the French parliamentary elections show a surprise. A leftist coalition earned the most votes. President Emmanuel Macron's centrist alliance was second. The far right was in third after excelling in the first round of voting. But there's no majority for any alliance. Beryl is gaining strength as it approaches the Texas Gulf Coast. In Lavaca, J.D. Villalobos tells ABC he'd rather be overprepared than underprepared.",
        "start": 81.22,
        "end": 105.674
    },
    {
        "text": " Very concerned. We live right across the street from the bay. That's why we're just taking as much precautions as we can ahead of time so that we're not caught in the storm trying to do it at the last minute. Landfall expected tomorrow. Meanwhile, about 10% of the population is under the National Weather Service's most severe heat warning. You're listening to ABC News.",
        "start": 105.674,
        "end": 124.155
    },
    {
        "text": " My son loves to fly kites, but my active psoriatic arthritis can sometimes hold me back. Now with Sky Rizzi to treat my skin and joints, I'm ready to go. Sky Rizzi, Rizin Kizumab Rizza, a prescription only 150 milligram injection for adults, helps with less joint pain, stiffness, swelling, and fatigue. For those who also have plaque psoriasis, 90% clearer skin is possible with just four doses a year after two starter doses. Now.",
        "start": 125.35,
        "end": 149.804
    },
    {
        "text": " Don't use if allergic to Sky Rizzy. Serious allergic reactions and an increased risk of infections or a lower ability to fight them may occur. Before treatment, your doctor should check for infection and tuberculosis. Tell your doctor if you have an infection or symptoms such as fever, sweats, chills, muscle aches, or cough, or if you plan to or recently received a vaccine. With Sky Rizzy, there's nothing like clearer skin and better movement. And that means everything.",
        "start": 152.159,
        "end": 174.514
    },
    {
        "text": " Ask your doctor about Sky Rizzi today and visit SkyRizzi.com or call 1-866-SKY-RIZZI to learn more.",
        "start": 176.578,
        "end": 183.319
    },
    {
        "text": " Today marks nine months since Hamas attacked Israel, and Israel and Hamas have both had positive comments about ongoing peace talks, but ABC's Matt Gutmann in the ruined Gaza city of Rafah says the destruction stands out. The scale of the destruction here in what used to be the street is absolutely breathtaking. Every single house is destroyed. All that you see is a little alleyway carved in the rubble. All that's left is twisted rebar concrete and household goods.",
        "start": 186.152,
        "end": 213.899
    },
    {
        "text": " Minnesota Vikings rookie Kyrie Jackson was killed early Saturday in a car accident along with two of his high school football teammates. ABC's Morgan Norwood has more. All three victims played football at Dr. Henry A. Wise Junior High School. Their coach, Steve Rapp, says they had full lives ahead of them.",
        "start": 217.073,
        "end": 233.336
    },
    {
        "text": " These were three young men that were all running different races, but ultimately was going to end in the same direction. And that was professional football, husbands, fathers, great pillars of the community. And it was all cut short. Jackson was a standout college football star at Alabama and Oregon.",
        "start": 233.336,
        "end": 251.476
    },
    {
        "text": " Maryland State Police say the driver of another car may have been under the influence of alcohol when changing lanes and driving at a high speed and collided with the car carrying the three men. And Oscar-winning movie producer John Landau died at 63. He was best known for his collaboration with James Cameron on movies like Titanic and two Avatar films. I'm Brian Clark, ABC News.",
        "start": 252.568,
        "end": 273.814
    },
    {
        "text": " Life hack number seven, get an iPhone 12 on Straight Talk. Life hack. Here's how it works. You walk into Walmart, go to the electronics section, ask for iPhone 12 with 5G and a dual camera system and select a new silver unlimited plan. They'll smile because it's a good plan. You get real unlimited data all for just $20 a month for the whole first year. Get it at Walmart or straighttalk.com. Straight Talk, less dollars, more cents. Taxes and fees apply. It requires activation of iPhone 12 and a new silver unlimited plan or higher end auto pay enrollment. $25 a month service credit applied for up to 12 months if eligibility requirements are met. For network management practices, visit straighttalk.com.",
        "start": 275.026,
        "end": 304.753
    },
    {
        "text": " The nose knows. And now a few words with Mellow Cannabis CEO, Gene McCain. When you go into a wine store, you don't ask, what's your highest percent alcohol wine you have? We all know that's crazy. No one would do that. Getting to know the aroma profiles is a much better way of getting to know what cannabis is going to be the most appealing for you. Easy access, friendly service, exclusive selection along with the best pricing. MellowHaverold.com for use by adults 21 years of age or older. MR number 281-811.",
        "start": 304.753,
        "end": 334.735
    },
    {
        "text": " Summer's here, and now's the time to get that garage back in shape. You really want to kick it up a notch? Have Overhead Door Company of Concord replace those beat-up garage doors. That'll create some oh-wows. Or create a double oh-wow with an epoxy floor installation. Save $350 when you get new garage doors and a new epoxy floor installed by Overhead Door Company of Concord this summer. Why wait? Call Overhead Door Company of Concord today for your free estimate. Online at OHDConcord.com. That's OHDConcord.com.",
        "start": 334.735,
        "end": 364.599
    },
    {
        "text": " Dive into adventure during the great outdoor sale at Campers in RV. For a limited time, RVs starting at $13,999 or upgrade to a spacious 25-foot RV for just $7 a day. Plus, receive a complimentary National Parks Pass with every RV purchase. Who's in? Trust our five-star rated service over 2,000. Satisfying customers can't be wrong. Visit Campers in RV or Campersin.com and unlock endless fun. Based on 20% down, 8.99% for 144 months. WAC inventory subject to availability. See dealer for details.",
        "start": 364.599,
        "end": 393.933
    },
    {
        "text": " Hey guys, it's Rob Carson. For years, my comedy helped make the Rush Limbaugh show hilarious, and now you can hear it on my show as we take back mockery, ridicule, and comedy from the left on the Pulse of New Hampshire, new to three weekdays, and always free to download Pulse of New Hampshire app.",
        "start": 394.172,
        "end": 408.49
    },
    {
        "text": " From the MB Tractor Weather Center, the pulse of New Hampshire weather. Here's your AccuWeather forecast this afternoon. Sunshine, some clouds, becoming less humid, the high 91. Partly cloudy, sticky tonight, going down to 65. Tomorrow's a partly sunny, warm day, the high 89. And then sunshine will give way to clouds on Tuesday with an afternoon and evening thunderstorm at spots. It'll be hot with high temperatures in the low 90s. I'm AccuWeather forecaster Rose Tamburino.",
        "start": 409.189,
        "end": 438.302
    },
    {
        "text": " The Pulse of New Hampshire. Gunshot in a gun store, end up killing somebody. We're going to go over some gun safety rules again, because you can't go over them too many times. But first, I want to bring in a friend of ours. He's been here many times. I call him the country's number one celebrant of freedom and American exceptionalism. Joining us right now is Ted Nugent. Mr. Nugent, welcome.",
        "start": 441.92,
        "end": 471.698
    },
    {
        "text": " Well, I feel welcome, Tom. Thank you for having me on Gun Talk, and thank you for those kind words. I'm proud to join you on the greatest radio show in the world. God bless you. Be very proud of you. Well, thank you, sir. So tell me what happens at the Nugent compound with your family on a Fourth of July celebration.",
        "start": 472.005,
        "end": 489.172
    },
    {
        "text": " Well, Tom, I'm an extremist. I don't know if you've noticed over the years, but I'm radical. Never noticed that, Ted. I celebrate Independence Day every day. I celebrate Thanksgiving, Memorial Day, Veterans Day every day. The Nugent family still...",
        "start": 489.855,
        "end": 502.637
    },
    {
        "text": " is Jenny reflecting at the altar of self-evident truth, logic, common sense, God, family, country, law, and order. So we shoot almost every day anyway, so we don't have fireworks to just go bang. We have fireworks where you can have projectile management and aim small, miss small. So the family gets together. We cook venison almost every day anyway. So it was a day with the dogs. I'm training a new puppy from Mossy Pond Lodge, just the most wonderful hunting puppy I've ever had, and I know I've said that about all of them.",
        "start": 503.217,
        "end": 533.217
    },
    {
        "text": " But we celebrate Independence Day every day. So what kind of dog? It's a brand-new Labrador. We just said goodbye to our beloved Happy, which was a Catarula Black-mouthed Cur. And it's so heart-wrenching. It's hard to get over. And I would never hold the new puppy up to Happy's standards because he was just a miracle hunting buddy. But this little puppy...",
        "start": 533.217,
        "end": 556.63
    },
    {
        "text": " And, again, I've got to mention Mossy Pond Lodge down at Georgia. I did a lot of research, and this little puppy at 12 weeks is retrieving red squirrels from the pond and blue jays and grasshoppers. He's really showing amazing promise. So it's a great, great happy time for the Nugent family.",
        "start": 556.63,
        "end": 574.445
    },
    {
        "text": " Yeah, you make a good point here. And yes, there are a lot of places you can go get a dog. People are all about rescue dogs. But if you really want a hunting dog that can perform for you and you can enjoy for a lifetime, it makes sense. It pays off to do your research. There are a number of places that are doing exceptional work at breeding and training and really bringing together the genetics to build you a fine dog that will last his entire life.",
        "start": 574.445,
        "end": 601.135
    },
    {
        "text": " And it's worth the time, and I would just say, and the money. People say, well, yeah, that costs money, Ted. Well, yeah, but we're talking 10, 12, 15 years, and all of them are going to be great or maybe not so great if you don't do your work on the front end. Yeah, that's true. That's a real important point, especially a show like yours that's supported by Ducks Unlimited, where we have such great, great hunting opportunities today, thanks to the conservation organizations. But I hunt...",
        "start": 601.135,
        "end": 625.213
    },
    {
        "text": " Every day, Tom. I mean, I literally environment hunt or trap environments every day. We do some type of hunting, fishing, trapping literally every day on the sacred swamps of Michigan or our home in Texas. So these dogs get quite a workout. This little puppy has already dragged home two woodchucks that are bigger than he is. Oh, my God.",
        "start": 625.606,
        "end": 644.667
    },
    {
        "text": " If that doesn't turn a hunting spirit on, I don't know what does. I got this old 1970s Browning A-Bolt .22 Magnum that's an absolute sniper. We're just having the time of our life. Isn't there just something special about the rimfires, the .22 long rifles, and the Magnums? I keep saying people need to shoot them more because every time you do, you go, this is really fun. I don't know why I don't do this more.",
        "start": 644.667,
        "end": 672.073
    },
    {
        "text": " Well, what you celebrate on Gun Talk is universally participated in in the Nugent world. I get to train with",
        "start": 673.063,
        "end": 681.51
    },
    {
        "text": " They're heroes of lawn sports. We've got a bunch of SWAT guys coming out tomorrow. We're doing a benefit for two lost heroes that were gunned down by this engineered recidivism, one in Hillsdale County and one in Oakland County near Detroit. So I get to hang with these guys. We raise money for their families, but we do a lot of shooting. I've got my dad's old Model 41 Remington Targetmaster, and I'm shooting CCI CB caps. And, Tom, I know you –",
        "start": 681.817,
        "end": 706.869
    },
    {
        "text": " You probably questioned my claims here, but I shot a red squirrel at about 75 yards with a CB cap with the old buckhorn sight. But that trigger time, trigger time, trigger time, trigger time will maximize your marksmanship.",
        "start": 706.869,
        "end": 722.875
    },
    {
        "text": " It's really amazing. And, you know, if you can't go live fire, you can still dry fire. And it is like 90% as good as you're just getting trigger time. And you're right. It's paying attention to the trigger and understanding. I mean, people say, well, you know, I keep missing this way or my groups are too big. And the answer is almost always it's not the sights. It's not anything else. It's simply your trigger. And if you're missing or if you're shooting big groups or if your groups aren't where they're supposed to be, there's a really good chance that it's the trigger and nothing else.",
        "start": 723.592,
        "end": 752.978
    },
    {
        "text": " I'm going to tell you something on Gun Talk. You've covered all the bases, but the guitar player from Detroit is going to say something that's never been said before. Two things. Number one, if the shooters out there really want to tighten their groups and get that physics of spirituality, the sight acquisition, the trigger control, the breathing, the coordination of the hand, eye, lungs, the whole spirit of the path of your projectile,",
        "start": 753.558,
        "end": 780.691
    },
    {
        "text": " Archery, Tom, I'm telling you, all my shooting buddies, especially SWAT guys, once I turn them on to the mystical flight of the arrow and they have to let that arrow go under a little bit more tension at full draw, their handgun, their sniper rounds, their groups, they get tighter and tighter because something happens psychologically at full draw. And I mean a lightweight, graceful, effortless bow, not a weightlifting archery. Right.",
        "start": 780.896,
        "end": 807.619
    },
    {
        "text": " Easy, graceful, stealthy. The more you shoot a bow and arrow, the tighter your firearms groups will get, I promise you.",
        "start": 807.619,
        "end": 816.698
    },
    {
        "text": " Let me take that one step further, and people are going to say, okay, Tom and Ted have gone off the deep end here. But there is a thing that happens with archery. And, I mean, I started shooting stick bows and loves my stick bows. There is, and I don't know if you call it zen. I don't know what you call it, some kind of mental state that you get into. But there's a thing that happens, and it sounds crazy, but you'll understand it.",
        "start": 817.125,
        "end": 841.323
    },
    {
        "text": " you become one with the bow, you become one with the arrow, and you actually end up launching yourself downrange. Okay, how crazy does that sound?",
        "start": 841.323,
        "end": 849.753
    },
    {
        "text": " Well, that's exactly the origins of Zen and the martial arts. But I think the best way to establish the beauty of becoming one with the path of your life slash projectile is that when you get a bow and you grab that bow with your hand and you knock that arrow, even as you're contemplating drawing the bow back, there's no Joe Biden. There is no criminality. There's no evil. I'm telling you.",
        "start": 850.435,
        "end": 877.415
    },
    {
        "text": " It's out of body. It's the ultimate martial arts. And then you transfer that martial arts zen oneness of archery, and it will apply to your handgun shooting. It will apply to your trigger control, no matter what the firearm you're using.",
        "start": 877.415,
        "end": 892.875
    },
    {
        "text": " Well, and to add to that, people are going, yeah, yeah, okay. All right, okay, forget that. Maybe you don't want to go that way. Let me just tell you this. If you take up archery in addition to the other things you're doing, you are adding just a pure fun sport. Here's a question for you, Ted. You have taught gazillions, hundreds of thousands of kids to shoot. Have you ever had a youngster try archery and not enjoy it?",
        "start": 892.875,
        "end": 915.606
    },
    {
        "text": " Tom, I just wrapped up our 30th. I get such a chuckle out of this because, boy, you're pushing the buttons here. We push the united buttons. I just wrapped up the 35th Ted Nugent Camp for Kids charity event. Totally nonprofit, 100% volunteer by families.",
        "start": 916.63,
        "end": 932.073
    },
    {
        "text": " And you're right, tens of thousands of kids. And when we go to the archery range, when we go, they like their shotgun and they like their 22. They like the slingshots. They like the trapping. They like the fishing. But once that kid, especially a city kid who's never touched a bow and arrow before.",
        "start": 932.295,
        "end": 948.626
    },
    {
        "text": " You can hardly get it out of their hands. They become enthralled with the fact that they're totally independent. It's up to them and their gifts from God to be applied to the knocking, the visual, the control, the breathing, and every arrow, every next arrow.",
        "start": 948.626,
        "end": 967.415
    },
    {
        "text": " is a chance to do better. And it becomes an addiction, a really, really good addiction. And then our Camp for Kids children go on to be positive peer pressure downtown and back in their lives. And we've got so many kids to become sportsmen and women, to become outdoorsmen.",
        "start": 967.415,
        "end": 984.684
    },
    {
        "text": " and to understand that being clean and sober will help you put that arrow or that bullet in the right place. So it really is a universal mantra of discipline, self-control, and independence. All right, Ted, I'm going to have to wrap it up. I need you to send me off with a positive view for everyone on America and Americans and freedom and patriotism.",
        "start": 984.684,
        "end": 1008.387
    },
    {
        "text": " Well, again, it's hard in these horrible times. These are the worst of times. But we improvise, adapt, and overcome. And I'm going to tell everybody, join me at HunterNation.org. It's a nonprofit that is targeting conservative sportsmen and women who haven't voted in the past. And when they go to HunterNation.org, we get these people to be a voting force for conservatism. There it is. Ted Nugent, thank you, my friend. Always a pleasure to have you here. Godspeed. Abe Small, Miss Small.",
        "start": 1009.206,
        "end": 1038.865
    },
    {
        "text": " Take care. All right, when we come back, I got my own range of ports. I got a good one, kind of a bad one that ended up turning out to be a good one in the end. If you want to join me, 866-TALK-GUN or TomTalkGun. I'm Tom Gresham. This is Gun Talk.",
        "start": 1039.394,
        "end": 1056.664
    },
    {
        "text": " For over 85 years, Brownells has been your one-stop shop for firearms, parts, and accessories. Visit Brownells.com today and explore a vast selection of over 50,000 products, all backed by our industry-leading forever guarantee. Discover the difference that exceptional service, selection, and satisfaction can make. Brownells, serious about firearms since 1939.",
        "start": 1066.681,
        "end": 1093.166
    },
    {
        "text": " Black Hills Ammunition is now loading a 300 PRC round with the excellent Hornady 212 grain ELDX hunting bullet. The new PRC eliminates the unnecessary belt of the 300 Winchester Magnum and increases the body diameter. The 300 PRC 212 ELDX travels at over 2,850 feet per second with 3,824 foot-pounds of energy. The result is an optimum combination of accuracy and game-stopping performance. Black Hills Ammunition, the power of performance.",
        "start": 1095.811,
        "end": 1125.606
    },
    {
        "text": " Mental health and guns. At Walk the Talk America, we are working with both the mental health community and the gun industry. Created by a gun industry veteran, Walk the Talk America seeks to raise awareness and create change through suicide prevention and firearm safety without legislation. We strive to eliminate the prejudice that firearms and mental health face. For more information and to support Walk the Talk America, please visit walkthetalkamerica.org.",
        "start": 1126.869,
        "end": 1156.101
    },
    {
        "text": " Since 1946, Timney Triggers has been providing shooters with unmatched accuracy through the world's finest triggers. From bolt guns to gas guns to handguns, shooters around the world trust Timney to aid them in their quest for precision. With over 170 different trigger models, all proudly made in the USA, Timney is the one-stop shop for your trigger needs. Find your new trigger at timneytriggers.com.",
        "start": 1156.886,
        "end": 1185.282
    },
    {
        "text": " All right, we're back with you. Give me a call, 866-TALK-GUN. There's a gun that you want to tell me about, or maybe there's one you want to ask me about, or maybe you're even thinking about buying your first gun.",
        "start": 1200.077,
        "end": 1210.691
    },
    {
        "text": " Well, you know, the old thing about there being no stupid questions. Well, that's generally true. And we can handle pretty much anything that you want to toss out here. If you're thinking about buying your first gun, you've thought about, you know, I don't know, maybe you ought to get a gun for home protection or for self-protection or for, I just don't like the way things are going. I don't like what I'm seeing in the news. Everybody wants to know. They always ask the wrong question first.",
        "start": 1210.811,
        "end": 1235.913
    },
    {
        "text": " Everybody. What gun should I get? I understand it. I understand where you're coming from on that. But we will help you sort that out because it actually is the wrong question.",
        "start": 1236.169,
        "end": 1246.664
    },
    {
        "text": " And we can answer that. So if you are in that category of either thinking about buying your first gun or you have recently purchased a gun for home defense or self-defense and you want a little bit more information about it, let's go down that road. Again, the number is 866-TALK-GUN. Okay, we love our range reports here. And we like to talk about new guns or old guns or taking people out to the range or having interesting experiences, just swapping stories. That's really what it is all about.",
        "start": 1246.971,
        "end": 1274.906
    },
    {
        "text": " So I got a new gun in, and I think I mentioned last week, yeah, it was brand new out, and I finally got it in this week. It's the Sig Sauer P365 Fuse. And I've been a fan of the P365 series since it first came out. It kind of created its own new category of small gun, double stack,",
        "start": 1275.845,
        "end": 1299.07
    },
    {
        "text": " 10 plus 1 originally, and then 12 plus 1, and then bigger guns and different variations, and the macro with a compensator and the XL and the this and the that. Well, the Fuse is really interesting. It's a larger version of the P365. It's still got the slim grip, feels really good in the hands. But it comes with a 17-round mag and two 21-round mags. Yeah, 21-round mags.",
        "start": 1299.258,
        "end": 1328.08
    },
    {
        "text": " Just feels good. It's got a four and a third inch barrel, if I remember right. So anyway, got it in, picked it up, tried, you know, man, I like the feel of it. We're looking at it at the store. It's all great. So I'm driving back home. This is the first encounter, which was very interesting. And I, the road where I'm going, the road back home is the speed limit's 35, right?",
        "start": 1328.524,
        "end": 1351.323
    },
    {
        "text": " And I'm poking along at 35 because I'm that guy who drives 35 or maybe one or two over. And I go around a corner. There's nobody around. And so, I mean, I'm turning this corner, turning from one road to another, and I'm probably going 20 miles an hour.",
        "start": 1351.886,
        "end": 1367.568
    },
    {
        "text": " around the corner. And I just take the corner a little wide. There's nobody around. And I go down the road another quarter of a mile and a sheriff's deputy goes past me the other way and I see him slow down behind me and turns on his lights and turns around and comes back and pulls me over. And the young sheriff's deputy comes up to the window and, you know, how you doing? I'm doing fine. Well, I'd like to see your license and registration. Okay.",
        "start": 1368.2,
        "end": 1393.217
    },
    {
        "text": " I said, before I start digging into things here, Deputy, just need to let you know that I am carrying a firearm today. He says, oh. He said, where is it? I said, well, it's at the 3 o'clock position on my hip on a belt holster. He says, okay. He says, where's your permit? I said, it's in my wallet.",
        "start": 1393.933,
        "end": 1410.503
    },
    {
        "text": " He said, okay. It's like, all right, fine. Didn't need to see the gun, didn't need to see the permit. All right, cool. So I get the license and registration, give it to him. Clearly what he was doing is I took the corner wide because it's a remote area. There's not a car in sight other than this sheriff's deputy's car coming way down the road. And he wants to see if I've been drinking, which I had not, of course. So he comes back, and this is where it got really interesting.",
        "start": 1411.015,
        "end": 1436.817
    },
    {
        "text": " He says, all right. He says, your registration expired yesterday. Well, we had renewed it. I just hadn't put the piece of paper in the car. He says, you need to get that taken care of. I was like, I'm not going to write you out. Just get it taken care of. I said, okay. So we chat for another second or two. I said, well, I'm on the way back from Tackle Tom's, local gun store. He says, yeah. I said, yeah, I picked up a new gun. He said, oh. I said, yeah, I think it's probably the only one like it in the state. It's brand new from SIG. He says, really?",
        "start": 1438.046,
        "end": 1464.957
    },
    {
        "text": " I said, well, you want to see it? He says, well, yeah. So the gun is in the case on the passenger side. So I pull it over, pop open the case right there, pull the gun out, drop the mag, lock the slide back, hand it to him in a safe manner. I stick it out the window. And now the sheriff's deputy has my new gun in his hand. He's going, wow.",
        "start": 1465.503,
        "end": 1490.742
    },
    {
        "text": " That feels good. Man, I like that. So now we're doing a whole gun talk segment on the side of the road out here. I said, oh, yeah, man, it's got a 17-round mag, comes with two 20-round mags. He said, yeah, I really like that. I said, oh, cool. So he hands it back to me. I said, well, do you like guns? He says, well, yeah. I said, well, so I started telling him about gun talk and the videos we do. He goes, well, I've got to check that out.",
        "start": 1490.998,
        "end": 1514.855
    },
    {
        "text": " He said, all right, you have a good day. And that was the extent of it. We had a little gun show on the side of the road, just shooting the breeze and looking at a new pistol. How much do I love Idaho? It was terrific. So part two of the story is I go to the range yesterday. And first time we fired the new P365 fuse.",
        "start": 1515.06,
        "end": 1537.534
    },
    {
        "text": " And so I got my buddies Mike and Andrea and Ron are with me. And they've got their guns, and we're going to just do a little shooting for an hour or so. And I brought a lot of ammo because I want to shoot this new pistol a good bit. And so I load it up, start shooting it, and it's like, wow. It had suddenly became a jam-o-matic. It's like I probably had one or two failures to feed in every magazine.",
        "start": 1538.183,
        "end": 1563.029
    },
    {
        "text": " We're going, wow, that's weird. You tap the back of the slide, get it to go in. Sometimes the failure to feed was such that you couldn't even do that. You had to drop the mag and work the slide and get it back going. And I'm saying, well, you know, don't get upset. Just keep shooting and we'll see what we get. And it shot great. It feels terrific.",
        "start": 1563.268,
        "end": 1584.94
    },
    {
        "text": " And then everybody wanted to shoot it. And so by the time we got to, I'm just spitballing here, about 200 rounds through it, we were seeing fewer and fewer malfunctions. And once we got past about 200 rounds, we had zero. After that, we didn't have a single failure to feed, a single issue.",
        "start": 1586.101,
        "end": 1607.108
    },
    {
        "text": " And I point that out because I've talked about it on the show before, breaking in a gun or giving it a chance. There are going to be a lot of people who would say, well, if I went out and shot it and I had a failure to feed in every magazine, after they got to like the third or fourth magazine, they're going to take it back and say, this is no good. I got to take this gun back. Which, okay, fine. But I'm just telling you, as you shoot the gun,",
        "start": 1607.841,
        "end": 1634.872
    },
    {
        "text": " If there are rough parts in it, and this is, remember, we're talking real low serial numbers here. This is a very first production gun. Things are burnished in, they're getting polished, they're smoothing out, and it just gets better and better. And when you get to three or four or 500 rounds, you got a nice slick gun. The trigger gets better as well.",
        "start": 1635.162,
        "end": 1657.005
    },
    {
        "text": " Now, could you avoid that? Yeah, you can. You can spend three times as much and have all that polishing done by a gunsmith. And now you've got a $2,500 gun instead of a $700 gun. And those are great. Look, there's nothing wrong with that. It gets you a nice STI or a custom Colt or something, you know, Wilson Combat, Ed Brown, any of those. And you paid somebody to go through and do all that. I just did it by pulling the trigger and shooting and getting some practice in.",
        "start": 1657.654,
        "end": 1687.551
    },
    {
        "text": " So it's one of those deals that it is real and we watched it happen. It just got better and better as we shot it. And at the end, it is a delightful pistol. I cannot wait to shoot it some more.",
        "start": 1687.927,
        "end": 1701.152
    },
    {
        "text": " I may. I got to try it out with a new holster and see. I don't know if that could become my everyday carry gun. It's a little large, but it might work. I don't know yet. So let me just throw it out there. Have you ever had to break in a gun or seen something like this happen? And what would your reaction be if you started shooting it and you were getting these malfunctions or failure to feed right off the bat? Would you just give up or would you just persevere? 866-TALK-GUN.",
        "start": 1702.278,
        "end": 1730.367
    },
    {
        "text": " ABC News, I'm Brian Clark. President Biden back on the campaign trail in Philadelphia. He called for unity among Democrats at a church and then at a campaign office, said he would shift the focus back to his opponent, Donald Trump. The next 120 some days or so, they're going to get a real good look at who Donald Trump is.",
        "start": 1747.756,
        "end": 1767.159
    },
    {
        "text": " However, there's still uncertainty among members of Congress. Five House Democrats have called on the president to step aside and headaches for the president from Republicans. Chair of the House Oversight Committee requesting an interview with the president's doctor, citing reports that Dr. Kevin O'Connor's not recommended the president take a cognitive test.",
        "start": 1768.575,
        "end": 1787.159
    },
    {
        "text": " Beryl is gaining strength, expected to regain hurricane status today and make landfall tomorrow along the Gulf Coast in Texas. And polls have closed in the second round of the French parliamentary elections. First exit poll showing a surge in support for the left and center parties. This is ABC News. Sundays at 3 on the Pulse of New Hampshire, it's Gun Talk with Tom Gresham. Now in its 27th year, Gun Talk is the original gun, gun safety, and shooting sports show. Gun Talk is powered by",
        "start": 1787.159,
        "end": 1816.305
    }
]