[
    {
        "text": " You know, the online people are going to generate so much mail over this comment because everybody's going to write me and tell me, I got nine years out of my battery. Good, lucky you. The industry says, you know, listen, you're the guy stuck on the side of the road or in the parking lot at 2 o'clock in the morning when it won't start. You know, the industry says four to five years.",
        "start": 0.503,
        "end": 20.64
    },
    {
        "text": " And AGM batteries, AGM batteries are a funny duck, right? They're a completely different type of battery in a sense. I've seen certain models gobble up batteries every three and a half years, and I've seen certain models go six years. But beyond six years, I'm putting a battery in it. And if I'm changing...",
        "start": 20.862,
        "end": 39.701
    },
    {
        "text": " If I'm changing the battery in a vehicle and it has a separate start-stop battery, I'm doing that as well because that battery is generally the same material, and obviously it's the same age. So if one went, the other went. Batteries are a very complicated conversation to have these days. They really are. On a newer car, do you have to get start-stop now on a gas engine?",
        "start": 39.701,
        "end": 64.497
    },
    {
        "text": " You don't have a choice. It'll depend on what the manufacturer is trying to achieve from emissions values. The reason there's start-stop, let me answer it this way. The reason there's start-stop is manufacturers are trying to hit a certain fuel economy.",
        "start": 64.65,
        "end": 79.104
    },
    {
        "text": " Because how many cars they sell that get 40 miles to the gallon versus how many cars they sell that get 20 miles to the gallon, they get emissions credits and different compensation from the government because they're trying to clean up the environment. And that's really where all that start-stop technology came from. They're worried about emissions and gasoline.",
        "start": 79.428,
        "end": 98.08
    },
    {
        "text": " There are ways to get around start-stop. There are some vehicles that come with a button that you can turn it off. If the vehicle has a fault code in it, the start-stop will not work in most experiences that I've had. If I get to a traffic light and I want to see if start-stop doesn't work, pop it into neutral. Just got to remember to hold your foot on the brake so the car doesn't roll. But sometimes popping it in neutral will take it away. I personally have an issue with start-stop real quick.",
        "start": 98.08,
        "end": 126.34
    },
    {
        "text": " Because I just worry that on an older vehicle, the abuse I'm putting on the starter, how good is that battery? I don't want to find out, you know, late at night in a bad part of town, right, that my stop-start battery isn't working. You know, to me, I'd like to know once the car started, I'm coming home late at night, et cetera, I'm going to get there. Yeah. But shame on me. I try to think logically. Yeah.",
        "start": 126.34,
        "end": 155.333
    },
    {
        "text": " And you know, I did an experiment, Ron, last year. I just bought a brand new car. I left it on. I didn't touch anything for six months. It said I saved a total of 0.97 gallons of gas. Well, listen, I can show you that the government's crazy.",
        "start": 155.333,
        "end": 172.722
    },
    {
        "text": " All right? You know, it's, listen, move to New Jersey. Move to New Jersey and go get a vehicle titled in North Jersey. I had to travel an hour and five minutes a week ago to go get a vehicle titled, but the agency that does registration is six minutes from the house.",
        "start": 172.722,
        "end": 185.828
    },
    {
        "text": " So, you know, but we're trying to clean up the environment and save gasoline. I want to know who makes up these things. Who thinks of this? Somebody that rides a bicycle, I bet. Yeah, even for the government, the post office would be out of business. Right. Exactly right. You wouldn't need it. Yeah. It's crazy. All right, sir. I got to run. Thanks for the info about the website, Tom. You have a great time. Get out to autobatteries.com, and that'll help you in the future, and you be well, and thanks for being part of the Car Doctor family.",
        "start": 186.374,
        "end": 213.473
    },
    {
        "text": " I'm Ron Ananian, The Car Doctor, 855-560-9900. I'll return right after this.",
        "start": 213.473,
        "end": 218.609
    },
    {
        "text": " Ronananian, the car doctor, is brought to you in part by Dorman Products, featuring the largest selection of direct replacements for failure-prone turbocharger system parts in the business. Learn more at DormanProducts.com. Clean, correct coolant is vital to the life cycle and operation of your vehicle's cooling system and engine.",
        "start": 239.206,
        "end": 256.698
    },
    {
        "text": " Peak Antifreeze Plus Coolant is specially engineered to deliver guaranteed superior lifetime protection. It's compatible for use with any color or type of antifreeze in your vehicle system. And with robust organic additives, Peak Antifreeze Plus Coolant will fight against the damaging effects of scale deposits and corrosion.",
        "start": 256.852,
        "end": 275.691
    },
    {
        "text": " You can learn more at PeakAuto.com. That's PeakAuto.com. Clarios is a global leader in energy storage solutions, powering one in three of the world's vehicles today. They offer the most advanced battery technologies for virtually every type of vehicle. We recently talked with Clarios Vice President of Technology, Craig Rigby. Craig touched on the future of electric and hybrid vehicles. New vehicle production is definitely shifting towards hybrids, and in particular, electric vehicles at a very rapid pace.",
        "start": 275.691,
        "end": 304.036
    },
    {
        "text": " Claris estimates that out of the 1.7 billion cars expected to be on the road by 2040, up to 50% of those will be some combination of full, mild hybrids and electric vehicles. This shift will require a lot of change, not the least of which is having enough charging stations to make both daily driving and long trips practical.",
        "start": 304.531,
        "end": 322.739
    },
    {
        "text": " As different and complex as these vehicles have become, the basic things we do to maintain them won't really change. And that includes maintaining your 12-volt battery and changing it out when necessary. Learn more about AGM batteries at Autobatteries.com. That's Autobatteries.com.",
        "start": 323.353,
        "end": 339.121
    },
    {
        "text": " As a professional, you've got 1,001 things to track in your shop and zero minutes to slow down. AutoZone understands that and is here to help you keep your business moving. AutoZone has original equipment quality or better parts from brands you can trust, leading in-stock coverage, fast hotshot delivery, and easy-to-track online ordering so that you can get the right parts right when you need them. Keep it moving with AutoZone's Professional Edge.",
        "start": 339.121,
        "end": 366.869
    },
    {
        "text": " Orange County Tourism is your go-to guide for all the events in the county. Starting in Monroe on Mill Pond Parkway for their annual carnival the weekend of August 2nd, it's the most fun you can have with the entire family, including rides, games, food, and live music for all ages.",
        "start": 368.797,
        "end": 385.862
    },
    {
        "text": " Please leave your dog home. For more information, visit villageofmonroe.org. The Thunderbird Farm in Goshen invites you to their opening day for the Sunflower Festival. Have fun singing karaoke and enjoy live music, a vendor market, food, beer, wine, cider, and fresh cider donuts. There are many activities for the kids and cornhole for the entire family.",
        "start": 385.862,
        "end": 409.411
    },
    {
        "text": " There's no parking or entry fee to enjoy these fun festivities. Only a small fee to enter the sunflower field. Be sure to bring your own garden shears or purchase them from the farm. To learn more, visit ThunderbirdFarmLLC.com.",
        "start": 409.411,
        "end": 424.428
    },
    {
        "text": " For all the events and happenings in the county, visit orangetourism.org. Burke Catholic is the premier preparatory school in the Hudson Valley and encourages students to fulfill their passions in the areas of the fine arts, academics, athletics, and community service.",
        "start": 424.428,
        "end": 439.599
    },
    {
        "text": " Burke Catholic has a 100% graduation and college acceptance rate. Our seniors are awarded on average $180,000 in college scholarships. Burke Catholic's personalized approach to guidance ensures success for every student in grades 6 through 12. For more information or to schedule a tour, visit burkecatholic.com.",
        "start": 439.599,
        "end": 459.155
    },
    {
        "text": " The Black Dirt Feast, hosted by the Pine Island Chamber, invites you to the finest alfresco dining in the county. Tuesday, August 6th on Social Island, where you'll be served farm-to-table, locally sourced food prepared by the finest, award-winning local chefs. And where you'll dine under a tent with chandeliers lighting the night sky. During the cocktail hour, there'll be soft music, a signature drink, and hors d'oeuvres served. Seating is limited, so buy your tickets now by visiting pineislandny.com.",
        "start": 459.155,
        "end": 488.114
    },
    {
        "text": " hi this is frank lowell tune in every sunday morning at nine for and all that jazz you'll hear music of every musical style it's the most eclectic show on radio that jazz",
        "start": 489.735,
        "end": 511.254
    },
    {
        "text": " Welcome back. Ron and Amy in the car doctor here to answer your questions at 855-560-9900. Let's go over to Travis up in Canada and see what's going on here. Travis, welcome to the car doctor, sir. How can I help? Hi, Ron. Thanks for having me. How are you doing? You're welcome, sir. Good. What's going on?",
        "start": 521.681,
        "end": 537.432
    },
    {
        "text": " I got a 2003 Mitsubishi Eclipse. It's got 131,000 miles on it, and it's got the 2.4 liter motor in there. Right, yep. And I've been fighting a P0171 for, oh, I don't know, about eight or nine months. Right. And it's been off the road for a while just as I'm trying to diagnose and fix the darn thing.",
        "start": 538.916,
        "end": 560.606
    },
    {
        "text": " And yeah, I've kind of gone through the service manual and I'm kind of stuck. I don't know where else to go. I've checked for vacuum leaks, exhaust leaks, and I've fixed a few of those. And it's still throwing the code. The vacuum leaks I fixed have brought the short-term fuel trim back.",
        "start": 560.998,
        "end": 579.718
    },
    {
        "text": " Down at idle, which at first I thought that was, oh, hey, maybe that was the problem. But my long-term fuel trims driving and at idle and under load are stuck at 12.5 all the time. Okay. So it's always got high fuel trims. Are the fuel trims high at idle or even going down the road?",
        "start": 580.196,
        "end": 600.282
    },
    {
        "text": " Both. The long-term is just pegged out at positive 12.5. At idle, they were low 20s consistently before I fixed the vacuum leaks. And then now they seem to be long-term stuck at 12.5 and short-term is anywhere from plus, I'd say plus 7 to plus 10. Okay. All the time. Okay. So have you tried making this richer? Do you have any propane?",
        "start": 601.715,
        "end": 629.701
    },
    {
        "text": " I have, yeah, and immediately when I throw that in the intake, the trims come down. Okay, good. So that shows us DO2s are working, right? Yeah. It's able to respond. So sitting there at idle, warmed-up engine, have you looked at mass airflow grams per second? Yeah, I'm sitting at about 2.8. That's about right. That's about right. And then as you accelerate down the road, it increases, right?",
        "start": 631.032,
        "end": 658.626
    },
    {
        "text": " Yeah, absolutely. Yeah. Okay. And have you poked around with propane? For, like, looking for leaks, you mean? Yeah, just looking for a vacuum leak. I've smoke-tested. I bought a smoke machine off Amazon, and that's been great. That helped me find my other leaks. So now, when I go into the brake booster or another line, the only minor leak that I have is...",
        "start": 659.804,
        "end": 687.534
    },
    {
        "text": " It's almost like it has a mechanical throttle body with a throttle cable. Right. And it's coming out. There's a bit of smoke coming out where the spring is on the throttle body. I don't know if it's the throttle body shaft seal, maybe. Okay. But I don't know if that's normal as the smoke machine builds up pressure, but that's the only spot I got smoke coming out in the intake. Well, and smoke's a great way to go and good initiative, right? I like your thinking. Mm-hmm.",
        "start": 688.029,
        "end": 714.974
    },
    {
        "text": " So a smoke machine generates about a half a PSI in most cases, depends on what yours is. But a smoke machine test is only half the equation, all right? I'd still like to do it with propane. So what sort of propane setup do you have? Oh, it's just a generic camping, like, yeah, like a torch. Oh, okay. Tell you what, sit tight, Trevor. Let me pull over and take the pause. When we come back, we'll finish up. I'm Ron Ananian, The Car Doctor. We'll be back right after this.",
        "start": 714.974,
        "end": 744.804
    },
    {
        "text": " McBride Auto Body Shop in Woodland Park, New Jersey is the finest and oldest body shop in the county. For over 80 years and three generations, McBride's stellar reputation continues to this day. If your car, truck, or van needs to be repaired and you want the finest professional service, then your only choice is McBride Auto Body. And if you've been involved in an accident, McBride will also help with your insurance claim. Contact McBride for free estimates and for more information by visiting McBrideAutoBody.com.",
        "start": 766.664,
        "end": 796.664
    },
    {
        "text": " Julie Bach is the executive director of Wellness for Cancer, therapist and educator, improving the well-being for people touched by cancer. Julie is recognized for bridging the medical world with the world of wellness and beauty. Julie trains spas, wellness centers, and resorts worldwide to accommodate those with or recovering from cancer and their families and friends. To chat with Julie or for more information, visit W4Cancer.com.",
        "start": 796.664,
        "end": 824.667
    },
    {
        "text": " Clutter blocking your life? Now's the time to call Jenny, a compassionate professional organizer of C-Clear Organizing. Jenny will get your home ready to sell, or if you're moving, Jenny will help pack, unpack, and organize. She'll change your life. How do I know? Because Jenny is decluttering and organizing our home. After her first visit, our stress was completely gone. To clear out the clutter, visit C-C-E-E-ClearOrganizing.com.",
        "start": 825.572,
        "end": 853.882
    },
    {
        "text": " Hey, Polka fans, it's Nat the Cat inviting you to join me for an hour of Polka fun each and every Sunday morning. For the very best in polkas, waltzes, and obetics, join us at 10 a.m. for the Natalie Gabala Polka Fun Show Sundays, and it's all here on TBQ. WTBQ, yeah!",
        "start": 853.882,
        "end": 871.476
    },
    {
        "text": " Hey, we're back. Ron and Amy in the Car Doctor at 855-560-9900. The Car Doctor's 24-7 hotline. Travis, you're there.",
        "start": 884.07,
        "end": 890.674
    },
    {
        "text": " I am, sir. Okay. I want you to take your propane bottle, all right? And you've probably got like the little crank on black knob that turns on and off, like if you're going to light it to do plumbing work or light up a camping lantern, that kind of a thing. Right. Okay. So somehow you've got to nick that on. You've got to attach a black rubber hose or some sort of rubber hose to that. And then on the other end of that rubber hose, I want you to get a small piece of steel brake line, 316ths.",
        "start": 891.834,
        "end": 917.534
    },
    {
        "text": " And I want you to peen one end of that brake line down so it's just a point. So crush it flat. Typically what I'll do is I'll put it in a vice and I will peen it shut except for one little corner. I'm trying to make a pinpoint opening in the end of the brake line.",
        "start": 917.534,
        "end": 934.991
    },
    {
        "text": " All right. Now, when I open up the propane and I'm going to open it up slow, realizing that if something backfires, I've got a hand grenade in my hand. Right. OK. The dangers of auto repair, brother. All right. And I'm going to use that pinpoint like a wand and I'm going to direct it at specific things. And I can control the flow with the knob. I don't have to turn on a full just a little bit of a flow. Right.",
        "start": 935.845,
        "end": 957.483
    },
    {
        "text": " If you were to look at the O2 sensor by scan tool or voltmeter, whatever way you want to do it, can we agree that if you were able to get propane directly in that throttle shaft and it made a difference on how the O2 read, that it's making a difference on fuel trim?",
        "start": 957.773,
        "end": 971.732
    },
    {
        "text": " It should, yeah. Yeah? Right? Fuel trim is fuel trim. I mean, it doesn't know where the fuel or the air is coming from. So, you know, I want you to do that. That's the whole purpose of propane. Propane is not just in that big globular. If we were going to do massive amounts of propane like that, we might as well use carb clean from the 70s. All right? Right. The idea is, you know, propane can make a very pinpoint accurate diagnostic tool. All right?",
        "start": 973.217,
        "end": 998.404
    },
    {
        "text": " I want you to get a yellow notepad and just eliminate things. I want you to check fuel pressure, if you can. I've done that, yep. Good. You wrote down your results?",
        "start": 998.404,
        "end": 1008.114
    },
    {
        "text": " Yeah, it was one PSI at curb idle over the spec, so I figured that was good enough. Take a look at the maps. Take a look at the map sensor. Key on, engine off. You should see four to four and a half volts. Start it up. You should see a volt, volt and a half, something like that, but just be specific. Propane the throttle body. Just make sure there are no vacuum leaks elsewhere. Leave the brake booster disconnected.",
        "start": 1009.121,
        "end": 1034.172
    },
    {
        "text": " All right? And then last, look around in the area of the O2 sensor. Any exhaust leaks, any exhaust leaks will skew that O2 and will contribute to a lean code. Do those things. Call me back. Until the next time, I'm Ron Ananyan, The Car Doctor. Good mechanics aren't expensive. They're priceless. See ya. And now, more of the best music, WTVQ.",
        "start": 1034.172,
        "end": 1063.865
    },
    {
        "text": " I got you.",
        "start": 1101.254,
        "end": 1102.295
    },
    {
        "text": " This is karma's gonna get you Gonna knock you off your feet Better recognize your brothers",
        "start": 1148.268,
        "end": 1158.012
    },
    {
        "text": " Thank you.",
        "start": 1261.067,
        "end": 1280.094
    },
    {
        "text": " Seems a little faster All my friends They say go on up and ask Love like yours Surely come my way Oh, every day Seems a little stronger And every day Fast and little more",
        "start": 1287.278,
        "end": 1313.524
    },
    {
        "text": " and every day seems a little closer going faster than a roller coaster love like yours surely",
        "start": 1325.469,
        "end": 1338.592
    },
    {
        "text": " Every day Every day it seems a little stronger No, it lasts a little longer Come what may",
        "start": 1367.261,
        "end": 1383.166
    },
    {
        "text": " Bye. Bye.",
        "start": 1393.797,
        "end": 1406.715
    },
    {
        "text": " Thank you.",
        "start": 1427.875,
        "end": 1428.524
    },
    {
        "text": " She was a showgirl with yellow feathers in her hair And a dress cut down to there She would merengue and do the cha-cha And while she tried to be a star Tony always tended bar across the crowded floor They worked from eight till four They were young and they had each other Who could ask for more? At the Copa, Copa Cabana",
        "start": 1469.855,
        "end": 1497.551
    },
    {
        "text": " The hottest spot north of Havana. Here at the Copa. Copa Cabana. Music and passion were always the fashion at the Copa. They fell in love.",
        "start": 1498.558,
        "end": 1515.486
    },
    {
        "text": " His name was Rico. He wore a diamond. He was escorted to his chair. He saw Lola dancing there. And when she finished, he called her over. But Rico went a bit too far. Tony sailed across the bar. And then the punches flew. And chairs were smashed in two. There was blood and a single gunshot. But just who shot who at the Copacabana?",
        "start": 1522.944,
        "end": 1550.503
    },
    {
        "text": " The hottest spot north of Havana Here at the Copa Copacabana Music and passion were always the fashion at the Copa She lost her love",
        "start": 1550.503,
        "end": 1570.179
    },
    {
        "text": " Her name is Lola, she was a showgirl But that was thirty years ago When they used to have a show Now it's a disco, but not for Lola Still in the dress she used to wear Faded feathers in her hair She sits there so refined And drinks herself half blind She lost her youth and she lost her Tony Now she's lost her mind",
        "start": 1605.794,
        "end": 1630.708
    },
    {
        "text": " The hottest spot north of Havana, here at the Copa, Copacabana. Music and passion were always the fashion at the Copa. Don't fall in love, bud.",
        "start": 1635.06,
        "end": 1653.507
    },
    {
        "text": " Celebrating 30 years, playing the best music. From ABC News.",
        "start": 1676.954,
        "end": 1688.882
    },
    {
        "text": " I'm Brian Clark. 60% of Democrats in an ABC News Ipsos poll say President Biden should get out of the race, as the polls reflect the state of the race after the assassination attempt on former President Trump and his nomination at the Republican National Convention. ABC political director Rick Klein says...",
        "start": 1689.428,
        "end": 1707.824
    },
    {
        "text": " A poll with Ipsos picking up a definite bounce for Donald Trump in the wake of his convention and the assassination attempt. His approval rating up to 40 percent. That's up sharply since a month ago. It's also the highest it's been in four years. It's still not great, but it's certainly significantly better than it was. And meanwhile, Joe Biden's approval rating about where it has been for a long time in the low 30s. As a potential replacement, Vice President Harris viewed slightly more favorably than Biden. The former president talked about the intrigue on the campaign trail.",
        "start": 1707.824,
        "end": 1737.261
    },
    {
        "text": " Sort of interesting. This guy goes and he gets the votes and now they want to take it away. That's democracy. They talk about democracy. Biden has resisted calls to leave the race. The former president was in Grand Rapids, Michigan. It was his first rally since the shooting at a rally in Butler, Pennsylvania, last Saturday. The Secret Service continues to face scrutiny. Director Kim Cheeto will testify tomorrow before the House Oversight Committee, says ABC's Christian Cordero.",
        "start": 1737.261,
        "end": 1761.032
    },
    {
        "text": " The Secret Service is responding to a Washington Post article accusing them of denying requests for more security at Trump events in the two years before the shooting. The Secret Service says that in some cases, when specific requests were not met, adjustments were made to, quote, accommodate security needs. Nearly 700 Delta and United flights canceled today. Airlines continuing efforts to recover from Friday's global computer outage. This woman got stuck in Atlanta en route to vacation in Key West.",
        "start": 1761.032,
        "end": 1788.814
    },
    {
        "text": " We had like three different, two different flights, three different flights we were supposed to get on, and they all were canceled. We actually got on one flight. We sat down, and the guy came over to the loudspeaker and said, this is going to be canceled. You're listening to ABC News. This is the story of the one. As head of maintenance at a concert hall, he knows the show must always go on. That's why he works behind the scenes, ensuring every light is working, the HVAC is humming,",
        "start": 1788.951,
        "end": 1816.271
    }
]