[
    {
        "text": " civics class there, and they were explaining, okay, and see, John, if we survive all this, if all this comes down and we don't have a civil war, you know, because even Trump himself says we may not be able to survive, we may not last until November election, okay? Yeah, he did say that, Mr. Ernie, he did. Yeah. Now, tactical civics is something that",
        "start": 0.009,
        "end": 26.578
    },
    {
        "text": " And once in place, after this, if we survive this, then it's a way of taking the government away from the crooks, the bureaucrats, and again, the...",
        "start": 27.039,
        "end": 37.961
    },
    {
        "text": " That's through legitimate constitutional grand juries. We have one of the forms here, a petition that you present to be a candidate to be on the grand jury, to be called. So go ahead and go and read that application there.",
        "start": 39.275,
        "end": 57.193
    },
    {
        "text": " An ordinance providing for citizens to volunteer for grand jury and assuring that the county court shall call for a grand jury when the people so demand in the county municipality.",
        "start": 58.046,
        "end": 70.179
    },
    {
        "text": " So the short title is county ordinance of grand jury preamble. We, the name of the county and the parish or borough plus the state in pursuance of our oaths to uphold the constitutions of our state and of the United States and of our duty to our community under divine law hereby secure the fundamental right and authority of our citizens to volunteer for grand jury service within this county.",
        "start": 72.278,
        "end": 99.667
    },
    {
        "text": " Article 1, justification, whereas in the preamble to the Constitution for the United States, the American people declare that we the people do ordain and establish this Constitution, thus clearly establishing that the people collectively occupy the highest sovereignty over all American government, and whereas the United States Supreme Court in Chisholm v. Georgia states,",
        "start": 100.384,
        "end": 124.138
    },
    {
        "text": " affirm that the people are sovereign at the revolution, the sovereignty devolved on the people, and they are truly the sovereigns of the country, equal as fellow citizens and as joint tenants in the sovereignty, and whereas in Amendment 10 of the U.S. Constitution we state that",
        "start": 125.265,
        "end": 143.439
    },
    {
        "text": " peri materia with the preamble that we the people as well as the state governments that we elect to represent us retain all powers not specifically enumerated by us in the U.S. Constitution and whereas the grand jury along with the militia are the two ancient and pre-constitutional institutions intended and stipulated by the U.S. Constitution to maintain our rule of law and to execute that and all other laws in our republic",
        "start": 143.439,
        "end": 171.869
    },
    {
        "text": " And whereas if our state enacts any statute that violates or is repugnant to the U.S. Constitution, that state law is null and void ab initio. And whereas no state legislature can sideline or outlaw the grand jury institution or impair its functionality,",
        "start": 171.869,
        "end": 191.408
    },
    {
        "text": " as it remains an independent institution of the people predating the U.S. Constitution, but demanded thereby, and whereas Rule 6 of the Federal Rules of Criminal Procedure stipulate,",
        "start": 191.408,
        "end": 204.053
    },
    {
        "text": " When the public interest so requires, the court must order that one or more grand juries be summoned, and whereas in times of corruption and lack of public confidence, the public must be the sole determinant of its own interest rather than public employees deciding what is the public interest, and whereas different county and state governments observe a variety of protocols allowing or disallowing",
        "start": 204.292,
        "end": 228.831
    },
    {
        "text": " the citizens to place their names on a volunteer roster for grand jury service. Article two, now therefore be it resolved that the board commission of this county hereby orders that within this jurisdiction, any citizen and resident who has not been convicted of a felony who applies to be placed on a standby roster for grand jury duty shall be placed on that roster by the county clerk. And for any given reason,",
        "start": 229.309,
        "end": 258.643
    },
    {
        "text": " occasion or right requiring seating of a grand jury all names on the volunteer standby roster shall be added to any other list used as a source of names for random jury selection and from this aggregated list grand jurors shall be selected truly at random in no particular order nor assigned to any particular case or grand jury target",
        "start": 259.94,
        "end": 283.2
    },
    {
        "text": " and each random selection session of grand jurors by county clerk staff shall be witnessed in person by a three-member committee of this governing body to assure that the process is uncorrupted by any staffer or potential grand jury target or the target's minions, contractors, or associates, and if any judge in our jurisdiction shall refuse to call for a grand jury venue,",
        "start": 283.302,
        "end": 308.268
    },
    {
        "text": " When demanded by petition signed by a number of county residents equal to or greater than half of 1% of the number of ballots cast in the prior county election, this representative body shall seek for the State Court of Appeals or Supreme Court a writ of...",
        "start": 308.626,
        "end": 325.367
    },
    {
        "text": " Mandamus compelling drawing of a veneer of the appointment of an alternate judge to call for such grand jury to grant relief to the community and the county shall make a page or pages available on its Web site or prominently post their links for county grand jury education, information, volunteer application.",
        "start": 325.657,
        "end": 347.039
    },
    {
        "text": " with the county clerk and for citizens to submit legitimate complaints of possible crimes and calls for a grand jury if a panel is not sitting at that time article three miscellaneous provisions severability if any section part or provision of this ordinance is declared unconstitutional or invalid by a court of competent jurisdiction",
        "start": 347.039,
        "end": 370.572
    },
    {
        "text": " then it is expressly provided and it is the intention of the name of county board or commission in passing this ordinance that its parts shall be severable and all other parts of this ordinance shall not be affected thereby and they shall remain in full force in effect. Effective date, the ordinance shall take effect immediately upon its passage ordained by the name of the county board or commission, county and state. Okay, so what does that mean there, John?",
        "start": 370.845,
        "end": 398.336
    },
    {
        "text": " He's telling you that a grand jury – we're talking about a legitimate grand jury of the people. Okay, this is government of the people, by the people. Okay, these are the sovereign. Now, he's telling you that when somebody brings a complaint to the grand jury, the sitting grand jury, that they –",
        "start": 400.077,
        "end": 419.104
    },
    {
        "text": " Not even the judges are told because, you know, it could be that even the judge might be the target of this complaint. And so what the grand jury does is they look into it, they investigate it, and then they tell the prosecutor, okay, not the prosecutor coming into the grand jury and telling them what they can and cannot do or what they should and should not do,",
        "start": 419.616,
        "end": 445.896
    },
    {
        "text": " And then they tell the prosecutor, and then that goes, the case will go before the judge. So it's going back, again, to the way it was before everything was changed. They took and they polluted, they destroyed, they corrupted the grand jury, and they corrupted the standing militia.",
        "start": 446.084,
        "end": 467.927
    },
    {
        "text": " according to the Second Amendment. And so that's what we're trying to do. That's why it's growing all across America. If we should have time, if we don't lose, if we don't have a civil war, if we don't have one of these things happen to us, and we should win and we should actually have an election,",
        "start": 468.217,
        "end": 489.787
    },
    {
        "text": " And we should actually get Trump back into the White House and get a legitimate attorney general, get a legitimate head of the FBI. And we're going to have to purge them and then actually place people back in the military, actual people.",
        "start": 490.111,
        "end": 507.824
    },
    {
        "text": " you know, real soldiers, not what Obama did. Not woke snowflakes. Not woke snowflakes and get rid of all those trans things, those... Milley and his garbage. Milley and Austin. Austin. And so, anyhow...",
        "start": 508.558,
        "end": 528.268
    },
    {
        "text": " If that happens, then we need a system put in place, and that's what Tactical Civics does. It puts the system back in place where it's government of the people, by the people, for the people. No more the corrupted politicians. Honor and duty. So we unincorporate our federal government. So what do you think of all that, John? All right. That's our goal.",
        "start": 528.814,
        "end": 556.63
    },
    {
        "text": " There you go. You know, Maricopa County, I don't think there's anything in that county that's not corrupted. It's amazing, Pastor Henry. Yeah, here's a... I mean, every day you pick up, there's a new one. Temporary election worker in Maricopa County arrested for stealing security fob and keys from tabulation center was registered Democrat who filed papers to run for the Senate. Previously charged with other crimes...",
        "start": 557.91,
        "end": 586.271
    },
    {
        "text": " And now concerning details have been emerged about the theft of the five of the Maricopa County Tribulation. They say that in that county, you could have had anywhere as much as a half a million votes because it's a huge, huge county that were illegal, that were illegitimate. And so that's amazing. Katie Hobbs.",
        "start": 586.817,
        "end": 611.084
    },
    {
        "text": " Whatever they need, and I fall back on Pennsylvania. That's the clearest one because I went to bed that election night about 1 in the morning, maybe even later, and Pennsylvania, Trump was winning by 300,000 with 98% of the vote counted. And I said, well, that's it. There's no numbers there.",
        "start": 611.51,
        "end": 638.729
    },
    {
        "text": " There isn't enough numbers for Biden to win. So I woke up in the morning and Trump is behind by like 30 or 40, I think it was 30,000. So during the night, they pumped in like 350,000 votes. And that was, no one's supposed to question it. No one, I mean, you know, and evidence there, you had truck drivers, truck drivers saying he delivered these votes.",
        "start": 639.189,
        "end": 667.978
    },
    {
        "text": " They were printed in New York? I saw the truck driver. He had a semi-filled. Yeah. Yeah, and they tried to discredit him. Oh, yeah, the FBI went after him. Yeah. Wasn't it Philadelphia they were covering the windows? That's the earnings. That was Detroit, Michigan, yeah. In Pennsylvania, they pumped in like 350,000 votes, right? Yeah. Like one of them had to be provided.",
        "start": 668.285,
        "end": 697.142
    },
    {
        "text": " Don't you get, like, how about 10% or 20% for Trump? If he gets 20%, Biden loses Pennsylvania. I mean, doesn't that sound odd, that 300 and something thousand votes? Are they all for Joe Biden? In Michigan, they actually had a truck come in, a box truck,",
        "start": 697.892,
        "end": 719.531
    },
    {
        "text": " The guy opened the back, and written right on the boxes were Biden ballots. These were all fake, phony Biden ballots. They were printed in Long Island, New York. Yeah. And they loaded the truck up, and he drove it to, I think he said Lancaster. And he told the FBI what he saw, and they wanted to charge him. Yeah.",
        "start": 719.974,
        "end": 745.794
    },
    {
        "text": " That's exactly rampant fraud. You understand my thinking in it, Pastor Ernie? If 350,000 votes come in and you need 3,000 to get equal with Trump, but you want to get extra in there, those 300,000 shouldn't, we'll say, 30% go to Trump and we'll say 70% to Biden. But Trump has to get a certain percentage, but he got none.",
        "start": 747.619,
        "end": 776.288
    },
    {
        "text": " Well, see, that's one of the things. They were so blatant. They were so blatant. It was like in your face, like when they flipped everything, right? While we were watching the results we received, Trump's way ahead one minute. All of a sudden, everything's flipped right in front of us. And then Brett Baer says, where's the evidence? I just, we saw it. We were watching it, okay? And so, well, here's a good example. You know, here...",
        "start": 776.493,
        "end": 804.48
    },
    {
        "text": " The must-read of the day, Liz Harrington on how Georgia was stolen. Liz Harrington, longtime spokesperson for President Donald Trump's campaign, published a must-read analysis of the 2020 stolen Georgia election on the War Room Wednesday. This is the most comprehensive investigative piece of the fraudulent election in Georgia to date.",
        "start": 804.701,
        "end": 828.49
    },
    {
        "text": " There's no way you can read through the analysis and not believe that Georgia was stolen from President Trump in 2020. It took numerous dishonest individuals to make this happen. On noon on December 3rd, 2020, Richard Barron had a problem.",
        "start": 828.49,
        "end": 847.722
    },
    {
        "text": " The 2020 presidential election results already declared by the deep state to be the most secure in American history had just undergone a machine recount in Georgia, Fulton County, and was meeting to certify the results in less than 24 hours. And then the elections director was more than 17,000 votes short.",
        "start": 849.275,
        "end": 872.5
    },
    {
        "text": " So Joe Biden, despised corrupt career politician who had been running for president and failing spectacular since 1987, allegedly received the most votes of a president in U.S. history, yet simultaneously could only sneak up in Georgia by some 13,558 votes. It didn't add up. It just didn't add up. And neither did the numbers in Fulton County.",
        "start": 873.49,
        "end": 898.507
    },
    {
        "text": " The first machine count that dragged on for days after November 4th, the day of Secretary of State Board Raffensperger, this guy, Raffensperger, that guy is corrupt. Oh, yes, he promised, that's where we go back to the gifts. What was the gift he got? Promised the counting would be finished, and President Trump was over, 130,000 vote lead was insurmountable.",
        "start": 898.968,
        "end": 927.329
    },
    {
        "text": " The 17,234 votes Fulton County had to come up with were important. The recount was concluded on the Wednesday night.",
        "start": 928.148,
        "end": 938.575
    },
    {
        "text": " December 2nd, Barron said that the Fulton Election Board meeting to certify the results, we submitted our results, and then yesterday the state allowed us to do reconciliation. The results all changed then. This was an understatement. When you have a problem like a 17,000 vote discrepancy in an election, you're claiming that decided by less than 13,000 votes,",
        "start": 938.763,
        "end": 965.179
    },
    {
        "text": " Who do you call? Well, the elections group, of course, they seem to pop up everywhere, out of nowhere. In 2020, setting up drop boxes, training election officials in Madison, Wisconsin, programming the machines in Maricopa County, Arizona. Its members briefing CESA on how to protect 2020 project and protect it from whom.",
        "start": 965.282,
        "end": 991.067
    },
    {
        "text": " Barron sent an email to Ryan Macias of the election group at 12.13 p.m. There was no subject and nothing in the body of the email, only a file attached in a very important file entitled Batches Loaded Report.",
        "start": 991.544,
        "end": 1010.145
    },
    {
        "text": " Three and a half years after the email was sent, the Georgia State Election Board heard the results of the investigation in the recount and confirmed Fulton County violated election rules. The evidence brought up by independent investigators showed over 20,000 ballots were inserted into both the original results and the second machine count out of thin air. They just came up with 20,000 new ballots out of thin air.",
        "start": 1010.862,
        "end": 1039.65
    },
    {
        "text": " Simply put, Fulton County did not have the proper ballots to justify their original results, and they got caught. I mean, it goes on and on. I mean, and that happened all over the place, John. Well, remember the phone call that President Trump made to the governor of Georgia? Yeah. And he said that at that time, Trump lost Georgia by 14,000 votes.",
        "start": 1040.247,
        "end": 1070.094
    },
    {
        "text": " But they had found out that there was like 30,000 or 40,000 people underage voted, criminals voted. John, I'm going to have to break in because, you know what, I just noticed the time. You have, would you do this, would you read that prayer that you wrote? Do you have that? Yes, Pastor Ernest. Would you read that? Because we have just, how much time do I have there, John? Six minutes. You've got six minutes. Okay, Pastor Ernest.",
        "start": 1070.776,
        "end": 1100.179
    },
    {
        "text": " Yeah, this is a—and I just want to give a little background on it, and then I'll read it. I follow the outpourings of—the great outpourings of the Holy Spirit that shook America. And there was one in 1800, and three small churches got together with one pastor. Pastor McCready was his name. And they wrote a covenant, prayer covenant to the Lord, and they—for a year—",
        "start": 1100.572,
        "end": 1126.476
    },
    {
        "text": " They prayed this covenant, and the Lord sent the great outpouring of the Holy Spirit. So I thought, why don't we do it again? And it's really picked up. There are thousands of churches praying this prayer that I wrote. So it's titled, Cry unto the Lord Prayer Covenant. It's for the United States, but it's actually going all over the world now. Abba Father, we come before you in the precious name of the Lord Jesus, understanding the hour in which we live",
        "start": 1126.8,
        "end": 1156.783
    },
    {
        "text": " We see the day of the Lord approaching and we are crying out to you according to your word. We cry out in repentance for our sins and the sins of our nation. We cry out for an outpouring of the Holy Spirit. We realize that time is short before the Lord Jesus comes for his bride. But according to your word, the outpouring of the Spirit will continue until he comes. Okay, hang on, please.",
        "start": 1157.295,
        "end": 1183.985
    },
    {
        "text": " We are humbled before you with the manifest sins of our nation, including how this offends, recognizing how this offends your holiness. By faith, we are asking for one more outpouring, both to win untold numbers of souls for the Lord Jesus and hold back the terrible spirit of Antichrist. With this mighty outpouring, we ask for the healing of the brokenhearted, the outpouring of the opening of prison to them that are bound, and the setting at liberty of",
        "start": 1185.162,
        "end": 1213.541
    },
    {
        "text": " Abba, free us completely from the spirit of bondage and fear and fill us with power, love, and a sound mind. Free us completely of unbelief and have us grow mighty in faith to please you. In the past, you sent many great outpourings of the Holy Spirit, and we are asking our Abba for one more before the groom comes for his bride. The church was birthed with the power of the Holy Spirit, and we want to go with you.",
        "start": 1213.916,
        "end": 1243.336
    },
    {
        "text": " in that same power. The great outpouring first came to Jerusalem, and we beseech you for another great outpouring of your spirit upon your people Israel like you first sent 2,000 years ago. Abba, Father, we love you as little children and believe the word with the same faith as children. We know when we ask our Abba that he hears us. Father, as the end grows near, it's like the days of Noah. To protect us from the wicked ones and from the love of the world",
        "start": 1243.626,
        "end": 1273.575
    },
    {
        "text": " We come under the power and authority of your word and your name. We are growing close to you for protection and asking that you heal all the broken hearts of your people, along with freeing us from bondage so that the bride is ready for the groom. Amen. Amen. Thank you, John. That was a very, very good prayer. Thank you very much.",
        "start": 1273.968,
        "end": 1298.456
    },
    {
        "text": " We're coming to the end of the program today, and I want to, again, tell the folks out there, we need to continue to pray for America, pray for this. You know, there's much, much power in prayer. People will only believe it and do it. We can turn America back. We're already seeing signs of good things happening. We're seeing signs of revival popping up here, popping up there.",
        "start": 1299.07,
        "end": 1324.394
    },
    {
        "text": " We saw what happened in Tennessee. We saw. Louisiana, Ten Commandments. Oklahoma now. Yeah. And it looks like, again, America, we're trying to bring it back. We've seen what the Democrats have tried to take us. Like the Bible says, all nations that forget their God will be turned into hell, and they're trying to turn America into hell. The Democratic Party has become completely corrupt, anti-Christ.",
        "start": 1324.616,
        "end": 1352.944
    },
    {
        "text": " Satanism is the fastest-growing religion now in the country, and more and more Democrats are choosing the Church of Satan for their church, for their religion now. That's happening. And it's just exactly like God's Word of the Bible said when he told you that in the last days you would see these things. So we're seeing it. We're right on schedule. Like they say, things aren't falling apart. They're actually falling right into place.",
        "start": 1353.439,
        "end": 1379.616
    },
    {
        "text": " And so we're coming. How much time do I have there? One minute. All right. So we're at that point in America where it's now or never. We've got to stand. We've got to take our country back. And, again, if the Lord tells us, 2 Chronicles 7, 14, it's for real if you believe it, and we have real repentance.",
        "start": 1380.094,
        "end": 1409.377
    },
    {
        "text": " Thanks for being here, John. You've done good, young fella. Well, I've had a good coach. I've had a good coach, Mr. Ernie, all these years. Well, we're out of time, so now we've got to say goodnight. Say goodnight. God bless. God bless. And then we always come to that. And thanks for being here, folks, where we always say, and always, always, always, always. You ready?",
        "start": 1409.684,
        "end": 1438.66
    },
    {
        "text": " Keep fighting the fight.",
        "start": 1439.855,
        "end": 1447.927
    },
    {
        "text": " Thanks for listening to the Voice of the Christian Resistance, What's Right, What's Left, hosted by Pastor Ernie Sanders. To learn more about our ministry, please visit us online at www.wrwl.org. Please tune in next time for another edition of What's Right, What's Left. The preceding program is sponsored by What's Right, What's Left Ministries and is responsible for its content.",
        "start": 1452.705,
        "end": 1479.48
    },
    {
        "text": " This is the Talk of the Town, 97.7 FM and AM 1570, WHTX and W249EE, Warren. This is a Fox News alert, presidential immunity. I'm Therese Crowley, Fox News. The Supreme Court end-of-term decision on Donald Trump's claim of presidential immunity in his election interference case. Trump calls it a big win for democracy. Fox's Shannon Bream with the ruling.",
        "start": 1484.889,
        "end": 1512.961
    },
    {
        "text": " The nature of presidential power entitles a former president to absolute immunity from criminal prosecution for actions within his conclusive and preclusive constitutional authority. He is entitled to at least presumptive immunity from prosecution for all his official acts. There is no immunity for unofficial acts.",
        "start": 1512.961,
        "end": 1530.794
    },
    {
        "text": " Now the lower court will have to go back and sort out special counsel Jack Smith's election interference charges against Trump with an eye to official and unofficial acts. Legal scholars say it'll at least slow down Smith's prosecution. And Trump says, now I'm free to campaign like anyone else.",
        "start": 1530.794,
        "end": 1547.056
    },
    {
        "text": " The Biden family is reportedly pressuring President Biden to stay in the presidential race, casting blame for his last presidential debate performance on his senior advisors, even those who've been with him 25 years. Fox's Madeline Rivera on the Biden family weekend at Camp David.",
        "start": 1547.056,
        "end": 1562.978
    },
    {
        "text": " Politico says the blame was cast widely on staffers, including Anita Dunn, the senior advisor who frequently has the president's ear, her husband, Bob Bauer, the president's attorney who played Trump in rehearsals at Camp David, and Ron Klain, the former chief of staff who ran point on the debate prep and previous cycle sessions.",
        "start": 1562.978,
        "end": 1580.503
    },
    {
        "text": " Meantime, billionaire Bill Ackman, who's been a vocal critic of President Biden, pointing fingers at someone else, the first lady. Now, if the president were replaced at the top of the Democratic ticket, the process would be messy. NBC reports, for people familiar with the talks, most of the campaign's significant war chest would fall to Vice President Kamala Harris. Democrat Senator John Fetterman tells Fox. One debate does not define a person's record or the kind of person or the situation. There was that same kind of a freak out after my debate.",
        "start": 1580.503,
        "end": 1609.292
    },
    {
        "text": " America is listening to Fox News.",
        "start": 1609.428,
        "end": 1612.21
    },
    {
        "text": " Eric was way behind on his taxes. I owed a lot of money to the IRS, almost $15,000. I tried to make payments. The IRS wasn't satisfied with Eric's efforts, so they came after him full force. They're coming to put a lien and a hold on all my income, my home, my car. I was just overwhelmed at what to do. Then Eric called Optima Tax Relief. When Optima Tax got involved, the cars would stop, the threats would stop. It was easy like...",
        "start": 1615.469,
        "end": 1641.903
    },
    {
        "text": " One, two, three. Optima Tax Relief is A-plus rated by the Better Business Bureau, and their team of expert tax professionals took care of Eric's problem. I owe $15,000, and now my debt is clean. I don't owe anything. Take Eric's advice. If you have a tax problem, you need to call Optima Tax now. Call Optima Tax Relief for a free consultation. Call 800-968-9022. 800-968-9022. 800-968-9022. Optima Tax Relief.",
        "start": 1641.903,
        "end": 1671.664
    },
    {
        "text": " Some restrictions apply. For complete details, please visit OptimaTaxRelief.com. This commentary. Democrats are getting ready to dump Joe Biden. He just hasn't accepted it yet. I'm Tomi Lahren. More next.",
        "start": 1672.483,
        "end": 1682.415
    },
    {
        "text": " Gold demand is hitting record highs, but supply may not keep up. I'm Dr. Ron Paul, and I believe physical gold is the only way to truly protect your retirement savings from a chaotic world. To learn how to diversify your IRA or 401k into physical precious metals, text the word SHELTER to 989898 for a free info kit on gold IRAs from Birch Gold Group. That's SHELTER to 989898. Message and data rates may apply.",
        "start": 1683.49,
        "end": 1713.353
    },
    {
        "text": " Trump's presidential debate was a complete disaster for Joe Biden. No one who watched it can say otherwise, and even Democrats won't try to. There are numerous reports the Democrat Party is in panic mode after that horrible performance, but I don't buy it. Anyone who has watched and listened to President Biden in the last two years plus knows he is slipping fast. The pundits and Biden surrogates have tried to pass it off as cheap fakery, but they owe us all an apology. While some are giving those CNN moderators a lot of credit, I don't.",
        "start": 1714.07,
        "end": 1740.538
    },
    {
        "text": " because it was all part of the plan. They didn't throw Joe a lifeline because, as I've been saying, nobody wants Joe Biden. So the moderators simply allowed him to sink. It wasn't because the CNN moderators suddenly have a vested interest in fairness. It's because they wanted Joe to fail in front of the world. Everybody does. That's why for the Democrat Party and their surrogates, it's bait and switch time. I'm Tomi Lahren, and you can watch my show, Tomi Lahren is fearless at Outkick.com.",
        "start": 1740.538,
        "end": 1764.77
    },
    {
        "text": " Here's your latest weather forecast from the talk of the town, 97.7 FM and 1570 AM. For today, we'll have sunny skies with highs in the mid-70s. For tonight, we'll have clear skies with a low near 50. Tuesday, it'll be sunny with highs in the lower 80s. Tuesday night, it'll be partly cloudy with a low in the mid-60s. Wednesday, it'll be mostly sunny with the chance of afternoon thunderstorms with a high near 90. Wednesday night, we'll have showers likely with a low near 70. And for the 4th of July on Thursday, we'll have a chance of showers with highs in the mid-80s.",
        "start": 1764.77,
        "end": 1794.206
    },
    {
        "text": " Serving the tri-state area for over 40 years, Wallady Water Systems has been the name folks have trusted for all their water needs. From the well to your faucet, Wallady Water Systems is the name to call",
        "start": 1795.316,
        "end": 1805.811
    }
]