[
    {
        "text": " You're right. That's called the Murphy decision, right? Murphy versus Missouri design, which allowed the Biden regime to continue censoring conservative publications online throughout coercive demands on social media companies. Example, Pastor Ernie, was they were telling all the main media there to block any type of...",
        "start": 0.009,
        "end": 29.343
    },
    {
        "text": " posts about the 2020 election being stolen and also about the dangers of the COVID shot, that was to be blocked. And they certainly, well, they took me off the air because of that. Not off the air, but, well, yeah, I was taken off Facebook, not Facebook, YouTube. I'm permanently banned. I'm sent to Siberia.",
        "start": 30.35,
        "end": 59.514
    },
    {
        "text": " by YouTube because I was mostly about COVID-19. They went back months to get me. I was purging everything out because I knew what they were doing. They went back months and months and months to get me and throw me off of YouTube. They took me down off YouTube too.",
        "start": 60.179,
        "end": 79.206
    },
    {
        "text": " Every now and then, one of my messages, they'll play one, but it's way back before COVID. It's, you know, the ones that go back to 2012 or whatever. They'll pop up and they'll play. But they took me down off there, too. And behind all that was the feds. The federal government was behind all that, the FBI. So why did...",
        "start": 79.735,
        "end": 107.551
    },
    {
        "text": " cavanaugh go along with it do we know no i have no idea about cavanaugh i think it's been i don't know if there's really any comments about him it was all about paris so why did they highlight her because it was six to three so cavanaugh and probably because she's gone on so many other things she's gone with the other side",
        "start": 107.739,
        "end": 132.551
    },
    {
        "text": " Well, we've got five good ones, supposedly. Alito, Thomas, Kavanaugh, Gorsuch, Coney Barrett. That's five. Who are the other... No, no, you have... Also, Roberts is supposed to be... Well, I count him as a... Well, you can look. You've got three. You've got three. That's what you have.",
        "start": 132.944,
        "end": 160.64
    },
    {
        "text": " Thomas Alito and Gorsuch. Right. Pastor Ernie, I told you about Barrett getting that $3 million book deal. Yeah. At the same time, they announced they were doing a book deal with Barr, and they wouldn't list the amount. They wouldn't give the amount.",
        "start": 160.794,
        "end": 182.176
    },
    {
        "text": " Yep. What did we just read out of Proverbs? Those that get gifts, huh? Right, yeah. Well, what an ingenious way to bribe someone. Up front, hey, we're going to... Barrett, why in the world she hasn't done anything? What kind of book are you going to write about it? Well, she's going to get a $3 million book deal, and Barr is going to get $6 million.",
        "start": 185.179,
        "end": 211.186
    },
    {
        "text": " But what a way to pay him off, Pastor Ernie. Out front, we got this book deal. What a way to pay a bribe. I hear you.",
        "start": 211.613,
        "end": 220.93
    },
    {
        "text": " I've got to get the announcement there. Doers of the Word, people want me to tell them about the church in about an hour or so. Doers of the Word, Baptist Church. We start, well, this will be the last week that we start Bible study at 8.30. Starting next week, it goes, we're going to start from 9.30 to 10.30. From 9.30 to 10.30. Starting next week. But this Sunday is still from 8.30 to 9.30. In the morning, the Bible study. And then at 11...",
        "start": 221.852,
        "end": 251.135
    },
    {
        "text": " We do the morning service, and then normally we have at 4 o'clock, we have a class that is the Bible and current events, things that are happening, what's out there today, and then at 5 p.m. we do the evening service.",
        "start": 251.988,
        "end": 272.432
    },
    {
        "text": " And so that's the doers of the word, 14781 Sperry Road. That's 14781 Sperry Road, Newberry, Ohio, 44065. Now, if you have questions, the phone number there is 440-338-1367. That's 440-338-1367 or 440-",
        "start": 272.432,
        "end": 298.797
    },
    {
        "text": " three three eight one zero three six that's four four zero three three eight one zero three six now uh we have tonight tonight we had a tactical civics class there and they were explaining okay uh and see john if we survive all this",
        "start": 299.07,
        "end": 318.677
    },
    {
        "text": " If all this comes down and we don't have a civil war, you know, because even Trump himself says we may not be able to survive, we may not last until November election. Yeah, he did say that, Mr. Ernie. He did. Yeah. Now, tactical civics is something that, and what's in place after this, if we survive this, then it's a way of taking the government away from the crooks, the bureaucrats.",
        "start": 318.677,
        "end": 348.677
    },
    {
        "text": " That's through legitimate constitutional grand juries. We have one of the forms here, a petition that you present to be a candidate to be on the grand jury, to be called. So go ahead and go and read that application there.",
        "start": 348.677,
        "end": 367.722
    },
    {
        "text": " An ordinance providing for citizens to volunteer for grand jury and assuring that the county court shall call for a grand jury when the people so demand in the county municipality.",
        "start": 368.456,
        "end": 380.691
    },
    {
        "text": " So the short title is county ordinance of grand jury preamble. We, the name of the county and the parish or borough plus the state in pursuance of our oaths to uphold the constitutions of our state and of the United States and of our duty to our community under divine law, hereby secure the fundamental right and authority of our citizens to volunteer for grand jury service within this county.",
        "start": 382.688,
        "end": 410.077
    },
    {
        "text": " Article 1, justification, whereas in the preamble to the Constitution for the United States, the American people declare that we the people do ordain and establish this Constitution, thus clearly establishing that the people collectively occupy the highest sovereignty over all American government, and whereas the United States Supreme Court in Chisholm v. Georgia declares",
        "start": 410.794,
        "end": 434.497
    },
    {
        "text": " affirm that the people are sovereign at the revolution the sovereignty devolved on the people and they are truly the sovereigns of the country equal as fellow citizens and as joint tenants in the sovereignty and whereas in amendment 10 of the u.s constitution we state",
        "start": 435.657,
        "end": 453.797
    },
    {
        "text": " pari materia with the preamble that we the people as well as the state governments that we elect to represent us retain all powers not specifically enumerated by us in the U.S. Constitution and whereas the grand jury along with the militia are the two ancient and pre-constitutional institutions intended and stipulated by the U.S. Constitution to maintain our rule of law and to execute that and all other laws in our republic",
        "start": 453.797,
        "end": 482.227
    },
    {
        "text": " And whereas if our state enacts any statute that violates or is repugnant to the U.S. Constitution, that state law is null and void ab initio. And whereas no state legislature can sideline or outlaw the grand jury institution or impair its functionality,",
        "start": 482.568,
        "end": 501.783
    },
    {
        "text": " as it remains an independent institution of the people predating the U.S. Constitution, but demanded thereby, and whereas Rule 6 of the Federal Rules of Criminal Procedure stipulate",
        "start": 501.783,
        "end": 514.616
    },
    {
        "text": " When the public interest so requires, the court must order that one or more grand juries be summoned, and whereas in times of corruption and lack of public confidence, the public must be the sole determinant of its own interest rather than public employees deciding what is the public interest, and whereas different county and state governments observe a variety of protocols allowing or disallowing",
        "start": 514.701,
        "end": 539.343
    },
    {
        "text": " the citizens to place their names on a volunteer roster for grand jury service. Article two. Now, therefore be it resolved that the board commission of this County hereby orders that within their jurisdiction, any citizen in resident who has not been convicted of a felony who applies to be placed on a standby roster for grand jury duty shall be placed on that roster by the County clerk. And for any given reason,",
        "start": 539.343,
        "end": 569.002
    },
    {
        "text": " occasion or right requiring seating of a grand jury all names on the volunteer standby roster shall be added to any other list used as a source of names for random jury selection and from this aggregated list grand jurors shall be selected truly at random in no particular order nor assigned to any particular case or grand jury target",
        "start": 570.35,
        "end": 593.268
    },
    {
        "text": " and each random selection session of grand jurors by county clerk staff shall be witnessed in person by a three-member committee of this governing body to assure that the process is uncorrupted by any staffer or potential grand jury target or the target's minions, contractors, or associates. And if any judge in our jurisdiction shall refuse to call for a grand jury venue,",
        "start": 593.712,
        "end": 618.473
    },
    {
        "text": " When demanded by petition signed by a number of county residents equal to or greater than half of 1% of the number of ballots cast in the prior county election, this representative body shall seek for the State Court of Appeals or Supreme Court a writ of mandamus, compelling drawing of a veneer of the appointment of",
        "start": 619.036,
        "end": 641.049
    },
    {
        "text": " an alternate judge to call for such grand jury to grant relief to the community and the county shall make a page or pages available on its website or prominently post their links for county grand jury education information volunteer application",
        "start": 641.425,
        "end": 657.193
    },
    {
        "text": " with the county clerk and for citizens to submit legitimate complaints of possible crimes and calls for a grand jury if a panel is not sitting at that time article three miscellaneous provisions severability if any section part or provision of this ordinance is declared unconstitutional or invalid by a court of competent jurisdiction",
        "start": 657.5,
        "end": 680.674
    },
    {
        "text": " then it is expressly provided and it is the intention of the name of county board or commission in passing this ordinance that its parts shall be severable and all other parts of this ordinance shall not be affected thereby and they shall remain in full force in effect effective date the ordinance shall take effect immediately upon its passage ordained by the name of the county board or commission county and state okay so what is what is that means there john",
        "start": 681.254,
        "end": 708.933
    },
    {
        "text": " He's telling you that a grand jury, we're talking about a legitimate grand jury of the people. This is government of the people, by the people. These are the sovereign. Now, he's telling you that when somebody brings a complaint to the grand jury, the sitting grand jury, that...",
        "start": 710.486,
        "end": 728.66
    },
    {
        "text": " They not even the judges are told because, you know, could be, um, that even the judge might be the target of this complaint. So, uh, and so what the grand jury does is they look into it, they investigate it, and then they tell the prosecutor, okay, uh,",
        "start": 729.138,
        "end": 748.916
    },
    {
        "text": " Not the prosecutor coming into the grand jury and telling them what they can and cannot do, what they should and should not do. And then they tell the prosecutor, and then that goes, the case will go before the judge. So it's going back again to the way it was before everything was changed. They took and they polluted, they destroyed, they corrupted the grand jury, and they corrupted the standing militia.",
        "start": 749.514,
        "end": 778.319
    },
    {
        "text": " according to the Second Amendment. And so that's what we're trying to do. That's why it's growing all across America. If we should have time, if we don't lose, if we don't have a civil war, if we don't have one of these things happen to us, and we should win and we should actually have an election,",
        "start": 778.626,
        "end": 800.111
    },
    {
        "text": " And we should actually get Trump back into the White House and get a legitimate attorney general, get a legitimate head of the FBI. And we're going to have to purge them and then actually place people back in the military, actual people.",
        "start": 800.52,
        "end": 818.541
    },
    {
        "text": " You know, real soldiers, not what Obama did. Not woke snowflakes. Not woke snowflakes and get rid of all those trans things, those... Millie and his garbage. Millie and Austin. Austin. And so, anyhow...",
        "start": 818.933,
        "end": 838.677
    },
    {
        "text": " If that happens, then we need a system put in place, and that's what Tactical Civics does. It puts the system back in place where it's government of the people, by the people, for the people, no more the corrupted politicians. Honor and duty. So we unincorporate our federal government. So what do you think of all that? All right. That's our goal.",
        "start": 839.224,
        "end": 867.261
    },
    {
        "text": " Here you go. You know, Maricopa County, I don't think there's anything in that county that's not corrupted. It's amazing. Yeah, here's a... I mean, every day you pick up, there's a new one. Temporary election worker in Maricopa County arrested for stealing security fob and keys from tabulation center was registered Democrat who filed papers to run for the Senate. Previously charged with other crimes.",
        "start": 868.285,
        "end": 896.715
    },
    {
        "text": " And now concerning details have been emerged about the theft of the file of the Maricopa County Tribulation. They say that in that county you could have had anywhere as much as a half a million votes because it's a huge, huge county that were illegal, that were illegitimate.",
        "start": 897.227,
        "end": 917.176
    },
    {
        "text": " And so that's amazing. Katie Hobbs. Whatever they need to. And I fall back on Pennsylvania. That's the clearest one. Because I went to bed that election night about 1 in the morning, maybe even later. And Pennsylvania, Trump was winning by 300,000 with 98% of the vote counted.",
        "start": 918.49,
        "end": 945.503
    },
    {
        "text": " And I said, well, that's it. There's no numbers. There isn't enough numbers for Biden to win. So I woke up in the morning and Trump is behind by like 30 or 40, I think it was 30,000. So during the night, they pumped in like 350,000 votes. And that was, no one's supposed to question it. No one, I mean, you know, and evidence there, you had truck drivers,",
        "start": 946.715,
        "end": 975.026
    },
    {
        "text": " I saw the truck driver. He had a semi filled. Yeah. And yeah. And they tried to they tried to discredit him. Yeah. Wasn't it Philadelphia? They're covering the windows. That was Detroit. They pumped in like three hundred and fifty thousand votes. Right.",
        "start": 975.418,
        "end": 1004.445
    },
    {
        "text": " Like, every one of them had to be for Biden. Don't you get, like, how about 10% or 20% to Trump? If he gets 20%, Biden loses Pennsylvania. I mean, doesn't that sound odd? That 300 and something thousand votes, are they all for Joe Biden? In Michigan, they actually had a truck come in, a box truck,",
        "start": 1004.718,
        "end": 1029.787
    },
    {
        "text": " The guy opened the back and right in Britain, right on the boxes were Biden ballots. These were all fake Biden ballots. They were printed in Long Island, New York. Yeah. And they loaded the truck up and he drove it to, I think he said Lancaster. And he told the FBI what he saw. And they wanted to charge him. Yeah.",
        "start": 1030.384,
        "end": 1056.425
    },
    {
        "text": " That's exactly rampant fraud. You understand my thinking in it, Pastor Ernie? If 350,000 votes come in and you need 3,000 to get equal with Trump, but you want to get extra in there, those 300,000 shouldn't, we'll say, 30% go to Trump and we'll say 70% to Biden. Trump has to get a certain percentage, but he got none.",
        "start": 1058.029,
        "end": 1086.715
    },
    {
        "text": " Well, see, that's one of the things. They were so blatant. They were so blatant, it was like in your face, like when they flipped everything, right? While we were watching the results, we see Trump's way ahead one minute. All of a sudden, everything's flipped right in front of us. And then Brett Barrett says, where's the evidence? I just, we saw it. We were watching it, okay? And so, well, here's a good example.",
        "start": 1086.903,
        "end": 1112.739
    },
    {
        "text": " You know, here, the must-read of the day, Liz Harrington on how Georgia was stolen. Liz Harrington, longtime spokesperson for President Trump, Donald Trump's campaign, published a must-read analysis of the 2020 stolen Georgia election on the War Room Wednesday. This is the most comprehensive investigative piece of the fraudulent election in Georgia to date.",
        "start": 1113.353,
        "end": 1138.916
    },
    {
        "text": " There's no way you can read through the analysis and not believe that Georgia was stolen from President Trump in 2020. It took numerous dishonest individuals to make this happen. On noon on December 3rd, 2020, Richard Barron had a problem. The 2020 presidential election results already declared by the deep state to be the most secure in American history.",
        "start": 1138.916,
        "end": 1167.039
    },
    {
        "text": " had just undergone a machine recount in Georgia, Fulton County, and was meaning to certify the results in less than 24 hours. And then the elections director was more than 17,000 votes short. So Joe Biden despised corrupt career politician who had been running for president and fail in spectacular since 1987.",
        "start": 1167.466,
        "end": 1192.176
    },
    {
        "text": " allegedly received the most votes of a president in U.S. history, yet simultaneously could only sneak up in Georgia by some 13,558 votes. It didn't add up. It just didn't add up, and neither did the numbers in Fulton County. The first machine count that dragged on for days after November 4th, the day of Secretary of State Board Raffensperger, this guy, Raffensperger, that guy is corrupt.",
        "start": 1192.534,
        "end": 1221.34
    },
    {
        "text": " Oh, yes, he promised. That's where we go back to the gifts. What was the gift he got? Promised the counting would be finished, and President Trump was over 130,000 vote lead was insurmountable. The 17,234 votes voting county had to come up with were important.",
        "start": 1222.056,
        "end": 1244.531
    },
    {
        "text": " The recount was concluded on the Wednesday night, December 2nd. Barron said that the Fulton Election Board meeting to certify the results, we submitted our results, and then yesterday the state allowed us to do reconciliation. The results all changed then. This was an understatement. When you have a problem like a 17,000 vote discrepancy in an election,",
        "start": 1245.333,
        "end": 1271.476
    },
    {
        "text": " You're claiming that decided by less than 13,000 votes, who do you call? Well, the elections group, of course, they seem to pop up everywhere, out of nowhere. In 2020, setting up drop boxes, training election officials in Madison, Wisconsin, programming the machines in Maricopa County, Arizona. Its members briefing C-CESA and how to...",
        "start": 1271.476,
        "end": 1295.35
    },
    {
        "text": " Protect 2020 project and protect it from whom? Barron sent an email to Ryan Macias of the election group at 12.13 p.m. There was no subject and nothing in the body of the email, only a file attached and a very important file entitled Batches Loaded Report.",
        "start": 1295.776,
        "end": 1320.503
    },
    {
        "text": " Three and a half years after the email was sent, the Georgia State Election Board heard the results of the investigation. In the recount, it confirmed Fulton County violated election rules. The evidence brought up by independent investigators showed over 20,000 ballots were inserted into both the original results and the second machine count out of thin air. They just came up with 20,000 new ballots out of thin air.",
        "start": 1321.288,
        "end": 1350.299
    },
    {
        "text": " Simply put, Fulton County did not have the proper ballots to justify their original results, and they got caught. And, I mean, it goes on and on. I mean, and that happened all over the place, John. Well, remember the phone call that President Trump made to the governor of Georgia? Yeah. And he said that at that time, Trump lost Georgia by 14,000 votes.",
        "start": 1350.657,
        "end": 1380.606
    },
    {
        "text": " But they had found out that there was like 30 or 40,000 people under age voted, criminals voted. John, I'm going to have to break in because, you know what, I just noticed the time. You have, would you do this, would you read that prayer that you wrote? Do you have that? Yes, Mr. Adams. Would you read that? Because we have just, how much time do I have there, John? Six minutes. You have six minutes.",
        "start": 1381.22,
        "end": 1409.172
    },
    {
        "text": " Okay, Pastor. Yeah, this is a, and I just want to give a little background on it, and then I'll read it. I follow the outpourings, the great outpourings of the Holy Spirit that shook America, and there was one in 1800, and three small churches got together with one pastor, Pastor McCready was his name, and they wrote a covenant, prayer covenant to the Lord, and they, for a year,",
        "start": 1409.616,
        "end": 1436.903
    },
    {
        "text": " They prayed this covenant, and the Lord sent the great outpouring of the Holy Spirit. So I thought, why don't we do it again? And it's really picked up. There are thousands of churches praying this prayer that I wrote. So it's titled, Cry unto the Lord Prayer Covenant. It's for the United States, but it's actually going all over the world now. Abba Father, we come before you in the precious name of the Lord Jesus, understanding the hour in which we live",
        "start": 1437.227,
        "end": 1467.21
    },
    {
        "text": " We see the day of the Lord approaching and we are crying out to you according to your word. We cry out in repentance for our sins and the sins of our nation. We cry out for an outpouring of the Holy Spirit. We realize that time is short before the Lord Jesus comes for his bride. But according to your word, the outpouring of the Spirit will continue until he comes. Okay, hang on, please.",
        "start": 1467.722,
        "end": 1494.445
    },
    {
        "text": " We are humbled before you with the manifest sins of our nation, including how this offends, recognizing how this offends your holiness. By faith, we are asking for one more outpouring, both to win untold numbers of souls for the Lord Jesus and hold back the terrible spirit of antichrist. With this mighty outpouring, we ask for the healing of the brokenhearted, the outpouring of the opening of prison to them that are bound, and the setting at liberty of",
        "start": 1495.572,
        "end": 1523.933
    },
    {
        "text": " to them that are bruised. Abba, free us completely from the spirit of bondage and fear and fill us with power, love, and a sound mind. Free us completely of unbelief and have us grow mighty in faith to please you. In the past, you sent many great outpourings of the Holy Spirit and we are asking Abba for one more before the groom comes for his bride. The church was birthed with the power of the Holy Spirit and we want to go with you",
        "start": 1524.343,
        "end": 1553.746
    },
    {
        "text": " in that same power. The great outpouring first came to Jerusalem, and we beseech you for another great outpouring of your spirit upon your people Israel like you first sent 2,000 years ago. Abba, Father, we love you as little children and believe the word with the same faith as children. We know when we ask our Abba that he hears us. Father, as the end goes near, it's like the days of Noah. To protect us from the wicked one and from the love of the world",
        "start": 1554.07,
        "end": 1584.002
    },
    {
        "text": " we come under the power and authority of your word and your name. We are growing close to you for protection and asking that you heal all the broken hearts of your people along with freeing us from bondage so that the bride is ready for the groom. Amen.",
        "start": 1584.394,
        "end": 1602.722
    },
    {
        "text": " Amen. Thank you, John. That was a very, very good prayer. Thank you very much. And we're coming to the end of the program today. And I want to, again, tell the folks out there, we need to continue to pray for America, pray for this.",
        "start": 1603.148,
        "end": 1620.845
    },
    {
        "text": " You know, there's much, much power in prayer. People will only believe it and do it. We can turn America back. We're already seeing signs of good things happening. We're seeing signs of revival popping up here, popping up there. We saw what happened in Tennessee. We saw... Louisiana, Ten Commandments. Oklahoma now. Yeah. And it looks like, again, we've...",
        "start": 1620.845,
        "end": 1646.971
    },
    {
        "text": " America, we're trying to bring it back. We've seen what the Democrats have tried to take us. Like the Bible says, all nations that forget their God will be turned into hell, and they're trying to turn America into hell. The Democratic Party has become completely corrupt, anti-Christ. Satanism is the fastest-growing religion now in the country, and more and more Democrats are choosing the Church of Satan for their church, for their religion now. That's happening.",
        "start": 1646.971,
        "end": 1675.981
    },
    {
        "text": " And it's just exactly like God's Word of the Bible said when he told you that in the last days you would see these things. So we're seeing it. We're right on schedule. Like they say, things aren't falling apart. They're actually falling right into place.",
        "start": 1675.981,
        "end": 1690.043
    },
    {
        "text": " And so we're coming. How much time do I have there? One minute. All right. So we're at that point in America where it's now or never. We've got to stand. We've got to take our country back. And, again, if the Lord tells us, 2 Chronicles 7, 14, it's for real if you believe it, and we have real repentance.",
        "start": 1690.52,
        "end": 1719.991
    },
    {
        "text": " Thanks for being here, John. You've done good, young fella. Well, I've had a good coach. I've had a good coach, Mr. Ernie, all these years. Well, we're out of time, so now we've got to say goodnight. Say goodnight. God bless. God bless. And then we always come to that. And thanks for being here, folks, where we always say, and always, always, always. Always. You ready?",
        "start": 1719.991,
        "end": 1749.104
    },
    {
        "text": " Keep fighting the fight.",
        "start": 1750.503,
        "end": 1758.336
    },
    {
        "text": " Thanks for listening to the Voice of the Christian Resistance, What's Right, What's Left, hosted by Pastor Ernie Sanders. To learn more about our ministry, please visit us online at www.wrwl.org. Please tune in next time for another edition of What's Right, What's Left.",
        "start": 1763.166,
        "end": 1783.029
    },
    {
        "text": " The preceding program is sponsored by What's Right, What's Left. This is Brent Musburger's Action Update. Get insights into the sports betting market with VSEN's Betting Splits. See where the money is and keep updated on how the market is reacting. Only at VSEN.com. Now, here are the latest lines from my guys in the desert.",
        "start": 1784.002,
        "end": 1805.947
    }
]