[
    {
        "text": " Sunny, less humid for Sunday, a beautiful summer afternoon, the high of 85 with a nice light breeze out of the north-northwest. Monday, warm and humid, variably cloudy, watch for a thunderstorm in spots in the afternoon, the high of 78. Variably cloudy Tuesday, again a couple of showers and a thunderstorm, but mainly later, warm and humid, the high of 81. I'm AccuWeather Meteorologist Jason Catarina on Talk Radio 95.3 WRSC.",
        "start": 0.009,
        "end": 24.94
    },
    {
        "text": " Fox News, I'm Jack Callahan. Missouri Senator Josh Hawley says federal whistleblowers are telling him security at last Saturday's Trump rally in Pennsylvania was much too loose. Well, one thing is that most of the detail assigned to Trump that day into that rally were not secret service, that most of them were from other federal agencies, including Homeland Security.",
        "start": 27.534,
        "end": 48.131
    },
    {
        "text": " Holly tells Fox's Hannity the shooter flew a drone over the scene. The Secret Service did not. The Biden campaign insists President Biden will not drop his reelection bid despite more Democrats calling for that. Florida Congressman Jared Moskowitz telling Fox News Primetime. Democrats, I think, need to look at this holistically. We obviously want to defeat Donald Trump. But at the same time, if the country decides to give Donald Trump the wheel, we'd like to also see him get some breaks. And that's either winning the House or winning the Senate.",
        "start": 48.353,
        "end": 76.015
    },
    {
        "text": " America is listening to Fox News. From the Fox Sports Studios in Los Angeles, here's Martin Weiss. It's a rainy day at Royal Troon as the third round of the Open Championship is underway. Billy Horschel and Daniel Brown, both five under, tied in first place. Xander Schauffele, four under. Justin Rose and Shane Lowry, also four under. They are tied in third. Schauffele threw 17 holes.",
        "start": 76.22,
        "end": 105.913
    },
    {
        "text": " Major League Baseball right now got two games as it comes back from the all-star break, both in the fourth inning. The Cardinals at the Braves tied 0-0. Tampa Bay at New York. The Yankees right now trailing the Rays 4-0. Giancarlo Stanton could be available as soon as next week. He's been on the injured list for the last month with a bad hamstring.",
        "start": 105.913,
        "end": 124.735
    },
    {
        "text": " Team USA plays South Sudan and London. It's the third of four exhibition games in preparation for the Olympics. Team USA is a 43.5-point favorite. You can catch that at 3 p.m. Eastern on Fox. The Jacksonville Jaguars have placed former 49er Eric Armstead, defensive lineman, on the PUP list. I'm Martin Weiss. Lightner Communications, back to blue. This is Sheriff Bob with the Blair County Sheriff's Office. Summertime is here. We share the roads with motorcycles, bicyclists, and pedestrians.",
        "start": 124.735,
        "end": 153.319
    },
    {
        "text": " If you're a car pulling to an intersection or changing lanes, take a second to look twice. And remember, you share the road with others besides yourself. Let's make sure everybody arrives at their destination safely. These sponsors are Backing the Blue, Ron Beatty Carpet and Upholstery Cleaning, and Russell Tire of Altoona.",
        "start": 153.609,
        "end": 173.046
    },
    {
        "text": " U.S. real estate is so expensive, it's even keeping out wealthy foreign homebuyers. I'm Jeff Colvin of Fortune Magazine with the Fortune Business Update. Home prices continue to rise along with elevated mortgage rates, a deadly combination for many hopeful homebuyers. And international buyers have caught on. In the 12 months that ended last March, they bought just over 50,000 properties.",
        "start": 173.404,
        "end": 198.456
    },
    {
        "text": " The fewest since the National Association of Realtors began tracking the data 15 years ago. And the foreign buyers spent much less. That's partly because the dollar is strong, which makes U.S. homes more expensive for foreigners. Another potential factor affecting foreign investment is the impending U.S. election, which could lead to policy changes that affect international home buying.",
        "start": 198.456,
        "end": 223.251
    },
    {
        "text": " For years, Chinese buyers bought more than anyone else, but no more. Now buyers from Canada are number one, followed by Mexico, China, and India. I'm Jeff Colvin. Download our app. My God, this app is amazing! Search Leitner Radio in the Google Play and App Store. Talk Radio 95.3 WRSE",
        "start": 223.251,
        "end": 245.128
    },
    {
        "text": " Welcome back. Ron and Amy, The Car Doctor. And you know what's fun about older cars? Now that I've convinced you that you can't keep your older car because there's no parts, let me tell you why they're fun and great to have. All right? We just added a 2002 Thunderbird, a Ford Thunderbird, to the family fleet. Had to make some repairs. Took forever to find parts. Really, really a tough gig. And, you know, kind of tooling around in that as a...",
        "start": 252.705,
        "end": 277.568
    },
    {
        "text": " my god what a basic car you know it's got a radio that's only a radio it's not an entertainment system it's not a television set it doesn't launch missiles it doesn't have a backup camera built into it it doesn't warn you when anybody's near you it's a radio",
        "start": 277.568,
        "end": 292.688
    },
    {
        "text": " And it's got these funny little buttons. You push it on, it turns it on. You push it again, it turns it off. It has these little sticky buttons called presets. You go ding, ding, ding, ding, ding. I think the most high-tech option on this car is you can lock the trunk with a switch. You put the key in and you turn it and the button won't go down. That's high-tech on a 2002 Ford Thunderbird. It's really kind of hilarious.",
        "start": 292.688,
        "end": 315.077
    },
    {
        "text": " You're just not used to any of this. New cars have spoiled us, I will tell you that. And sometimes it's just fun to get into something like that and just go for a ride because it's very, very mechanical. So that's one thing I will always enjoy about older vehicles. Let's go to Tom in Florida with some general battery questions. Tom, welcome to the car, doctor, sir. How can I help? Yes, sir. What's going on?",
        "start": 315.077,
        "end": 337.227
    },
    {
        "text": " Before I start, I think your website might be under that meltdown there because it's not working to live. The stream? Okay. All right. Good to know. We'll take a look at that. Not a problem. Yeah. But last year, I bought a battery for my daughter's Audi. It was just about a year ago, and it died last week. Yeah.",
        "start": 337.227,
        "end": 363.439
    },
    {
        "text": " We were looking at the battery, and it was dated two years. When we bought it, it was dated two years ago. So are you saying the battery is three years old, or it was a year old when you bought it? Yep, it was two years old when we bought it, and now it's three, and it's dead. Okay, and what's the warranty on it?",
        "start": 364.036,
        "end": 386.425
    },
    {
        "text": " They actually covered it 100%. They gave us a new battery, we checked the data, it was fine. My question is, and maybe to warn other people, can they sell it forever?",
        "start": 387.585,
        "end": 399.821
    },
    {
        "text": " You know, it's a great question, Tom. It really is, and it is a concern. I will answer it like this, if I can, with a little story. So, you know, we stock batteries at the shop. And, you know, we just stock, I think, 10 or 12 of the common popular numbers and some of the not-so-common popular numbers. And I count on the battery truck to come around every couple of weeks, and he'll look at the date code on the battery and say, yeah, this one's got to go, this one's got to go, and they rotate your stock around.",
        "start": 400.35,
        "end": 427.517
    },
    {
        "text": " You know, it took me a while, but after so many years in the business, I finally asked the question one day. I said, so when you take these batteries out of here, if the battery is sitting longer than 120 days, they'll pull it from my inventory. And, you know, where does it go? You know, I kind of wanted to know that question. I'm just curious by nature. And to your point.",
        "start": 428.336,
        "end": 448.712
    },
    {
        "text": " They'll take that battery, and depending upon the part number, they will either put it at a location that has high recorded instances of using a 26R or a 34G or something like that, or they'll sell it off to other vendors. And I said, what do you mean other vendors?",
        "start": 448.712,
        "end": 465.606
    },
    {
        "text": " And the battery guy explained to me, and I've seen this a couple of times, so I believe it to be true. They will sell it off to bidders, road service companies, the towing companies of the world, to say it cleanly, that will buy that battery.",
        "start": 466.459,
        "end": 483.029
    },
    {
        "text": " So recondition it. By recondition it, I mean they will put it through a recharging process where they'll desulfate the battery, make sure it's up to charge, give it some load testing, make sure it passes, and then put their own label on it, their private brand label. So Tom's Battery Company, right? And they'll sell that as a new battery. Why? Because it's never been used, but it's old. Wow.",
        "start": 483.029,
        "end": 506.305
    },
    {
        "text": " And I see this a lot. And as convenient as roadside battery installation is, and it isn't anymore because battery installation is getting to be a chore unto itself, if somebody wants to put a battery in their late model Ford Escape,",
        "start": 506.305,
        "end": 523.695
    },
    {
        "text": " going up to about model year 2018 i'd pay to see that because it's it's a chore um doing a battery half the car's got to come apart on that driver's side so yeah you know yeah it's it's it's an issue you know if you're looking for battery information too tom just to give it a real quick shout out go out to autobatteries.com excellent resource how batteries work things to be concerned with how to find a good battery that kind of thing but autobatteries.com",
        "start": 523.695,
        "end": 549.65
    },
    {
        "text": " Can probably help you. And, you know, it's sort of like the online resource we use in the shop all the time. But it's not unusual. You know, is the car all right now? Yeah, yeah. I mean, put the new battery in, it works fine now. Right. Yeah, it's, you know, and the funny thing is, and I'm not sure why, but about five years ago, the industry changed. They used to prorate batteries.",
        "start": 549.65,
        "end": 575.606
    },
    {
        "text": " You know, where you would use it so many months and get back so many dollars against it and such. They don't do that anymore. Now, most batteries today have a three. At max, I've seen a four-year warranty, maybe three and a half. And then after that, you're done.",
        "start": 575.811,
        "end": 592.978
    },
    {
        "text": " and yeah yeah there's no warning or anything there's no warning or anything i you know it's it's funny i i still see batteries as having a four to five year life cycle you know the the online people are going to generate so much mail over this comment but you know because everybody's going to write me and tell them i got nine years out of my battery good lucky you the industry says you know listen",
        "start": 592.978,
        "end": 616.203
    },
    {
        "text": " You know, you're the guy stuck on the side of the road or in the parking lot at 2 o'clock in the morning when it won't start. You know, the industry says four to five years. And AGM batteries, AGM batteries are a funny duck, right? They're a completely different type of battery in a sense. I've seen certain models gobble up batteries every three and a half years, and I've seen certain models go six years. But beyond six years, I'm putting a battery in it. And if I'm changing...",
        "start": 616.203,
        "end": 643.592
    },
    {
        "text": " If I'm changing the battery in a vehicle and it has a separate start-stop battery, I'm doing that as well. Because that battery is generally the same material, and obviously it's the same age. So if one went, the other went. Batteries are a very complicated conversation to have these days. They really are. And on a newer car, do you have to get start-stop now on a gas engine? No.",
        "start": 643.592,
        "end": 668.524
    },
    {
        "text": " You don't have a choice. It'll depend on what the manufacturer is trying to achieve from emissions values. The reason there's start-stop, let me answer it this way. The reason there's start-stop is manufacturers are trying to hit a certain fuel economy.",
        "start": 668.524,
        "end": 683.08
    },
    {
        "text": " Because how many cars they sell that get 40 miles to the gallon versus how many cars they sell that get 20 miles to the gallon, they get emissions credits and different compensation from the government because they're trying to clean up the environment. And that's really where all that start-stop technology came from. They're worried about emissions and gasoline. There are ways to...",
        "start": 683.353,
        "end": 705.06
    },
    {
        "text": " Get around start-stop. There are some vehicles that come with a button that you can turn it off. If the vehicle has a fault code in it, the start-stop will not work in most experiences that I've had. If I get to a traffic light and I want to see if start-stop doesn't work, pop it into neutral. Just got to remember to hold your foot on the brake so the car doesn't roll. But sometimes popping it in neutral will take it away. I personally have an issue with start-stop real quick because I just worry that on an older vehicle,",
        "start": 705.06,
        "end": 733.183
    },
    {
        "text": " the abuse I'm putting on the starter, the, the, how, how good is that battery? Um, I don't want to find out, you know, late at night in a bad part of town, right. That my stop start battery isn't working. Um, you know, to me, I'd like to know once the car started, I'm coming home late at night, et cetera. I'm going to get there. Uh, but shame on me. I try to think logically. Um,",
        "start": 734.138,
        "end": 759.241
    },
    {
        "text": " And you know, I did an experiment, Ron, last year. I just bought a brand new car. I left it on. I didn't touch anything for six months. It said I saved a total of 0.97 gallons of gas. Well, listen, I can show you that the government's crazy.",
        "start": 759.241,
        "end": 776.647
    },
    {
        "text": " All right. You know, it's listen, move to New Jersey, move to move to New Jersey and go get a vehicle titled in North Jersey. I had to travel an hour and five minutes a week ago to go get a vehicle titled. But the agency that does registration is six minutes from the house.",
        "start": 776.647,
        "end": 789.906
    },
    {
        "text": " So, you know, but we're trying to clean up the environment and save gasoline. I want to know who makes up these things. Who thinks of this? Somebody that rides a bicycle, I bet. Yeah, even for the government, the post office would be out of business. Right, exactly right. Yeah. It's crazy. All right, sir. I got to run. Thanks for the info about the website, Tom. You have a great time. Get out to autobatteries.com, and that'll help you in the future, and you be well, and thanks for being part of the Car Doctor family.",
        "start": 790.282,
        "end": 817.381
    },
    {
        "text": " I'm Ron Ananian, The Car Doctor, 855-560-9900. I'll return right after this. Warren Eckstein and the Pet Show, Saturday afternoons at 4 on Talk Radio 95.3 WRSC.",
        "start": 817.381,
        "end": 834.497
    },
    {
        "text": " Ronananian, the car doctor, is brought to you in part by Dorman Products, featuring the largest selection of direct replacements for failure-prone turbocharger system parts in the business. Learn more at DormanProducts.com. Clean, correct coolant is vital to the lifecycle and operation of your vehicle's cooling system and engine.",
        "start": 843.131,
        "end": 860.623
    },
    {
        "text": " Peak Antifreeze Plus Coolant is specially engineered to deliver guaranteed superior lifetime protection. It's compatible for use with any color or type of antifreeze in your vehicle system. And with robust organic additives, Peak Antifreeze Plus Coolant will fight against the damaging effects of scale deposits and corrosion. You can learn more at peakauto.com. That's peakauto.com.",
        "start": 860.776,
        "end": 883.575
    },
    {
        "text": " Clarios is a global leader in energy storage solutions, powering one in three of the world's vehicles today. They offer the most advanced battery technologies for virtually every type of vehicle. We recently talked with Clarios Vice President of Technology, Craig Rigby. Craig touched on the future of electric and hybrid vehicles. New vehicle production is definitely shifting towards hybrids, and in particular, electric vehicles at a very rapid pace.",
        "start": 883.575,
        "end": 907.995
    },
    {
        "text": " Claris estimates that out of the 1.7 billion cars expected to be on the road by 2040, up to 50% of those will be some combination of full, mild hybrids and electric vehicles. This shift will require a lot of change, not the least of which is having enough charging stations to make both daily driving and long trips practical. As different and complex as these vehicles have become,",
        "start": 908.456,
        "end": 930.009
    },
    {
        "text": " the basic things we do to maintain them won't really change and that includes maintaining your 12 volt battery and changing it out when necessary learn more about agm batteries at autobatteries.com that's autobatteries.com as a professional you've got a thousand and one things to track in your shop and zero minutes to slow down autozone understands that and is here to help you keep your business moving",
        "start": 930.35,
        "end": 953.387
    },
    {
        "text": " AutoZone has original equipment quality or better parts from brands you can trust. Leading in stock coverage, fast hot shot delivery and easy to track online ordering so that you can get the right parts right when you need them. Keep it moving with AutoZone's professional edge.",
        "start": 953.387,
        "end": 970.077
    },
    {
        "text": " The doctor's office that mixed up your files has your social security number. The power company that mistakenly cut your service has your payment info and last three addresses. Your info is in endless places that could accidentally expose your info to identity theft. That's why LifeLock monitors millions of data points every second. If your identity is stolen, they'll fix it guaranteed or your money back.",
        "start": 973.558,
        "end": 997.227
    },
    {
        "text": " Save up to 40% your first year with promo code Clay at LifeLock.com. Terms apply. Did you know your life insurance is an asset you can sell? I'm Jay Jackson, CEO of Abacus Life. For almost 20 years, Abacus has been purchasing life insurance policies from seniors just like you. And at AbacusPays.com, we've created a free policy value calculator so you can find out the worth of your policy in just seconds.",
        "start": 997.227,
        "end": 1022.21
    },
    {
        "text": " There are no fees and no obligations. Get real value from your life insurance when you need it with Abacus. Learn more at abacuspays.com.",
        "start": 1022.21,
        "end": 1030.606
    },
    {
        "text": " This is CNET, and here are the stories that matter right now. A new investigation by Proof News in collaboration with Wired found that Apple, Nvidia, Anthropic, and Salesforce were among the companies that used a data set of scraped subtitles off of YouTube. More than 170,000 YouTube videos were a part of the data set and were all taken without permission, again raising questions about copyright infringement when it comes to training AI engines.",
        "start": 1034.377,
        "end": 1061.22
    },
    {
        "text": " To train generative AI tools like chatbots, developers need enormous swaths of initial training data, with tools like ChatGPT often producing misleading answers to questions about current events.",
        "start": 1061.22,
        "end": 1073.592
    },
    {
        "text": " Stay up to date with the latest by visiting CNET.com. Brought to you by Progressive Insurance. Progressive makes bundling easy and affordable. Get a multi-policy discount by combining your car, home, motorcycle, commercial auto, and more. All your protection in one place. Bundle and save at Progressive.com. Talk Radio 95.3 WRSC.",
        "start": 1075.145,
        "end": 1097.79
    },
    {
        "text": " Ron and Amy in The Car Doctor here to answer your questions at 855-560-9900. Let's go over to Travis up in Canada and see what's going on here. Travis, welcome to The Car Doctor, sir. How can I help? Hi, Ron. Thanks for having me. How are you doing? You're welcome, sir. Good. What's going on?",
        "start": 1116.118,
        "end": 1130.691
    },
    {
        "text": " I got a 2003 Mitsubishi Eclipse. It's got 131,000 miles on it, and it's got the 2.4 liter motor in there. Right, yep. And I've been fighting a P0171 for, oh, I don't know, about eight or nine months. Right. And it's been off the road for a while just as I'm trying to diagnose and fix the darn thing. And, yeah, I've kind of gone through the service manual, and I'm kind of stuck. I don't know where else to go. I've checked for...",
        "start": 1132.159,
        "end": 1160.776
    },
    {
        "text": " You know, vacuum leaks, exhaust leaks, and I've fixed a few of those. And it's still throwing the code. The vacuum leaks I fixed have brought the short-term fuel trim.",
        "start": 1161.049,
        "end": 1172.944
    },
    {
        "text": " Down at idle, which at first I thought that was, oh, hey, maybe that was the problem. But my long-term fuel trims driving and at idle and under load are stuck at 12.5 all the time. Okay. So it's always got high fuel trims. Are the fuel trims high at idle or even going down the road?",
        "start": 1173.439,
        "end": 1193.524
    },
    {
        "text": " Both. The long-term is just pegged out at positive 12.5. At idle, they were low 20s consistently before I fixed the vacuum leaks. And then now they seem to be long-term stuck at 12.5 and short-term is anywhere from plus, I'd say plus 7 to plus 10. Okay. All the time. Okay. So have you tried making this richer? Do you have any propane?",
        "start": 1194.94,
        "end": 1222.927
    },
    {
        "text": " I have, yeah, and immediately when I throw that in the intake, the trims come down. Okay, good. So that shows us DO2s are working, right? Yeah. It's able to respond. So sitting there at idle, warmed-up engine, have you looked at mass airflow grams per second? Yeah, I'm sitting at about 2.8. That's about right. That's about right. And then as you accelerate down the road, it increases, right?",
        "start": 1224.275,
        "end": 1251.852
    },
    {
        "text": " Yeah, absolutely. Yeah. Okay. And have you poked around with propane? For like looking for leaks you mean? Yeah, just looking for a vacuum leak. I've smoke tested. I bought a smoke machine off Amazon and that's been great. That helped me find my other leaks. So now when I go into the brake booster or another line, the only minor leak that I have is",
        "start": 1253.029,
        "end": 1280.725
    },
    {
        "text": " It's almost like it has a mechanical throttle body with a throttle cable. Right. And it's coming out. There's a bit of smoke coming out where the spring is on the throttle body. I don't know if it's the throttle body shaft seal, maybe. Okay. But I don't know if that's normal as the smoke machine builds up pressure, but that's the only spot I got smoke coming out in the intake side. Okay.",
        "start": 1281.254,
        "end": 1303.592
    },
    {
        "text": " And smoke's a great way to go and good initiative, right? I like your thinking. So a smoke machine generates about a half a PSI in most cases, depends on what yours is. But a smoke machine test is only half the equation, all right? I'd still like to do it with propane. So what sort of propane setup do you have?",
        "start": 1303.592,
        "end": 1324.804
    },
    {
        "text": " Oh, it's just a generic camping, like, yeah, like a torch. Oh, okay. Tell you what, sit tight, Trevor. Let me pull over and take the pause. When we come back, we'll finish up. I'm Ron Ananian, The Car Doctor. We'll be back right after this. Live on Sunday night with Bill Cunningham, Sunday nights at 10 on Talk Radio 95.3 WRSE.",
        "start": 1326.544,
        "end": 1349.036
    },
    {
        "text": " If you're turning 65 or retiring soon, it's time to consider your Medicare options. Geisinger Gold Medicare Advantage plans start at $0 per month with access to more than 30,000 doctors in 180 hospitals across Pennsylvania. Plus, plan options that may include dental care, eyewear, and hearing benefits. If it's time for Medicare, learn about the many benefits of Geisinger Gold.",
        "start": 1359.599,
        "end": 1384.667
    },
    {
        "text": " Geisinger Gold or HMO PPO and HMO T-SNP plans with a Medicare contract. Enrollment in Geisinger Gold depends on contract renewal.",
        "start": 1384.838,
        "end": 1389.94
    },
    {
        "text": " More young people are thinking about permanent birth control since the end of federal abortion protections. I'm Rainer Reism, and this is your KFF Health News Minute. OBGYNs like Gina Nelson say more women have asked for tubal ligation after the Dobbs decision. People talk about sterilization more, and they get them more. Researchers have also seen a jump in men requesting vasectomies in the last two years. More than 20 states have enacted abortion bans or restrictions since the Supreme Court overturned Roe v. Wade.",
        "start": 1391.971,
        "end": 1421.664
    },
    {
        "text": " More Americans are paying membership fees for the privilege of seeing a doctor. It's called concierge medicine. Even people with health insurance are paying hundreds of dollars a year for it. That can buy prompt appointments and more time with your doctor. But better access for some means fewer options and longer waits for those who can't afford it. And research shows that concierge doctors care for fewer Black, Hispanic, or low-income patients. There's more at kffhealthnews.org.",
        "start": 1421.664,
        "end": 1447.261
    },
    {
        "text": " Fox 2. I'm Michelle Polino. We're in the midst of a revolution in space. On Max, Wild Wild Space is a documentary looking at the commercial space industry and the ongoing competition between wealthy tech investors and innovators to monetize satellites, rockets, and beyond. We have to break the cycle.",
        "start": 1450.128,
        "end": 1472.142
    },
    {
        "text": " On Hulu, the second season of Unprisoned. Kerry Washington and Delroy Lindo co-star in this comedy series. Washington stars as a therapist and her ex-convict father who rekindled their relationship after he's released from prison. Author Terry McMillan created and executive produces this series. Simone is a once-in-a-lifetime athlete.",
        "start": 1472.142,
        "end": 1493.49
    },
    {
        "text": " On Netflix, Simone Biles rising just in time for Biles' return to the Olympic stage. Netflix is going behind the scenes of her gymnastics comeback. The four-part docuseries follows Biles both outside the gym and in it. That's Fox 2 on Fox News.",
        "start": 1493.49,
        "end": 1509.889
    },
    {
        "text": " Hi, this is Tor Michaels, and I have great news. The Radio Station Auditorium is now open every weekday morning here on Talk 95.3 WRSC. Join me between 6 and 9 for the latest local news, sports and weather, your phone calls, dial and deal at any time, and of course, a chuckle or two. It's the Tor Michaels Show, weekday mornings from 6 to 9 here on Talk 95.3 WRSC.",
        "start": 1510.828,
        "end": 1538.37
    },
    {
        "text": " Talk Radio 95.3 WRSC. Hey, we're back. Ron and Amy in the Car Doctor at 855-560-9900. The Car Doctor's 24-7 hotline. Travis, you're there.",
        "start": 1539.206,
        "end": 1565.06
    },
    {
        "text": " I am, sir. Okay. I want you to take your propane bottle, all right, and you've probably got like the little crank on black knob that turns on and off, like if you're going to light it to do plumbing work or light up a camping lantern, that kind of a thing. Right. Okay. So somehow you've got to nick that on. You've got to attach a black rubber hose or some sort of rubber hose to that. And then on the other end of that rubber hose, I want you to get a small piece of steel brake line, 316ths.",
        "start": 1566.186,
        "end": 1591.817
    },
    {
        "text": " And I want you to peen one end of that brake line down so it's just a point. So crush it flat. Typically what I'll do is I'll put it in a vice and I will peen it shut except for one little corner. I'm trying to make a pinpoint opening in the end of the brake line.",
        "start": 1592.005,
        "end": 1609.36
    },
    {
        "text": " All right. Now, when I open up the propane and I'm going to open it up slow, realizing that if something backfires, I've got a hand grenade in my hand. Right. OK. The dangers of auto repair, brother. All right. And I'm going to use that pinpoint like a wand and I'm going to direct it at specific things and I can control the flow with the knob. I don't have to turn on a full just a little bit of a flow. Right.",
        "start": 1610.196,
        "end": 1631.988
    },
    {
        "text": " If you were to look at the O2 sensor by scan tool or voltmeter or whatever way you want to do it, can we agree that if you were able to get propane directly in that throttle shaft and it made a difference on how the O2 read, that it's making a difference on fuel trim?",
        "start": 1631.988,
        "end": 1646.049
    },
    {
        "text": " It should, yeah. Yeah? Right? Fuel trim is fuel trim. I mean, it doesn't know where the fuel or the air is coming from. So, you know, I want you to do that. That's the whole purpose of propane. Propane is not just in that big globular. If we were going to do massive amounts of propane like that, we might as well use carb clean from the 70s. All right? Right. The idea is, you know, propane can make a very pinpoint accurate diagnostic tool. All right?",
        "start": 1647.551,
        "end": 1672.756
    },
    {
        "text": " I want you to get a yellow notepad and just eliminate things. I want you to check fuel pressure, if you can. I've done that, yep. Good. You wrote down your results?",
        "start": 1672.756,
        "end": 1682.466
    },
    {
        "text": " Yeah, it was one PSI at curb idle over the spec, so I figured that was good enough. Take a look at the maps. Take a look at the map sensor. Key on, engine off. You should see four to four and a half volts. Start it up. You should see a volt, volt and a half, something like that, but just be specific. Propane the throttle body. Just make sure there are no vacuum leaks elsewhere. Leave the brake booster disconnected.",
        "start": 1683.473,
        "end": 1708.524
    },
    {
        "text": " All right? And then last, look around in the area of the O2 sensor. Any exhaust leaks. Any exhaust leaks will skew that O2 and will contribute to a lean code. Do those things. Call me back. Until the next time, I'm Ron Ananian, The Car Doctor. Good mechanics aren't expensive. They're priceless. See ya.",
        "start": 1708.524,
        "end": 1724.497
    },
    {
        "text": " I'm Eben Brown. Are bump stocks legal again or what? The U.S. Supreme Court decision last week affecting the ban on the devices by the Bureau of Alcohol, Tobacco, Firearms and Explosives, still usually called ATF, has left many wondering what the future will hold.",
        "start": 1733.575,
        "end": 1750.725
    },
    {
        "text": " The court ruling is a bit narrow and doesn't mean that bump stocks could never be banned. It just means that such a ban needs to be the result of Congress legislating and not bureaucrats making rules. And that's why Senate Majority Leader Chuck Schumer, the New York Democrat, is bringing the matter up for a vote. President Biden called for such measures following the court ruling, though it seems unlikely such a bill could pass in the GOP-controlled House of Representatives.",
        "start": 1750.725,
        "end": 1776.527
    },
    {
        "text": " But if it did, someone could certainly sue for its repeal. Bump stocks remain banned by at least 16 states from red to blue, both like New York and Florida. And those are your bullet points. I'm Evan Brown, Fox News. From the Stalker Chevrolet Studios, this is Talk Radio 95.3 WRSC Belfont State College, a service of Leitner Communications.",
        "start": 1776.527,
        "end": 1804.224
    },
    {
        "text": " The first Trump rally since the",
        "start": 1806.169,
        "end": 1807.858
    }
]