[
    {
        "text": " The hypocrisy, the whole thing is so absurd. Clay and Buck, weekday mornings at 11. Kello, News Talk 1320, 107.9.",
        "start": 0.009,
        "end": 10.367
    },
    {
        "text": " Fox News, I'm Sue Guzman. Vermont Senator Peter Welch has become the first Senate Democrat to call on President Biden to bow out of the presidential race. Fox's Kristen Goodwin. In an op-ed for the Washington Post, Vermont Senator Welch writes, We cannot unsee President Biden's disastrous debate performance. We cannot ignore or dismiss the valid questions raised since that night.",
        "start": 13.507,
        "end": 35.333
    },
    {
        "text": " The president meets with Senate Democrats tomorrow. The NATO summit continues in Washington, D.C. Secretary of State Antony Blinken speaking at the foreign minister's dinner, praising NATO's inclusion of Finland and Sweden. Our alliance helped usher in newly independent nations to the community of democracies. And of course, when terrorists struck on 9-11, NATO allies immediately and unanimously invoked Article 5 for the first time and came to America's defense. America's listening to Fox News.",
        "start": 35.333,
        "end": 64.428
    },
    {
        "text": " Save big money on your outdoor storage solutions right now at Menards. Protect your car, boat, or yard equipment with VersaTube Storage Buildings. They're made with durable galvanized steel and quick-slip frame connections for easy do-it-yourself assembly. Save big on all VersaTube Storage Buildings at Menards. Number one in customer satisfaction among home improvement retailers according to J.D. Power. For more information, visit jdpower.com slash awards. Save big.",
        "start": 70.452,
        "end": 97.739
    },
    {
        "text": " We have definitely had some extreme weather lately. This is Mother Nature, and I have to admit, things got a bit out of control, even for me. Luckily, your friends at Extreme Heating and Cooling are ready and waiting to help you avoid the extremes and keep the temperature in your home perfectly cool. As a Rheem Pro partner, they bring high-quality equipment, honest answers, and free financing. Extreme Heating and Cooling.",
        "start": 97.739,
        "end": 127.602
    },
    {
        "text": " Always there when you need them. Thanks for calling Intech Cleaning and Restoration. This is Andy Berg. How may I help you? This is Steve. I'm calling because we need to get our carpets cleaned, and I was wondering when Jerry Berg could clean our carpets.",
        "start": 127.602,
        "end": 141.783
    },
    {
        "text": " Ah, well, Jerry is a pretty busy guy. We've got a trained carpet cleaning specialist. We can schedule to clean your carpets. Well, I really like Jerry. I first called Intech Cleaning and Restoration 30 years ago, and Jerry cleaned our carpets. Well, we've grown a lot since then. We have three locations, Sioux Falls, Brookings, and Yankton. Plus, we do water restoration, fire restoration, duct cleaning, mold remediation, and commercial janitorial cleaning.",
        "start": 141.869,
        "end": 166.954
    },
    {
        "text": " Wow. I'll bet Jerry's a really busy guy these days, but I'd still like to have Jerry clean our carpets. Well, hang on a second. I'll ask him. Hey, Dad, Steve was wondering if you could clean his carpets. Steve, Dad is really tied up today, but how about Wednesday afternoon? When you need it cleaned, call the InTech team. InTech Cleaning and Restoration.",
        "start": 166.954,
        "end": 188.677
    },
    {
        "text": " There are certain things in life we put off and wish we just wouldn't have to face. Often, we don't face these fears until there's no choice. Dentistry is often one of these fears for many people. At Infinity Sedation Dentistry Sioux Falls, through the last 19 years of doing sleep dentistry, they've treated many people with gag reflexes, needle phobias, claustrophobia, and others who've just had a bad experience in their past. Patients tell us they wish they could just fall asleep, wake up, and be done. You can.",
        "start": 189.565,
        "end": 218.456
    },
    {
        "text": " At Infinity Sedation Dentistry, we understand your fears and provide you with a relaxed environment customized for your comfort. Come and see Dr. Prouty and our team of registered nurses and board-certified anesthesiologists who will provide you with the predictable and safe treatment you deserve. And ask about digital dentures, single-visit crowns, and implant teeth in a day. Give them a call at 605-275-2009. Infinity Sedation Dentistry. We fix your teeth while you sleep.",
        "start": 218.456,
        "end": 247.773
    },
    {
        "text": " Weather by BillionAuto.com. Your vehicle may never be worth more than it is right now. Value your trade at BillionAuto.com.",
        "start": 247.978,
        "end": 254.172
    },
    {
        "text": " Another clear sky tonight, our low 60. Then tomorrow, mostly sunny, 84. The high, that's near normal. Light southeast breeze, 5 to 10. Yes, there could be more of that smoke in the sky. On Friday, mostly sunny, warming, 87 for a high. Could be a thunderstorm late Friday night. Then the weekend, mostly sunny, hot and humid, 91 Saturday, 94 Sunday. I'm meteorologist Jay Troback.",
        "start": 255.811,
        "end": 279.514
    },
    {
        "text": " The world comes at you pretty fast. We'll help you make sense of it all. Kello. News Talk 1320, 107.9, and kello.com. Great to have you along for the ride. Thanks a lot for stopping by. Glad to have this young lady on. Her name is Caroline Sunshine, who I think we probably have appeared on a television show or two together, but we've never met. Caroline, how are you? Good to see you.",
        "start": 280.555,
        "end": 301.305
    },
    {
        "text": " I am great, thank you. Like I said, better than Joe Biden outside the hours of 7 and 4 p.m. Great to be on your show. Well, I agree with you that you are better than Joe Biden, and you are great. She's the Deputy Communications Director for Trump 2024, which is awfully exciting. Now, I think that when we were probably on the same air at the same time, you weren't with the Trump campaign yet. How does something like that happen? Do they notice how excellent you are on these hits and how you communicate very well? How does that even come to fruition?",
        "start": 301.749,
        "end": 328.046
    },
    {
        "text": " I'd love to take that much credit. I've been an enthusiastic supporter of President Trump for a long time. I actually had the honor of serving in his White House. I was an intern in his White House press office, then had the honor of serving in his press office. And they always kind of say all roads can lead back to President Trump. And I'm so grateful to be on this team. I just think the stakes couldn't be higher for this country. And I've always thought ever since President Trump came down that escalator in 2015, that he was just a singular force in American politics. And it's truly my honor to get to play some role in",
        "start": 329.138,
        "end": 358.49
    },
    {
        "text": " in this movement that he leads so so beautifully i don't want to go to memory lane too much but were you an intern in 2017 i was yes so i think we met at the white house because i was one of five shows that was invited there and my daughter sam is my executive producer we went to the white house and interviewed the president about the tax cuts that were coming up we felt very very honored i know that i've seen you somewhere i'll bet you might have been there when we were there",
        "start": 358.763,
        "end": 382.91
    },
    {
        "text": " you are taking me back oh my gosh i have such fond memories of our time in the white house you know just everything that president trump was was able to accomplish and the great american patriots just such a what what an honor what an honor that is so great you're taking me down well good i'm glad that we went there for a second now let's talk about the future",
        "start": 383.37,
        "end": 401.135
    },
    {
        "text": " I think Trump was going to do great anyway. I think he was going to win by a landslide anyway. And then all of a sudden, holy mackerel, not only is Joe Biden gone like you and I and like Donald Trump knew already, now the media and the Democrat Party is forced to face it. Do you shift gears at all in the campaign for Trump, knowing that everybody now knows that Joe Biden is no longer there? Or do you just keep on doing what you were doing?",
        "start": 401.135,
        "end": 426.578
    },
    {
        "text": " Yeah, well, like you said, I mean, President Trump didn't just win that debate. He absolutely dominated it. I mean, it's like watching a UFC fighter take down just three opponents in one. You know, it's like the takedown of Joe Biden, the liberal mainstream media, and the Democrat Party, all of whom, as you have said, this isn't just the story of Joe Biden's decline. It's the story of the liberal mainstream media and Democrat Party concealing the truth from the American people. These people have known for years.",
        "start": 427.858,
        "end": 453.046
    },
    {
        "text": " that Joe Biden was weak and incompetent and declined, as have the American people, except the liberal mainstream media and Democrat Party have concealed that truth, saying, no, no, Joe's fine, he's sharp as a tack, he's doing cartwheels. Those same people now do not get to wake up and say, let's go, Brandon, if you know what I mean.",
        "start": 453.046,
        "end": 470.179
    },
    {
        "text": " No, we have known the truth of Joe Biden for the last four years, as has President Trump. We couldn't be prouder to have President Trump as the leader of our party and movement. And we are full steam ahead because long before the debate to end all debates, as I call it, President Trump was already winning and winning big. And that's because he's always been on the right side of the issues most important to the American people. And the American people have known about, yes, Joe Biden's decline for years, but they've also come to trust President Trump's strength and command.",
        "start": 470.179,
        "end": 500.179
    },
    {
        "text": " and his knowledge of the issues. And the debate was just simply another point to highlight that contrast. But we've been waiting big long before the debate to end all debates. Caroline Sunshine, she is the Deputy Communications Director for President Trump, Trump 2024.",
        "start": 500.418,
        "end": 519.258
    },
    {
        "text": " I guess what I meant by that was, was there a definitive shift from the president when he said, holy crap, you saw what just happened last night. I knocked it out of the park. He's gone. Instead of this, let's do this. Or is he full steam ahead, as you said, rally after rally after rally, 20, 30, 40,000 people showing up, standing room only. What's working was working. Why change it, I guess. So was there any definitive change after that night or no? Let's just keep going.",
        "start": 519.258,
        "end": 546.8
    },
    {
        "text": " Absolutely. Let's keep going. Let's keep the Trump train going. You just saw President Trump last night in Miami. I thought that was a particularly excellent rally. President Trump always brings his best, but a lot of his family members were there last night, and I think President Trump is such a family man. That's something that never gets highlighted in the literal mainstream media, but exactly. President Trump was winning big long before what ended up really being the death of Joe Biden's presidency and candidacy. And by the way, as we've seen, it doesn't matter who the Democrats put up. It doesn't matter if they end up with",
        "start": 548.029,
        "end": 577.927
    },
    {
        "text": " sleepy joe or with somebody more active outside of the hours of 10 and 4 p.m nobody that they can put up can beat president trump so at this point i just say to the democrat party save yourself millions of dollars you know do the right thing for the country maybe just sit this presidential election cycle out because it's very clear who people want and that's president donald a trump",
        "start": 577.927,
        "end": 595.64
    },
    {
        "text": " Exactly right. Caroline Sunshine, Trump 2024 deputy communications director. Are you guys trolling us? And let me tell you what I mean. I'm on the air yesterday and all the news comes out. He's going to announce his VP tonight. And I know that Donald Trump didn't say he was going to announce the VP. I know that you didn't say it. I know Liz Harrington didn't say it. I know that others didn't say it. So I know that Caroline Leavitt didn't say it.",
        "start": 595.691,
        "end": 615.981
    },
    {
        "text": " Are you guys leaking that out? Are you trolling us? Because everybody who's watching, when I tuned in during my show, he's talking about a million dollars to play golf against Joe Biden. So how do you think that happens? Is somebody in the media planting that seed? Is there anything to the fact that we might find out who the VP choice is before the convention or no? The liberal mainstream media planting seeds and being responsible? Joe, they would never. I'm shocked.",
        "start": 615.981,
        "end": 644.189
    },
    {
        "text": " Well, since we're just among friends, I would tell you. No, I'm just kidding. Of course, the only person who knows who President Trump is going to pick as his vice president is President Trump. He's also the only one, by the way, who knows when he will announce it. But as you and I both know, he has a talent for making news. He does. Everybody will most certainly know. But you know what? I'll say this about his VP pick. Again, it couldn't be a further point of contrast. We're fielding endless questions and speculation of",
        "start": 644.548,
        "end": 672.381
    },
    {
        "text": " Who is President Trump going to select as his vice president? And just, you know, endless media speculation over it. You can trust that with the Democrat Party, you know, or their questions, or is their VP nominee going to have to replace their nominee? And no matter who President Trump picks, he's certainly not going to select a DEI hire. He's going to select somebody who is going to be an excellent partner in helping him make America great, safe, strong, wealthy again, because he knows how high the stakes are for our country.",
        "start": 672.602,
        "end": 697.688
    },
    {
        "text": " You know, George Clooney called the White House today. I don't know if you heard about this. George Clooney, of course, is leftist, you know, actor from Hollywood. I guess he was mad that the Biden administration said something about some organization that his wife is involved in. But allegedly he's calling for Biden to drop out of the race. Carolyn, are you are you surprised as I am that some of these staunch.",
        "start": 698.78,
        "end": 717.466
    },
    {
        "text": " boots dug into the into the dirt uh liberals are are backing away from this guy because again they all knew it we just mentioned this they all knew it before the debate but now that the debate is out there and people that are soccer moms are working all day or doing whatever got to pay attention for an hour and a half they're all jumping ship are you surprised by some of the names that are backing their support away from joe biden",
        "start": 717.756,
        "end": 737.722
    },
    {
        "text": " I'm not shocked because these people love power more than they love the country, and they always have. But certainly when you see, I mean, just about everybody jumping ship, everybody from George Stephanopoulos to George Clooney, these people a month ago were some of the most ardent supporters of Joe Biden, right? I mean, I think George Clooney should have to explain that.",
        "start": 739.07,
        "end": 759.411
    },
    {
        "text": " Well, if you knew back then that Joe Biden was the man in decline that we all saw on the debate stage, why did you give him $14 million? And by the way, the fundraiser that George, since we're on the topic of that fundraiser, the fundraiser that George Clooney mentioned,",
        "start": 759.411,
        "end": 774.394
    },
    {
        "text": " There's another person who was in attendance at that fundraiser who's had a front row seat to Joe Biden's decline and who has been silent. But that's President Barack Obama, who was the one who babysat Joe Biden on that stage. So like I said, they've all known. There's nothing shocking about this. I think the only thing that is shocking is that these people have been willing to let this country go to hell in a handbasket before they have ever lifted a finger to tell the truth. And the only time they've told the truth is when it was about power, not about love of country.",
        "start": 775.026,
        "end": 800.435
    },
    {
        "text": " Well, yeah, we were supposed to watch that video of Biden frozen and Obama grabbing him by the wrist and taking him out and patting him on the back. Come on, Joe, let's go as he sashays or shuffles off the stage. We were supposed to believe that was a cheap fake. And it was a cheap fake when Biden froze at the Juneteenth celebration amidst all these people dancing and he just was lost.",
        "start": 800.435,
        "end": 818.626
    },
    {
        "text": " I mean, we were supposed to believe none of that was true. You and I made fake videos about it. And then they, for some reason, they put them on a stage for an hour and a half. Was President Trump, were you, was the campaign surprised that Joe Biden said he would debate? I was stunned.",
        "start": 818.626,
        "end": 832.824
    },
    {
        "text": " Well, President Trump said he would debate him anytime, anyplace, anywhere, and he certainly made good on that promise. I guess also, you know, you saw President Trump invite him to, maybe if Joe doesn't want to debate, he'll join him in a round of golf. And I would say this, President Trump very much proved that he'll debate anytime, anyplace, anywhere. He also proved he can win anytime, anyplace, anywhere, and that includes the golf course.",
        "start": 834.923,
        "end": 857.193
    },
    {
        "text": " According to the latest polls, Caroline, and you know this is Caroline Sunshine from the Trump campaign, according to the latest polls, President Trump's leading in every battleground state, everyone, rather easily in some. And in fact, some historically blue states. I think New York is in play. Maybe it's my heart speaking, maybe I'm being biased, but when he was able to, because they were dumb, they left him in New York City for six weeks, he was able to go to Harlem every day and take selfies. He was able to go to the local sandwich shop, the local pizza place, the local ice cream shop, and really get to know people.",
        "start": 857.244,
        "end": 886.459
    },
    {
        "text": " You had people show up when you were allowed 3,500, I think, at the rally in the Bronx or whatever it was. And then, you know, they had to turn away 20,000 or something. Go to New Jersey and get a million or not a million, 100,000 people show up to a rally. He might flip some blue states that we haven't seen go red since Reagan. Is that the feeling inside the campaign that you can do that?",
        "start": 886.459,
        "end": 905.606
    },
    {
        "text": " Absolutely. I mean, you know, you look at President Trump actually said this really eloquently when he was in Philadelphia. He was asked, he said, you know, sir, why are you coming here? This isn't a place for traditional Republicans go. This was long before the debate to end all debates. And he said, you know what? It's because I've realized there is so much love out here and people really need hope. And that's what I'm here to do. And so you've seen President Trump go to the deep blue Bronx. You've seen him go to Detroit. You've seen him go to parts of Philadelphia that traditional Republicans don't go to.",
        "start": 907.295,
        "end": 936.135
    },
    {
        "text": " Where has Joe Biden been? Has Joe Biden been to any of those places? No. He was having to be babysat on stage at a fundraiser by Barack Obama and sequestered away at Camp David, none of which made a difference, I might add. So everybody who is abandoning Joe Biden is flocking to President Trump. And we are seeing states that are in play, blue states that are in play for the first time in decades.",
        "start": 936.135,
        "end": 955.947
    },
    {
        "text": " That's really a credit to President Trump and his message. He's on the right side of the issues that are most important to the American people. He was just intricately involved in putting together our party's platform. And I love that that platform at the top of it says, this platform is dedicated to the forgotten men and women of America.",
        "start": 955.947,
        "end": 972.858
    },
    {
        "text": " And President Trump has always said he hasn't said I'm going to make the Republican Party great again. He has always said I'm going to make America great again. He's going to be president for all Americans. And when you look at the things that he stands for, like securing our border, stopping the invasion that is occurring at our southern border, helping to protect our women and children from being killed by violent, illegal immigrants.",
        "start": 972.858,
        "end": 990.896
    },
    {
        "text": " restoring our manufacturing base, restoring our standing on the world stage, a country we can be proud of, a country that is respected and feared. Those are things that resonate with all Americans. I also might add, you look at Joe Biden, what he's been able to do to the U.S. economy. My goodness, he makes Jimmy Carter look like a lightweight. Whether you're black, white, or brown in this country, everybody's money's green, and nobody has enough under Joe Biden. So that's why we're seeing all these groups who are traditionally part of Joe Biden's voter base, African Americans, union workers, independents, young people, women, flock to President Trump.",
        "start": 990.896,
        "end": 1020.367
    },
    {
        "text": " You know what the weirdest thing is about the economic debate, Caroline, is that the left really is looking at the camera and saying something like this. They just don't realize how good they have it. They don't realize the economic improvement they've had. And people in America are going, it doesn't matter what my race is, like you said, or my orientation is, or my gender is, or my ancestry. What matters is I can't pay my bills. What matters is my bank account has been decimated by this president.",
        "start": 1020.64,
        "end": 1044.07
    },
    {
        "text": " Why do you think, and I don't want you to get into the brains of the other side's campaign because that might hurt your head, but why would they ever look at the camera and say, don't believe what you're actually living through, believe what we're saying?",
        "start": 1044.514,
        "end": 1055.486
    },
    {
        "text": " these people are wildly out of touch with the american people they always happen these are limousine liberals i know we all know that joe biden is a few french fries short of a happy meal but these people couldn't tell you the cost of a happy meal and by the way a big mac today costs seven dollars and 49 cents which is an 87.7 percent increase from just five years ago you go to the grocery store try to buy a bag of barbecue chips six dollars and 19 cents you go to fill up your your gas tank four or five dollars depending on where you are in the united states",
        "start": 1056.886,
        "end": 1086.254
    },
    {
        "text": " But these people are so out of touch. It's always rules for thee, never for me. It's the same reason they're so out of touch on any of the issues that are important to the American people, like what's going on at the southern border. These people live in gated communities. They have no idea that every town has become a border town. They are so out of touch with the American people. And it's why they really don't have, not only do they appear as not to have a candidate viable who can run, they don't have a viable platform to run. They cannot offer the American people solutions to their problems",
        "start": 1086.254,
        "end": 1114.121
    },
    {
        "text": " chiefly because they are so out of touch with what the problems are to begin with. These people think that Americans want electric vehicle mandates. No, no, no. Americans don't want that. They also don't want free flights and free housing for illegal immigrants. They want those illegal immigrants that Joe Biden has welcomed into our country by the millions, and who, by the way, he wants to give them the right to vote, right, as we just saw in Congress. They want mass deportations for illegal immigrants. 62% of Americans want that.",
        "start": 1114.121,
        "end": 1137.108
    },
    {
        "text": " These people have always been out of touch. They have their heads in the sand. They do not live the reality that the American people live. And it's why not only Joe Biden is unfit to serve. It's why the Democrat Party is unfit to serve.",
        "start": 1137.108,
        "end": 1147.312
    },
    {
        "text": " It's Caroline Sunshine, Deputy Communications Director, Trump 2024. I appreciate the time and the access. You brought up immigration a lot, and you should, because that is the most important stateside, the most important issue, period, for Americans. But the left has done a very good job through big academia, big Hollywood, big music, big sports, big television news media. These people, academia, they all have been saying it's not that it's abortion. It's not that it's some other issue that they think they have an upper hand on Trump.",
        "start": 1147.568,
        "end": 1176.544
    },
    {
        "text": " As somebody in the campaign, do you have to see what they're doing and react? Or just, as I said earlier, keep on doing what you're doing? You're right. Immigration is the most, it's the existential threat, if you don't mind. They always say that word. But it's the biggest threat to our democracy, to our representative republic. It's the biggest threat to our future. It's the biggest threat to our way of life, Western culture, all of that stuff. It is the most important issue. They've done a really good job, though, Carolina, of trying to change the topic. Do you have to adjust to that as a campaign or not?",
        "start": 1176.544,
        "end": 1204.599
    },
    {
        "text": " Well, I would say if we don't have a border, we don't have a nation. And if they want to talk about being pro-life or pro-choice, I'm happy to talk about being pro-life all day long. You cannot be pro-open border and be pro-life and be pro-women and be pro-children. As we have seen, millions of illegal immigrants come across our southern border. Look at who the victims of most of those violent crimes have been.",
        "start": 1206.101,
        "end": 1225.811
    },
    {
        "text": " They've been very vulnerable women and children. So if we want to talk about empowering women, protecting women, protecting life, we absolutely have to talk about securing our border. And I think that's what women want. Women don't like weak men. They want a strong leader like President Trump. Women understand that weakness invites chaos and danger.",
        "start": 1226.049,
        "end": 1243.592
    },
    {
        "text": " And once again, that's why, like you said, immigration is the number one issue for a reason. And it's an issue that has long been overlooked and intentionally ignored by the Democrat Party, who once again is so out of touch with where millions of Americans are at on a host of issues, not just that one.",
        "start": 1243.592,
        "end": 1259.838
    },
    {
        "text": " Go follow her on social media. It's Caroline Sunshine with the Trump campaign. Last question, sort of tongue-in-cheek. Again, I saw the president yesterday vamping away from the teleprompter, which I love when he does that. And he offered up a million dollars to Joe Biden's favorite charity should Biden beat him in a golf match. I mean, Trump is now playing. He's a real golfer. He's a very good golfer. And Biden, of course, lied about a sex handicap or a nine handicap or something. Trump said he'd give him 20 strokes. I mean, would it freak you out if somebody from the Biden campaign said, yeah, let's do it?",
        "start": 1260.026,
        "end": 1288.404
    },
    {
        "text": " Look at my face, Joe. Does it look like it? Come on. Give me a break. President Trump checked Joe Biden in real time on that debate. So you said, Joe, you have told so many lies tonight, but the biggest one is that you have a six handicap in golf. Give me a break. I mean, if Joe Biden has a six handicap in golf, I'm a Democrat, okay? So give me a break, Joe. Well, then it's guaranteed that he doesn't have a six handicap then. It's Caroline Sunshine, Deputy Communications Director, Trump 2024. Love having you on. Come back again soon, would you?",
        "start": 1290.913,
        "end": 1320.23
    },
    {
        "text": " Thank you so much. Thank you. I will. You're very welcome. We're back after this at the Joe Pag Show. Stay here. This is the Joe Pag Show. Kello News Talk 1320 107.9.",
        "start": 1321.049,
        "end": 1337.875
    },
    {
        "text": " Oh, no. Stomach issues again? Stomach issues? Who are you? Your pancreas. I could be the real reason for your diarrhea, gas, bloating, stomach pain, or loose oily stools. I thought it was my stomach. People often do. But any of these symptoms could mean having a condition called exocrine pancreatic insufficiency, or EPI. With EPI, the pancreas doesn't release enough enzymes to break down food. But EPI is manageable. Use the symptom checker on identifyepi.com and speak with your doctor. That's identifyepi.com. Sponsored by AbbVie.",
        "start": 1345.247,
        "end": 1374.258
    },
    {
        "text": " Hi, I'm Angie Hicks, co-founder of Angie. When you use Angie for your home projects, you know all your jobs will be done well. Roof repair? Done well. Kitchen sink install? Done well. Deck upgrades? Done well. Electrical upgrade? Done well. Angie's been connecting homeowners with skilled pros for nearly 30 years, so we know the difference between done and done well. Hire high-quality certified pros at Angie.com.",
        "start": 1374.258,
        "end": 1402.944
    },
    {
        "text": " Thank you. Thank you.",
        "start": 1403.814,
        "end": 1424.36
    },
    {
        "text": " ZipRecruiter's advanced technology identifies the candidates with the skills you need, sends you a list of great matches to review, then actively invites them to apply for your job. And the results speak for themselves. Four out of five employers who post on ZipRecruiter get a quality candidate within the first day. That's right, the first day. Now you can focus on your business and let ZipRecruiter do the work finding the best people for you.",
        "start": 1424.36,
        "end": 1448.882
    },
    {
        "text": " See for yourself. Experience the ease, efficiency, and power of ZipRecruiter for free. Just go to ZipRecruiter.com slash free. That's ZipRecruiter.com slash free. ZipRecruiter.com slash free.",
        "start": 1448.882,
        "end": 1463.097
    },
    {
        "text": " All right, listen up, shingles. We've been protecting this roof for years. It's been a weird winter. Enough is enough. Seriously, it was hot, it was cold, it was wet, it was dry. I'm springing more leaks than the government. Why? I'm so damp. Mold and mildew are my new BFFs. Look at all the trouble that's popping up now. Are you shingling me? Looks like we have a protest.",
        "start": 1464.684,
        "end": 1484.07
    },
    {
        "text": " Got new problems popping up on your roof? Call Woods Roofing, 605-764-9517. Woods Roofing, creating trust and peace of mind every shingle time. Managing a company is exciting and in today's world, challenging. That's why at Bank Midwest, we've added more benefits to our basic business and business checking accounts. Benefits to help you fight fraud and be more efficient. And these benefits are free. We're here to help local companies be more successful.",
        "start": 1484.07,
        "end": 1512.875
    },
    {
        "text": " So we're even offering a cash bonus when you open your accounts. If getting some extra cash and extra fraud protection matches your goals, come see us. Bank Midwest. Member FDIC. I served almost six years in the Army. Ten years. Great years in the Navy. And I joined the Marines in 2016. I was a senior in high school.",
        "start": 1512.875,
        "end": 1532.193
    },
    {
        "text": " My family really wants to be settled in one place. I got so much experience in technical training in the Army. Now I want to turn that into a civilian career, but I still want to serve. Also, the benefits are so important to us. I'm ready to go to college now. I want to give back, too. Get the best of both worlds.",
        "start": 1532.193,
        "end": 1549.309
    },
    {
        "text": " and the South Dakota Army National Guard. Serve your country and your community part-time while you live your life as a full-time citizen soldier. With 60 units in over 100 occupations in South Dakota, you and your family can stay grounded, close to home. Keep the benefits going. Work toward your 20. Maybe take on a new MOS and gain extra skills. I joined the Guard because I still feel a sense of duty.",
        "start": 1549.309,
        "end": 1570.333
    },
    {
        "text": " The word Army is still going to be on my uniform, but now I get to add the patch of the state I live in. Visit NationalGuard.com slash SD to learn more. Sponsored by the South Dakota Army National Guard, aired by the South Dakota Broadcasters Association, and this station. Greg Belfridge, weekday mornings 6 to 9. Kello, News Talk 1320, 107.9. We appreciate Caroline Sunshine coming on.",
        "start": 1570.333,
        "end": 1595.009
    },
    {
        "text": " From the Trump campaign. I did not realize this. I guess she used to be an actress on Disney or something. My daughter, Gabby, used to watch. Sam, you were mentioning she used to be on a show. I looked it up, or you sent me a link, and she was on with Zendaya. So I guess she was kind of a big deal. I don't know. I guess so. Did you ever watch it?",
        "start": 1595.009,
        "end": 1611.254
    },
    {
        "text": " I'm a little older than that, but I believe that Gabby probably really enjoyed it. Well, she did. I mean, I texted Gabby during it. She said, oh, yeah, of course I know her. So very nice to talk to her. Very nice to meet Caroline. We'll have her back on again. Certainly tomorrow, a big show coming your way. Carrie Lake, Rick Grinnell. We've got Matt Gates on tomorrow. There's a lot going on heading into the into the RNC where I'm not going to go to the RNC.",
        "start": 1612.159,
        "end": 1632.995
    },
    {
        "text": " We're going to have our friend and reporter Brianna Morello will be there. She'll be doing reports from there. But we're leading up to that. We're going to have all the big players. Do not miss a second of the Joe Pag Show. That's Sam. That's Polo. That's Carrie. I'm Joe. We'll see you tomorrow. Have a good night. This is the Joe Pag Show.",
        "start": 1632.995,
        "end": 1649.309
    },
    {
        "text": " Do you hear that? Asthma triggers are everywhere, from dust mites, pet dander, and pollen, to smog and smoke. An asthma attack can strike anywhere, anytime. Be prepared with quick-acting primatine mist, clinically proven to open airways quickly.",
        "start": 1654.104,
        "end": 1671.869
    },
    {
        "text": " It's the number one FDA-approved asthma inhaler available over the counter. Primatine Mist. Breathe easy again. Use as directed. Hi, I'm Angie Hicks, co-founder of Angie. And one thing I've learned is that you buy a house, but you make it a home.",
        "start": 1671.869,
        "end": 1688.217
    },
    {
        "text": " Because with every fix, update, and renovation, it becomes a little more your own. So you need all your jobs done well. For nearly 30 years, Angie has helped millions of homeowners hire skilled pros for the projects that matter. From plumbing to electrical, roof repair to deck upgrades. So leave it to the pros who will get your jobs done well. Hire high-quality certified pros. Kitchens and windows. Kitchens and windows. Unlimited. Just look what we can do.",
        "start": 1688.217,
        "end": 1717.705
    },
    {
        "text": " Is it your turn to hold the family get together? Does the mere thought of this bring you anxiety? You know the room that everyone will gravitate to is your outdated, dysfunctional kitchen. The kitchen is the hub of the home, making it the perfect place for friends and family to gather, relax, and share the latest news.",
        "start": 1718.285,
        "end": 1735.538
    },
    {
        "text": " Hi, I'm Tim Lund from Kitchens and Windows Unlimited. Let us help you relieve your anxiety by creating a kitchen that will make a lasting impression and increase your efficiency. We have cabinetry with style, craftsmanship, and value from Cook Cabinetry and Holiday Kitchens. With a huge variety of options in woods, stains, and glazes, we're sure to have the perfect combination to make your kitchen functional and a space you'd be proud to hold family gatherings. Stop by our showroom at 3rd and Kiwanis or check us out on the web at kwunlimited.com.",
        "start": 1735.538,
        "end": 1764.189
    },
    {
        "text": " KELO News Talk 1320 KELO Sioux Falls FM 107.9 KELQ Flandreau Sioux Falls",
        "start": 1764.189,
        "end": 1779.36
    },
    {
        "text": " More calls for the president to drop out. I'm Carmen Roberts, Fox News. This time it comes from the first Democratic senator. Peter Welch of Vermont is asking President Biden to give up his reelection bid for the good of the country. And some of the most powerful Democrats are now open to leaving Biden off the ticket. Senate Majority Leader Chuck Schumer, former House Speaker Nancy Pelosi, and House Minority Leader Akeem Jeffries raised eyebrows with reports and comments regarding Biden's candidacy. Axios is reporting.",
        "start": 1782.773,
        "end": 1812.176
    }
]